      *%METADATA                                                       *
      * %TEXT field reference BLPGM                                    *
      *%EMETADATA                                                      *
     A**********************************************************************
     A*           FLDREF  -  FIELD REFERENCE FILE FOR ALL A/R FILES
     A**********************************************************************
     A*
     A*  ALL FILES IN ALPHABETICAL ORDER
     A*
     A*           AIHD    -    AH      AIRBILL INTERLINE LIABILITY HDR
     A*           AID1    -    A1      AIRBILL INTERLINE LIABILITY DTL1
     A*           AID2    -    A2      AIRBILL INTERLINE LIABILITY DTL2
     A*           ARBA    -    E       MONTHLY A/R BALANCES FILE
     A*           ARBD    -    D       DAILY A/R BALANCES FILE
     A*           ARBW    -    W       WEEKLY FLEET/NON-FLEET DETAILS
     A*           ARBX    -    X       WEEKLY A/R SUPER REPORT SETUP
     A*           ARBY    -    Y       WEEKLY A/R SUPER REPORT SETUP
     A*           ARBZ    -    Z       WEEKLY MAIN A/R NUMBERS
     A*           BASF    -    B8      BASS PRO SHOP CASH WORKFILE
     A*           BBAM    -    AM      BEST BUY MATCH AFTER THE FACT LOG
     A*           BBXA    -    BA      BEST BUY DC'S FIXED ALLOC TABLE
     A*           BBXB    -    BB      BEST BUY LOCATIONS
     A*           BBXC    -    BC      BEST BUY NON-NUMERIC DC CONVERSION
     A*           BBFB    -    BB      BEST BUY FLEET BILLS
     A*           BBXD    -    BD      BEST BUY DC'S TABLE
     A*           BBXE    -    BE      BEST BUY EXPENCE TABLE
     A*           BBXF    -    BF      BEST BUY CARRIER CONVERSION TABLE
     A*           BBXG    -    BG      BEST BUY PRIMARY/SECONDARY ACCOUNT X-REF
     A*           BBXM    -    BM      BEST BUY SERVICE EXCEPTIONS
     A*           BBXP    -    BP      BEST BUY PRO SPREADSHEET
     A*           BBXQ    -    BQ      BEST BUY PRO SPREADSHEET
     A*           BBXS    -    BS      BEST BUY SWITCHING EXPENCE TABLE
     A*           BBXT    -    BT      BEST BUY CODE CONVERSION TABLE
     A*           BBXU    -    BU      BEST BUY EXCEPTIONAL ACCESSORIAL RATES
     A*           BBXV    -    BV      BEST BUY DC NAME/DC CODE X-REF
     A*           BBXW    -    BW      BEST BUY BILL-TO/DC CODE X-REF
     A*           BBXX    -    BX      BEST BUY EXTENTION FOR FLCT
     A*           BBXY    -    BY      BEST BUY RATES & EXP DATE
     A*           BBXZ    -    BZ      BEST BUY BILLING RPT LOG
     A*           BCFD    -    BK      BURINGTON COAT FACTORY DETAIL
     A*           BCFH    -    BH      BURINGTON COAT FACTORY HEADER
     A*           BCFN    -    BN      BURINGTON COAT FACTORY CHECK TOTALS FILE
     A*           BCFS    -    BI      BURINGTON COAT FACTORY STORE MASTER
     A*           BCFT    -    BJ      BURINGTON COAT FACTORY TEXT FILE
     A*           BCFL    -    BL      BURINGTON COAT FACTORY EXCELL CASH REMIT
     A*           BDED    -    BD      BILLING DEFICIENCY EDI STATUS CHANGE
     A*           BLDT    -    D       B/L DETAIL FILE
     A*           BLEX    -    EX      MONTHLY PRO EXCEPTION REGISTER
     A*           BLHD    -    H       B/L HEADER
     A*           BLIL    -    F       B/L HEADER INTERLINE INFO
     A*           BLPO    -    O       B/L PURCHASE ORDER FILE
     A*           BLPR    -    PR      MONTHLY PRO REGISTER WORK FILE
     A*           BLSI    -    S       B/L SPECIAL INSTRUCTIONS
     A*           BLSJ    -    SJ      SALES JOURNAL WORK FILE.
     A*           BLST    -    5       B/L STOP DETAILS
     A*           BTCA    -    B@      A/R CASH BATCHES - I/C ACH
     A*           BTCD    -    B$      A/R CASH BATCHES LOG FILE (DTL)
     A*           BTCH    -    B#      A/R CASH BATCHES LOG FILE
     A*           CASH    -    K       A/R CASH FILE
     A*           CBAL    -    4       NEW CUSTOMER BALANCES FILE.
     A*           CHEK    -    Q       CHECK
     A*           CH3P    -    3CH     3-RD PARTY I/L CHASSIS CHARGES LOG
     A*           CMWK    -    CM      CREDIT MEMO WORK FILE.
     A*           COSC    -    UN      COLLECTION SCRATCH PAD NEW
     A*           COSD    -    UD      COLLECTION SCRATCH PAD NEW DET
     A*           COSP    -    U       COLLECTION SCRATCH PAD
     A*           CQHT    -    QH      SALESMAN QUARTERLY COMMISSION HISTORY
     A*           CQWK    -    QW      SALESMAN QUARTERLY COMMISSION WORKFILE
     A*           CSCM    -    UC      COMMENT FILE FOR BLPGM/CUST
     A*           CSWK    -    CS      DAILY CASH REPORT WORKFILE.
     A*           CUBA    -    2       ACCOUNT BALANCES/SALES FILE
     A*           CUMB    -    22      ACCOUNT MONTHLY BALANCES FILE
     A*           CUMT    -    23      12 MONTH PERIOD A/R BALANCES
     A*           CUST    -    A       ACCOUNT MASTER FILE
     A*           DESC    -    C       COMMODITY DESCRIPITON
     A*           DSWF    -    DS      DSW CASH WORKFILE
     A*           DGEN    -    DG      DOLLAR GENERAL CASH WORKFILE
     A*           DSGC    -    DC      DSG GENERAL CASH WORKFILE
     A*           EDID    -    RD      EDI REQUIREMENTS DETAIL
     A*           EDIH    -    RH      EDI REQUIREMENTS HEADER
     A*           EFOP    -    V       EDI FOR FEDERATED 214 FOR KYSO
     A*           EFOM    -    N       EDI FOR FEDERATED 214 FOR KYSO
     A*           EFOR    -    U       EDI FOR FEDERATED 214 FOR KYSO
     A*           EFNH    -    FH      EDI/CASS FEDERATED 210 FOR KYSO
     A*           EFNB    -    FB      EDI/CASS FEDERATED 210 FOR KYSO
SC   A*           EFNC    -    FC      EDI/CASS FEDERATED 210 FOR KYSO
     A*           EFND    -    F1      EDI/CASS FEDERATED 210 FOR KYSO
     A*           EFNR    -    FR      EDI/CASS FEDERATED 210 FOR KYSO
     A*           EFNK    -    L9      EDI/CASS FEDERATED 997
     A*           EJOD    -    JD      EDI FOR JOANN STORES 210 DETAIL
     A*           EJOH    -    JH      EDI FOR JOANN STORES 210 HEADER
     A*           EJOI    -    JI      EDI FOR JOANN STORES 210 DETAIL
     A*           EJOK    -    JK      EDI FOR JOANN STORES 997
GP   A* !!!!!!!! EKD1, EKD2,EKH1, EKH2, EKT1
GP   A* !!!!!!!! OBJECTS TAKEN OUT SINCE IT IS A KMART FILE
     A*           EKD1    -    D       EDI B/L DETAIL FILE
     A*           EKD2    -    D       EDI B/L DETAIL FILE
     A*           EKH1    -    H       EDI B/L HEADER FOR KMART
     A*           EKH2    -    O       EDI B/L REF. NUMBERS FILE
     A*           EKT1    -    W       EDI KMART TOTALS FILE
     A*           ELNC    -    LC      EDI FOR LNT 997 COMPTON
     A*           ELND    -    LD      EDI FOR LNT 210 DETAIL
     A*           ELNH    -    LH      EDI FOR LNT 210 HEADER
     A*           ELNK    -    LK      EDI FOR LNT 997
     A*           ELNR    -    LR      EDI FOR LNT 210 DETAIL
     A*           EMD1    -    MD      EDI B/L DETAIL FOR MICHAELS
     A*           EMH1    -    MH      EDI B/L HEADER FOR MICHAELS
     A*           EMH9    -    M9      EDI FOR MICHEALS     997
SC   A*           ETGB    -    GB      EDI TARGET 210
SC   A*           ETGH    -    GH      EDI TARGET 210
SC   A*           ETGP    -    GP      EDI TARGET 210
SC   A*           ETGR    -    GR      EDI TARGET 210
     A*           ETJH    -    TH      EDI TJMAX 210
     A*           ETJB    -    TB      EDI TJMAX 210
     A*           ETJD    -    T1      EDI TJMAX 210
     A*           ETJK    -    TK      EDI TJMAX 210
GP   A*           ETJN    -    TN      EDI TJMAX 210
     A*           ETJR    -    TR      EDI TJMAX 210
     A*           E82A    -            EDI FOR 820 HEADER DOCS
     A*           E82B    -            EDI FOR 820 HEADER DOCS
     A*           E82C    -            EDI FOR 820 HEADER DOCS
     A*           E82D    -            EDI FOR 820 HEADER DOCS
     A*           E82H    -    8H      EDI FOR 820 HEADER DOCS
     A*           E82O    -    OP      CASH 820 OVERPAYMENT DETAILS
     A*           E82X    -    CX      CASH 820 CONSOLIDATION CHGS.
     A*           FLCT    -    CT      FLEET INVOICE CONTROL FILE
     A*           FLIN    -    IN      FLEET INVOICE LOG
     A*           FLTX    -    TX      FLEET TRAILER FIX
     A*           GLCA    -    B       GENERAL LEDGER CHART OF ACCTS
     A*           GRUP    -    1       ACCT GROUP MASTER FILE
     A*           ICAC    -    IC      INTER COMPANY ACCOUT# X-REF
     A*           ICAS    -    IS      INTER CO. CASH APPL SUMMARY
     A*           ICTR    -    G       INTER COMPANY TRANSFERS
PR   A*           IKEA    -    IK      IKEA CASH REMITTANCE FILE
     A*           ILAP    -    J       INTERLINE PAYMENTS
     A*           ILCA    -    I       INTERLINE CARRIERS
     A*           ILCL    -    IZ      INTERLINE CARRIER LIABILITY WORKFILE
     A*           ILEX    -    IX      EXCLUDE PRO FROM I/L PAYMENT
     A*           ILHS    -    XX      SUBMISSION OF I/L VOUCHERS LOG
     A*           ILIN    -    II      INTERLINE INVOICE REGISTRY
     A*           ILPH    -    J       INTERLINE PAYMENTS HISTORY
     A*           ILXD    -    XD      DETAIL ADDITION TO ILXF
     A*           ILXF    -    F       NRS PRO# / I/L INVOICE# X-REF
     A*           ILWK    -    IW      INTERLINE REPORT WORKFILE
     A*           IL8W    -    I8      I/L CARRIER SUMMARY WORKFILE
PR   A*           IORV    -    IO      INBOUND OUTBOUND REV WORKFILE
GP   A* !!!!!!!! LOCT OBJECT TAKEN OUT SINCE IT IS A KMART FILE
     A*           LOCT    -    L       LOCATION FILE (KMART EDI)
     A*           LFPE    -    LF      LF SOURCING PRO EXCEPTIONS
     A*           LGWK    -    LG      LG OPEN RECV WORK FILE
     A*           MDLA    -    MDL     MEDLINE ACCESSORIAL PROS
     A*           MGHS    -    MG      MERCURY GATE RECONCILIATION HISTORY
     A*           PDWK    -    PD      NRC/NRT A/R PASS DUE WORKFILE
     A*           PMET    -    PM      ENTITY GROUP CODE
     A*           BLSJ    -    SJ      SALES JOURNAL WORK FILE.
     A*           RCPY    -    V       REVERSE CASH PAYMENT FILE
     A*           RLDX    -    R       ROLLODEX CUSTOMER FILE
     A*           ROSF    -    RS      ROSS STORES CASH REMITTANCE WORKFILE.
     A*           SLSC    -    8       SALESMAN COMMISSION TRANSACTION
     A*           SLSD    -    7       SALESMAN ACCT MASTER FILE
     A*           SLSL    -    11      SALESMAN LANE MASTER FILE
     A*           SLSM    -    6       SALESMAN FILE
     A*           SLSW    -    9       SALESMAN COMMISSION TRANS WRKF
SC   A*           STNB    -    NB      EDI STEINMART 210
SC   A*           STNH    -    NH      EDI STEINMART 210
SC   A*           STNK    -    NK      EDI STEINMART 210
SC   A*           STNR    -    NR      EDI STEINMART 210
     A*           SUBQ    -    3       SUBSEQUENT PAYMENT VERIF. FILE
PR   A*           TADT    -    TD      TARGET DETENTION CHARGES (EDI)
     A*           TJD$    -    D$      TJX DIFFERENTIAL BILLING LOG
     A*           TJDB    -    DB      TJX DIFFERENTIAL BILLING SETUP
     A*           TJXI    -    TI      TJX FLEET INVOICING TABLE
     A*           TPID    -    TP      TRADING PARTNER ID MASTER
     A*           TRAC    -    T       TRACK OF ACTIONS DONE TO A/R
     A*           CSCM    -    UC      COMMENT FILE FOR BLPGM/CUST
     A*           TRID    -    Z       TERMINAL FILE
PR   A*           TWRK    -    TW      TARGET WORKFILE FOR A/R STMT
     A*           UPDN    -    UD      UPSIDE DOWN PROS REPORT DISTRO
     A*           VHWK    -    VK      VOUCHER FOR RESOLVING OVERPAYMENTS
     A**********************************************************************
     A*  ALL FILES IN ORDER BY SUFFIX
     A*
     A*           GRUP    -    1       ACCT GROUP MASTER FILE
     A*           CUBA    -    2       ACCT MASTER BALANCES FILE
     A*           CUMB    -    22      ACCT MONTHLY BALANCES FILE
     A*           CUMT    -    23      12 MONTH PERIOD A/R BALANCES
     A*           SUBQ    -    3       SUBSEQUENT PAYMENT VERIF. FILE
     A*           CH3P    -    3CH     3-RD PARTY I/L CHASSIS CHARGES LOG
     A*           CBAL    -    4       NEW CUSTOMER BALANCES FILE.
     A*           BLST    -    5       B/L STOP DETAIL
     A*           SLSM    -    6       SALESMAN FILE
     A*           SLSD    -    7       SALESMAN ACCT MASTER FILE
     A*           SLSC    -    8       SALESMAN COMMISSION TRANSACTION
     A*           SLSW    -    9       SALESMAN COMMISSION TRANS WRKF
     A*           SLSL    -    11      SALESMAN LANE MASTER FILE
     A*           CUST    -    A       ACCOUNT MASTER FILE
     A*           AIHD    -    AH      AIRBILL INTERLINE LIABILITY HDR
     A*           BBAM    -    AM      BEST BUY MATCH AFTER THE FACT LOG
     A*           AID1    -    A1      AIRBILL INTERLINE LIABILITY DTL1
     A*           AID2    -    A2      AIRBILL INTERLINE LIABILITY DTL2
     A*           GLCA    -    B       GENERAL LEDGER CHART OF ACCTS
     A*           BTCH    -    B#      A/R CASH BATCHES LOG FILE
     A*           BTCD    -    B$      A/R CASH BATCHES LOG FILE (DTL)
     A*           BTCA    -    B@      A/R CASH BATCHES - I/C ACH
     A*           BASF    -    B8      BASS PRO SHOP CASH WORKFILE
     A*           BBXA    -    BA      BEST BUY DC'S FIXED ALLOC TABLE
     A*           BBFB    -    BB      BEST BUY FLEET BILLS
     A*           BBXB    -    BB      BEST BUY LOCATIONS
     A*           BBXC    -    BC      BEST BUY NON-NUMERIC DC CONVERSION
     A*           BDED    -    BD      BILLING DEFICIENCY EDI STATUS CHANGE
     A*           BBXD    -    BD      BEST BUY DC'S TABLE
     A*           BBXE    -    BE      BEST BUY EXPENCE TABLE
     A*           BBXF    -    BF      BEST BUY CARRIER CONVERSION TABLE
     A*           BBXG    -    BG      BEST BUY PRIMARY/SECONDARY ACCOUNT X-REF
     A*           BCFH    -    BH      BURINGTON COAT FACTORY HEADER
     A*           BCFS    -    BI      BURINGTON COAT FACTORY STORE MASTER
     A*           BCFT    -    BJ      BURINGTON COAT FACTORY TEXT FILE
     A*           BCFD    -    BK      BURINGTON COAT FACTORY DETAIL
     A*           BCFL    -    BL      BURINGTON COAT FACTORY EXCELL CASH REMIT
     A*           BBXM    -    BM      BEST BUY SERVICE EXCEPTIONS
     A*           BCFN    -    BN      BURINGTON COAT FACTORY CHECK TOTALS FILE
     A*           BBXP    -    BP      BEST BUY PRO SPREADSHEET
     A*           BBXQ    -    BQ      BEST BUY PRO SPREADSHEET
     A*           BBXS    -    BS      BEST BUY SWITCHING EXPENCE TABLE
     A*           BBXT    -    BT      BEST BUY CODE CONVERSION TABLE
     A*           BBXU    -    BU      BEST BUY EXCEPTIONAL ACCESSORIAL RATES
     A*           BBXV    -    BV      BEST BUY DC NAME/DC CODE X-REF
     A*           BBXW    -    BW      BEST BUY BILL-TO/DC X-REF
     A*           BBXX    -    BX      BEST BUY EXTENTION FOR FLCT
     A*           BBXY    -    BY      BEST BUY RATES & EXP DATE
     A*           BBXZ    -    BZ      BEST BUY BILLING RPT LOG
     A*           DESC    -    C       COMMODITY DESCRIPITON
     A*           CMWK    -    CM      CREDIT MEMO WORK FILE.
     A*           CSWK    -    CS      DAILY CASH REPORT WORKFILE.
     A*           FLCT    -    CT      FLEET INVOICE CONTROL FILE
     A*           E82X    -    CX      CASH 820 CONSOLIDATION CHGS.
     A*           BLDT    -    D       B/L DETAIL FILE
     A*           EKD1    -    D       EDI B/L DETAIL FILE
     A*           EKD2    -    D       EDI B/L DETAIL FILE
     A*           TJD$    -    D$      TJX DIFFERENTIAL BILLING LOG
     A*           TJDB    -    DB      TJX DIFFERENTIAL BILLING SETUP
     A*           DSGC    -    DC      DSG GENERAL CASH WORKFILE
     A*           DSWF    -    DS      DSW CASH WORKFILE
     A*           DGEN    -    DG      DOLLAR GENERAL CASH WORKFILE
     A*           ARBA    -    E       MONTHLY A/R BALANCES FILE
     A*           BLEX    -    EX      MONTHLY PRO EXCEPTION REGISTER
     A*           ARBD    -    D       DAILY A/R BALANCES FILE
     A*           BLIL    -    F       B/L HEADER INTERLINE INFO
     A*           ILXF    -    F       NRS PRO# / I/L INVOICE# X-REF
     A*           EFNH    -    FH      EDI/CASS FEDERATED 210 FOR KYSO
     A*           EFNR    -    FR      EDI/CASS FEDERATED 210 FOR KYSO
     A*           EFND    -    F1      EDI/CASS FEDERATED 210 FOR KYSO
     A*           ICTR    -    G       INTER-COMPANY TRANSFERS
     A*           BLHD    -    H       B/L HEADER
GP   A*           ETJN    -    TN      EDI TJMAX 210
     A*           EKH1    -    H       EDI B/L HEADER FOR KMART
     A*           ILCA    -    I       INTERLINE CARRIERS
     A*           ICAC    -    IC      INTER COMPANY ACCOUT# X-REF
     A*           ILIN    -    II      INTERLINE INVOICE REGISTRY
PR   A*           IKEA    -    IK      IKEA CASH REMITTANCE FILE
     A*           FLIN    -    IN      FLEET INVOICE LOG
PR   A*           IORV    -    IO      INBOUND OUTBOUND REV WORKFILE
     A*           ICAS    -    IS      INTER CO. CASH APPL SUMMARY
     A*           ILWK    -    IW      INTERLINE REPORT WORKFILE
     A*           ILEX    -    IX      EXCLUDE PRO FROM I/L PAYMENT
     A*           ILCL    -    IZ      INTERLINE CARRIER LIABILITY WORKFILE
     A*           IL8W    -    I8      I/L CARRIER SUMMARY WORKFILE
     A*           ILAP    -    J       INTERLINE PAYMENTS
     A*           ILPH    -    J       INTERLINE PAYMENTS HISTORY
     A*           EJOD    -    JD      EDI FOR JOANN STORES 210 DETAIL
     A*           EJOH    -    JH      EDI FOR JOANN STORES 210 HEADER
     A*           EJOI    -    JI      EDI FOR JOANN STORES 210 DETAIL
     A*           EJOK    -    JK      EDI FOR JOANN STORES 997
     A*           CASH    -    K       A/R CASH FILE
GP   A* !!!!!!!! LOCT OBJECT TAKEN OUT SINCE IT IS A KMART FILE
     A*           LOCT    -    L       LOCATION FILE (KMART EDI)
     A*           ELNC    -    LC      EDI FOR LNT 997 COMPTON
     A*           ELND    -    LD      EDI FOR LNT 210 DETAIL
     A*           LFPE    -    LF      LF SOURCING PRO EXCEPTIONS
     A*           LGWK    -    LG      LG OPEN RECV WORK FILE
     A*           ELNH    -    LH      EDI FOR LNT 210 HEADER
     A*           ELNK    -    LK      EDI FOR LNT 997
     A*           ELNR    -    LR      EDI FOR LNT 210 DETAIL
     A*           EFNK    -    L9      EDI/CASS FEDERATED 997
     A*           EMD1    -    MD      EDI B/L DETAIL FOR MICHAELS
     A*           MDLA    -    MDL     MEDLINE ACCESSORIAL PROS
     A*           EMH1    -    MH      EDI B/L HEADER FOR MICHAELS
     A*           MGHS    -    MG      MERCURY GATE RECONCILIATION HISTORY
     A*           EMH9    -    M9      EDI FOR MICHEALS     997
     A*           EFOM    -    N       EDI FOR FEDERATED 214 FOR KYSO
     A*           BLPO    -    O       B/L PURCHASE ORDER FILE
     A*           EKH2    -    O       EDI B/L REF. NUMBERS FILE
     A*           E82O    -    OP      CASH 820 OVERPAYMENT DETAILS
     A*           PDWK    -    PD      NRC/NRT A/R PASS DUE WORKFILE
     A*           PMET    -    PM      ENTITY GROUP CODE
     A*           BLPR    -    PR      MONTHLY PRO REGISTER WORK FILE
     A*           CHEK    -    Q       CHECK
     A*           CQHT    -    QH      SALESMAN QUARTERLY COMMISSION HISTORY
     A*           CQWK    -    QW      SALESMAN QUARTERLY COMMISSION WORKFILE
     A*           RLDX    -    R       ROLLODEX CUSTOMER FILE
     A*           EDID    -    RD      EDI REQUIREMENTS DETAIL
     A*           EDIH    -    RH      EDI REQUIREMENTS HEADER
     A*           ROSF    -    RS      ROSS STORES CASH REMITTANCE WORKFILE.
     A*           BLSI    -    S       B/L SPECIAL INSTRUCTIONS
     A*           TRAC    -    T       TRACK OF ACTIONS DONE TO A/R
PR   A*           TADT    -    TD      TARGET DETENTION CHARGES (EDI)
     A*           TJXI    -    TI      TJX FLEET INVOICING TABLE
PR   A*           TWRK    -    TW      TARGET WORKFILE FOR A/R STMT
     A*           FLTX    -    TX      FLEET TRAILER FIX
     A*           TPID    -    TP      TRADING PARTNER ID MASTER
     A*           COSC    -    UN      COLLECTIONS SCRATCH PAD NEW
     A*           COSD    -    UD      COLLECTIONS SCRATCH PAD NEW DETL
     A*           COSP    -    U       COLLECTIONS SCRATCH PAD
     A*           EFOR    -    U       EDI FOR FEDERATED 214 FOR KYSO
     A*           UPDN    -    UD      UPSIDE DOWN PROS REPORT DISTRO
     A*           RCPY    -    V       REVERSE CASH PAYMENT FILE
     A*           EFOP    -    V       EDI FOR FEDERATED 214 FOR KYSO
     A*           VHWK    -    VK      VOUCHER FOR RESOLVING OVERPAYMENTS
     A*           EKT1    -    W       EDI KMART TOTALS FILE
     A*           ARBW    -    W       WEEKLY FLEET/NON-FLEET DETAILS
     A*           ARBX    -    X       WEEKLY A/R SUPER REPORT SETUP
     A*           ILHS    -    XX      SUBMISSION OF I/L VOUCHERS LOG
     A*           ILXD    -    XD      DETAIL ADDITION TO ILXF
     A*           ARBY    -    Y       WEEKLY A/R SUPER REPORT SETUP
     A*           ARBZ    -    Z       WEEKLY MAIN A/R NUMBERS
     A*           TRID    -    Z
     A*           E82A    -            EDI FOR 820 HEADER DOCS
     A*           E82B    -            EDI FOR 820 HEADER DOCS
     A*           E82C    -            EDI FOR 820 HEADER DOCS
     A*           E82D    -            EDI FOR 820 HEADER DOCS
     A*           E82H    -    8H      EDI FOR 820 HEADER DOCS
     A**********************************************************************
     A          R FLDREFFM
     A*
     A**********************************************************************
     A*           ARBA      -                MONTHLY A/R BALANCES FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000200 00003
     A*         R ARBAFM
     A*
     A            ACRECE         1          COLHDG('ACTIVE' 'CODE')
     A            COCODE         3          COLHDG('COMP' 'CODE')
     A            MONTHE         2S 0       COLHDG('MONTH')
     A            YEAR#E         4S 0       COLHDG('YEAR')
     A*
     A* OPEN ATB BALANCES AND SALES TOTALS
     A            ATBBAE        11  2       COLHDG('A-T-B BALANCE')
     A            ATBBFE        11  2       COLHDG('A-T-B BALANCE')
     A            UNDBAE        11  2       COLHDG('UNDERPYMNT' 'BAL')
     A            UNDBFE        11  2       COLHDG('UNDERPYMNT' 'BAL')
     A            OVRBAE        11  2       COLHDG('OVERPAYMENT' 'BAL')
     A            OVRBFE        11  2       COLHDG('OVERPAYMENT' 'BAL')
     A            SALESE        11  2       COLHDG('SALES AMOUNT')
     A            SALEFE        11  2       COLHDG('SALES AMOUNT')
     A            ADJCME        11  2       COLHDG('ADJUSTMENTS C/M')
     A            ADJCFE        11  2       COLHDG('ADJUSTMENTS C/M')
     A            ADJPME        11  2       COLHDG('ADJUSTMENTS P/M')
     A            ADJPFE        11  2       COLHDG('ADJUSTMENTS P/M')
     A            RCPCME        11  2       COLHDG('REOPENED C/M')
     A            RCPCFE        11  2       COLHDG('REOPENED C/M')
     A            RCPPME        11  2       COLHDG('REOPENED P/M')
     A            RCPPFE        11  2       COLHDG('REOPENED P/M')
     A*
     A* CASH RECEIPTS BREAKDOWN
     A            CASHCE        11  2       COLHDG('CLEARED' 'CASH')
     A            CASHFE        11  2       COLHDG('CLEARED' 'CASH')
     A            DEFCAE        11  2       COLHDG('DEFERRED' 'CASH')
     A            DEFCFE        11  2       COLHDG('DEFERRED' 'CASH')
     A            ICRECE        11  2       COLHDG('INTER-CO' 'DEB')
     A            ICREFE        11  2       COLHDG('INTER-CO' 'DEB')
     A            ICCRTE        11  2       COLHDG('INTER-CO' 'CR')
     A            ICCRFE        11  2       COLHDG('INTER-CO' 'CR')
     A            DEPSTE        11  2       COLHDG('DEPOSITS')
     A            DEPSFE        11  2       COLHDG('DEPOSITS')
     A            WRITEE        11  2       COLHDG('WRITE-OFFS')
     A            WRITFE        11  2       COLHDG('WRITE-OFFS')
     A            MISCEE        11  2       COLHDG('MISC. G/L')
     A            MISCFE        11  2       COLHDG('MISC. G/L')
     A*
     A* DEFERRED RECEIPTS BREAKDOWN (PRIOR MONTHS CASH RESOLVED)
     A            CLRPME        11  2       COLHDG('CLEARED' 'P/M CASH')
     A            CLRPFE        11  2       COLHDG('CLEARED' 'P/M CASH')
     A            RECONE        11  2       COLHDG('DEFERRED' 'RECON.')
     A            RECOFE        11  2       COLHDG('DEFERRED' 'RECON.')
     A            WRTPME        11  2       COLHDG('WRITE-OFFS' 'P/M')
     A            WRTPFE        11  2       COLHDG('WRITE-OFFS' 'P/M')
     A            MISPME        11  2       COLHDG('MISC. G/L' 'P/M')
     A            MISPFE        11  2       COLHDG('MISC. G/L' 'P/M')
     A            RDEFEE        11  2       COLHDG('RE-DEFERRED' 'P/M')
     A            RDEFFE        11  2       COLHDG('RE-DEFERRED' 'P/M')
     A**********************************************************************
     A*           ARBD      -                DAILY A/R BALANCES FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000200 00003
     A*         R ARBDFM
     A*
     A            ACTCDD         1          COLHDG('ACTIVE' 'CODE')
     A            COCODD         3          COLHDG('COMP' 'CODE')
     A            YEAR#D         4S 0       COLHDG('YEAR')
     A            MONTHD         2S 0       COLHDG('MONTH')
     A            DAY##D         2S 0       COLHDG('DAY')
     A*
     A* OPEN ATB BALANCES AND SALES TOTALS
     A            ATBBAD        11  2       COLHDG('A-T-B BALANCE')
     A            ATBBFD        11  2       COLHDG('A-T-B BALANCE')
     A            UNDBAD        11  2       COLHDG('UNDERPYMNT' 'BAL')
     A            UNDBFD        11  2       COLHDG('UNDERPYMNT' 'BAL')
     A            OVRBAD        11  2       COLHDG('OVERPAYMENT' 'BAL')
     A            OVRBFD        11  2       COLHDG('OVERPAYMENT' 'BAL')
     A            SALESD        11  2       COLHDG('SALES AMOUNT')
     A            SALEFD        11  2       COLHDG('SALES AMOUNT')
     A            ADJCMD        11  2       COLHDG('ADJUSTMENTS C/M')
     A            ADJCFD        11  2       COLHDG('ADJUSTMENTS C/M')
     A            ADJPMD        11  2       COLHDG('ADJUSTMENTS P/M')
     A            ADJPFD        11  2       COLHDG('ADJUSTMENTS P/M')
     A            RCPCMD        11  2       COLHDG('REOPENED C/M')
     A            RCPCFD        11  2       COLHDG('REOPENED C/M')
     A            RCPPMD        11  2       COLHDG('REOPENED P/M')
     A            RCPPFD        11  2       COLHDG('REOPENED P/M')
     A*
     A* CASH RECEIPTS BREAKDOWN
     A            CASHCD        11  2       COLHDG('CLEARED' 'CASH')
     A            CASHFD        11  2       COLHDG('CLEARED' 'CASH')
     A            DEFCAD        11  2       COLHDG('DEFERRED' 'CASH')
     A            DEFCFD        11  2       COLHDG('DEFERRED' 'CASH')
     A            ICRECD        11  2       COLHDG('INTER-CO' 'DEB')
     A            ICREFD        11  2       COLHDG('INTER-CO' 'DEB')
     A            ICCRTD        11  2       COLHDG('INTER-CO' 'CR')
     A            ICCRFD        11  2       COLHDG('INTER-CO' 'CR')
     A            DEPSTD        11  2       COLHDG('DEPOSITS')
     A            DEPSFD        11  2       COLHDG('DEPOSITS')
     A            WRITED        11  2       COLHDG('WRITE-OFFS')
     A            WRITFD        11  2       COLHDG('WRITE-OFFS')
     A            MISCED        11  2       COLHDG('MISC. G/L')
     A            MISCFD        11  2       COLHDG('MISC. G/L')
     A*
     A* DEFERRED RECEIPTS BREAKDOWN (PRIOR MONTHS CASH RESOLVED)
     A            CLRPMD        11  2       COLHDG('CLEARED' 'P/M CASH')
     A            CLRPFD        11  2       COLHDG('CLEARED' 'P/M CASH')
     A            RECOND        11  2       COLHDG('DEFERRED' 'RECON.')
     A            RECOFD        11  2       COLHDG('DEFERRED' 'RECON.')
     A            WRTPMD        11  2       COLHDG('WRITE-OFFS' 'P/M')
     A            WRTPFD        11  2       COLHDG('WRITE-OFFS' 'P/M')
     A            MISPMD        11  2       COLHDG('MISC. G/L' 'P/M')
     A            MISPFD        11  2       COLHDG('MISC. G/L' 'P/M')
     A            RDEFED        11  2       COLHDG('RE-DEFERRED' 'P/M')
     A            RDEFFD        11  2       COLHDG('RE-DEFERRED' 'P/M')
     A**********************************************************************
     A*           ARBW      -                WEEKLY FLEET/NON-FLEET DETAILS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000200 00003
     A*         R ARBWFM
     A*
     A            ACTCDW         1          COLHDG('ACTIVE' 'CODE')
     A            COCODW         3          COLHDG('COMP' 'CODE')
     A            YEAR#W         4S 0       COLHDG('YEAR')
     A            MONTHW         2S 0       COLHDG('MONTH')
     A            DAY##W         2S 0       COLHDG('DAY')
     A*
     A            FLEETW         1          COLHDG('FLEET' 'FLAG')
     A*                                       F=FLEET
     A*                                       BLANK=NON-FLEET
     A            GRUPCW         2          COLHDG('GROUP' 'CODE')
     A            SUBGPW         4          COLHDG('SUB' 'GROUP')
     A            ACCT#W         5  0       COLHDG('ACCOUNT #')
     A            NAMEAW        25          COLHDG('CUSTOMER' 'NAME')
     A            TOTCYW        10  2       COLHDG('YTD' 'SALES')
     A            ARBTOW        10  2       COLHDG('TOTAL' 'BALANCE')
     A            ARB00W        10  2       COLHDG('CUR. YEAR' 'BALANC''SALES')
     A            ARB30W         9  2       COLHDG('OVER/30' 'BALANCE')
     A            ARB45W         9  2       COLHDG('OVER/45' 'BALANCE')
     A            ARB60W         9  2       COLHDG('OVER/60' 'BALANCE')
     A            ARB90W         9  2       COLHDG('OVER/90' 'BALANCE')
     A**********************************************************************
     A*           ARBX      -                WEEKLY A/R SUPER REPORT SETUP
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000200 00003
     A*         R ARBXFM
     A*
     A            ACTCDX         1          COLHDG('ACTIVE' 'CODE')
     A            COCODX         3          COLHDG('COMP' 'CODE')
     A            FLEETX         1          COLHDG('FLEET' 'FLAG')
     A*                                       F=FLEET
     A*                                       BLANK=NON-FLEET
     A            GRUPCX         2          COLHDG('GROUP' 'CODE')
     A            NAMEAX        25          COLHDG('GROUP' 'NAME')
     A            LEVELX         1          COLHDG('REPORT' 'LEVEL')
     A*                                       1=BY GROUP
     A*                                       2=BY GROUP/SUB-GROUP
     A*                                       3=BY GROUP/ACCOUNT#
     A            AUDACX         1          COLHDG('AUDIT' 'ACTION')
     A*                                       A=ADDED
     A*                                       U=UPDATED
     A*                                       D=INACTIVATED
     A*                                       R=REACTIVATED
     A            AUDUSX        10          COLHDG('AUDIT' 'USER')
     A            AUDDTX          L         COLHDG('AUDIT' 'DATE')
     A                                      DFT('0001-01-01')
     A            AUDTMX         4  0       COLHDG('AUDIT' 'TIME')
     A**********************************************************************
     A*           ARBY      -                WEEKLY A/R SUPER REPORT SETUP
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000200 00003
     A*         R ARBYFM
     A*
     A            ACTCDY         1          COLHDG('ACTIVE' 'CODE')
     A            COCODY         3          COLHDG('COMP' 'CODE')
     A            GRUPCY         2          COLHDG('GROUP' 'CODE')
     A            SGRUPY         4          COLHDG('SUN-GROUP' 'CODE')
     A            ACCT#Y         5  0       COLHDG('ACCOUNT')
     A            NAMEAY        25          COLHDG('GROUP' 'NAME')
     A            AUDACY         1          COLHDG('AUDIT' 'ACTION')
     A*                                       A=ADDED
     A*                                       U=UPDATED
     A*                                       D=INACTIVATED
     A*                                       R=REACTIVATED
     A            AUDUSY        10          COLHDG('AUDIT' 'USER')
     A            AUDDTY          L         COLHDG('AUDIT' 'DATE')
     A                                      DFT('0001-01-01')
     A            AUDTMY         4  0       COLHDG('AUDIT' 'TIME')
     A**********************************************************************
     A*           ARBZ      -                WEEKLY MAIN A/R NUMBERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000200 00003
     A*         R ARBZFM
     A*
     A            ACTCDZ         1          COLHDG('ACTIVE' 'CODE')
     A            WKENDZ          L         COLHDG('A/R WEEK' 'CLOSING DATE')
     A                                      DFT('0001-01-01')
     A            SALESZ         9  0       COLHDG('WEEKLY' 'SALES POSTED')
     A            ARTOTZ         9  0       COLHDG('WEEKLY' 'A/R TOTAL')
     A            CASH$Z         9  0       COLHDG('WEEKLY' 'CASH RECEIPTS')
     A            CTURNZ        13  2       COLHDG('WEEKLY' 'CASH TURN')
     A            AGINGZ         4  1       COLHDG('PAST DUE' 'AGING %')
     A*
     A**********************************************************************
     A*           BASF      -                BASS PRO SHOP CASH REMITTANCE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 001000 00010
     A*         R BASFFM
     A*
     A            MAILBXB8      10          COLHDG('FAUX MAILBOX ID')
     A            CACODEB8       4          COLHDG('CARRIER' 'CODE')
     A            CNTRL#B8      15          COLHDG('CONTROL #')
     A            BOL###B8      20          COLHDG('BOL #')
     A            PROALPB8      15          COLHDG('PRO#' 'ALPHA')
     A            PRO###B8       7  0       COLHDG('PRO#')
     A            AMOUNTB8       9  2       COLHDG('PAID' 'AMOUNT')
     A            CURRNCB8       5          COLHDG('CURRANCY')
     A*
     A**********************************************************************
     A*           BLDT      -                B/L DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   7000000 030000 00010
     A*         R BLDTFM
     A*
     A            ACRECD         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##D         7  0       COLHDG('PRO #')
     A            LINE#D         2  0       COLHDG('PRO' 'LINE#')
     A            PTYPED         1          COLHDG('PRO' 'TYPE')
     A*                                       1 = COMMODITY LINE
     A*                                       2 = CONTINUATION LINE
     A*                                           OR MESSAGE LINE
     A* COMMODITY
CHG  A            QTYL1D         6  0       COLHDG('QTY' '1 LINE')
     A            DESCRD        25          COLHDG('DESCRIPTION')
     A            SDESCD         4          COLHDG('STANDARD' 'DESCR')
     A* RATES
CHG  A            WGTSHD         5  0       COLHDG('WEIGHT' 'SHIP')
CHG  A            WGTACD         5  0       COLHDG('WEIGHT' 'ACTUAL')
CHG  A            RATESD         6  3       COLHDG('RATE')
     A            RBASED         1          COLHDG('RATE' 'BASE')
     A*                                        C = CARTONS (USE WGT)
     A*                                        G = GARMENTS (USE QTY)
     A*                                        M = MISC.
     A            TOTALD         9  2       COLHDG('EXTENDED' 'AMT')
     A* RATE CODE
     A            RATECD         1          COLHDG('RATE' 'CODE')
     A*                                      D = DISTANCE/MILEAGE
     A*                                      F = FLAT RATE
     A*                                      W = WEIGHT
     A*                                      Q = QUANTITY
     A*                                      M = MINIMUM CHARGE
     A* GOODS CLASS
NEW  A            CLASCD         4          COLHDG('GOODS' 'CLASS')
     A**********************************************************************
     A*           BLHD      -                B/L HEADER
     A**********************************************************************
     * IF BELOW RECORD FORMAT LAYOUT IS CHANGED, THEN FILE BLHD01MF MUST BE
     * MANUALLY RECOMPILED INTO BLPGM.           MIKE LESIN©
     A*                                     SIZE   INCR.  TIMES
     A*&                                   6000000 030000 00010
     A*         R BLHDFM
     A*
     A            ACRECH         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##H         7  0       COLHDG('PRO #')
NEW  A            PRODTH          L         COLHDG('PRO DATE')
NEW  A                                      DFT('0001-01-01')
     A            ILCARH         4          COLHDG('INTERLINE CARR')
     A            ACCT#H         5  0       COLHDG('ACCOUNT #')
     A* SHIPPER
     A            SHIPNH        25          COLHDG('SHIPPER NAME')
     A            SHAD1H        25          COLHDG('SHIPPER ADD1')
     A            SHAD2H        25          COLHDG('SHIPPER ADD2')
     A            SHSTAH         2          COLHDG('SHIPPER STATE')
CHG  A            SHCODH         6          COLHDG('SHP LOC' 'CODE')
     A* CONSIGNEE
     A            CONS#H         5  0       COLHDG('CONSIGNEE #')
     A            CONSNH        25          COLHDG('CONSIGNEE NAME')
     A            COAD1H        25          COLHDG('CONSIGNEE ADD1')
     A            COAD2H        25          COLHDG('CONSIGNEE ADD2')
     A            CONSTH         2          COLHDG('CONSIGNEE STATE')
CHG  A            COCODH         6          COLHDG('CON LOC' 'CODE')
     A* TERMINALS
CHG  A            ORIGNH         4          COLHDG('ORIGIN')
CHG  A            DESTNH         4          COLHDG('DESTINATION')
     A*  MOVEMENT
     A            MOVE1H         7  0       COLHDG('MANIFEST#')
NEW  A            SCAC1H         4          COLHDG('P/U' 'SCAC')
CHG  A            TRAL1H         7          COLHDG('P/U' 'TRAILER#')
NEW  A            SCAC2H         4          COLHDG('DELIVERY' 'SCAC')
CHG  A            TRAL2H         7          COLHDG('DELIVERY' 'TRAILER#')
     A*  INVOICING/TOTALS:
     A            INVNOH         7  0       COLHDG('INVOICE #')
     A            TOTALH         9  2       COLHDG('TOTAL AMOUNT')
CHG  A            TOQTYH         6  0       COLHDG('TOTAL QTY')
CHG  A            TOWGTH         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            PAYCOH         1          COLHDG('PREPAID/COLLECT')
     A*                                        P = PREPAID
     A*                                        C = COLLECT
     A*  STATUS FLAGS:
     A            OSDCOH         1          COLHDG('AIR' 'PIER')
     A*                                          = REGULAR
     A*                                        A = AIRPORT SHIPMENT
     A*                                        P = PEIR SHIPMENT
     A            STAT1H         1          COLHDG('STATUS' 'FLAG1')
     A*                                          = ENTERED
     A*                                        R = DAILY REGISTER PRT
     A*                                        M = MONTHLY REGISTER PRT
     A            STAT2H         1          COLHDG('SPARE' 'FLAG2')
     A*                                        I = INVOICED
     A*                                        A = PASSED TO A/R
     A*                                        C = DRIVER COLLECT
     A*                                        V = VOIDED PRO
     A*                                        F = NON-REVENUE PRO
     A*                                        P = P.O.D. WAIT
     A            SIEXTH         1          COLHDG('SPEC INS' 'EXIST')
     A*                                        Y = SPECIAL INSTR EXIST
     A            POEXTH         1          COLHDG('PO''S' 'EXIST')
     A*                                        Y = PO'S EXIST
     A            EDISTH         2          COLHDG('EDI' 'STATUS')
     A*                                        AF = AF TRANSACTION SENT
     A*                                        AD = AD TRANSACTION SENT
     A*                                        J2 = JOANN STORES 210 SENT
     A*                                        J9 = JOANN STORES 997 RECVD
     A*                                        L2 = LNT STORES 210 SENT
     A*                                        L9 = LNT STORES 997 RECVD
     A*                                        T2 = 210 SENT TO TARGET
     A*                                             FOR SHAFTER &
     A*                                             CHAMBERSBURG PROS
     A*                                        T9 = 997 RECEIVED FROM  D
     A*                                             TARGET FOR SHAFTER &
     A*                                             CHAMBERSBURG PROS
     A*                                        M2 =210 SENT TO MICHAELS
     A*                                            PROS
     A*                                        M9 = 997 RECEIVED FROM  D
     A*                                             MICHEALS FOR PROS  &
     A*                                        X2 =210 SENT TO TJMAX
     A*                                            FOR TJMAX PROS
GP   A*                                        B2 =210 SENT TO BELK
GP   A*                                            PROS
GP   A*                                        TH = 210 FOR HANDLING (CONS.)
GP   A*                                              EDID FIRST TIME
GP   A*                                        TO = 210 FOR HANDLING (CONS.)
GP   A*                                              EDID FOR BAL DUE
     A            CONPUH         1          COLHDG('CONS' 'P/U')
     A*                                        Y = CONSOLIDATION P/U
     A*  LOAD TYPE:
     A            REVTYH         1          COLHDG('REVENUE' 'TYPE')
     A*                                          = N/A
     A*                                        H = HOUSE DRIVER
     A*                                        O = OWNER OPERATOR
     A*                                        A = AFFILIATED COMP (WMX
     A*                                        S = SUBHAULER
     A*
     A*  A/R
     A            AMTPDH         9  2       COLHDG('AMOUNT PAID')
     A            PAIDFH         1          COLHDG('PAID' 'FLAG')
     A*                                          = NEW PRO NOT PAID
     A*                                        P = PRO IS FULLY PAID
     A*                                        D = DEFERRED
     A*                                        R = REOPENED (D CHANGED)
NEW  A            INVDTH          L         COLHDG('INVOICE' 'DATE')
NEW  A                                      DFT('0001-01-01')
     A*
     A            AMTOPH         9  2       COLHDG('AMOUNT A/R OPEN')
     A*                                        USED AS DEFERRED AMT
     A*
     A* PERSONEL
     A            BILLIH         2          COLHDG('BILLING INITIALS')
     A            RATEIH         2          COLHDG('RATE CLERKS ID')
     A            OPERAH         2          COLHDG('OPERATORS INITIALS')
     A*
     A* DATE PRO HIT SYSTEM
NEW  A            ENTDTH          L         COLHDG('ENTERED' 'DATE')
NEW  A                                      DFT('0001-01-01')
     A*
     A* DELIVERY DATE
NEW  A            DELDTH          L         COLHDG('DELIVERY' 'DATE')
NEW  A                                      DFT('0001-01-01')
     A*
NEW  A            VOLUMH         5  3       COLHDG('VOLUME' 'IN CBM')
NEW  A            MILESH         5  0       COLHDG('MILEAGE')
NEW  A            TRDSTH         6          COLHDG('TARIFF/DIST')
NEW  A            TRDSTCH        1          COLHDG('TARIFF/DIST' 'CODE')
NEW  A            ORDERH         7  0       COLHDG('ORDER#')
     A*
     A* COST CENTERS
     A            ORICCH         4          COLHDG('ORIGIN' 'COSTCENTER')
     A            DSTCCH         4          COLHDG('DEST' 'COSTCENTER')
     A* PRO TYPE
     A            PROTPH         1          COLHDG('PRO' 'TYPE')
     A*                                        T = TRANSPORTATION
     A* SUB TYPE                               N = NON-TRANSPORTATION
     A            PROSTH         3          COLHDG('PRO' 'SUB-TYPE')
     A*                                        LTL, TL, CNT (CONTAINER),
     A*                                        DDL (DOCK DELIVERY),
     A*                                        DST (DISTRIBUTION),
     A* HOURS RUN                              OTHERS TBD...
GC   A            HOURSH         5  2       COLHDG('HOURS' 'RUN')
     A**********************************************************************
     A*           BLIL      -                B/L HEADER INTERLINE INFO
     A**********************************************************************
     * *** NOT USED / RENAMED TO BLILX / NEEDED TO BE KEPT ***
     A**********************************************************************
     * IF BELOW RECORD FORMAT LAYOUT IS CHANGED, THEN FILES BLIL01MF & BLIL02MF
     * MUST BE MANUALLY RECOMPILED INTO BLPGM.           MIKE LESIN©
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 025000 00010
     A*         R BLILFM
     A*
     A*SEE ILXF   ACRECF         1          COLHDG('ACTIVE' 'CODE')
     A*SEE ILXF   PRO##F         7  0       COLHDG('PRO #')
     A*
     A*  INTERLINE CARRIER INFORMATION
     A*SEE ILXF   ILCODF         4          COLHDG('I/L' 'CARRIER')
     A*SEE ILXF   ILPROF        10          COLHDG('I/L PRO#')
     A*SEE ILXF   ILAMTF         7  2       COLHDG('I/L AMT')
     A*                                        I/L'S PORTION
     A            ILNRTF         7  2       COLHDG('I/L NRT')
     A*                                        NRT'S PORTION
     A            ILTOTF         7  2       COLHDG('I/L TOT')
     A* NOTE: ILAMT + ILNRT = ILTOT            I/L TOTAL AMT
     A*SEE ILXF   ILOPNF         7  2       COLHDG('I/L OPEN')
     A            ILFRMF         1          COLHDG('FROM OR TO')
     A*                                        F=FROM T=TO
     A**********************************************************************
     A*           BLPO      -                B/L PURCHASE ORDER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   3000000 030000 00010
     A*         R BLPOFM
     A*
     A            ACRECO         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##O         7  0       COLHDG('PRO #')
     A            SEQNOO         3  0       COLHDG('SEQ' 'NUMBER')
     A            PONUMO        17          COLHDG('PO NUMBER')
     A            QUALFO         1          COLHDG('QUALIFIER')
     A*                                        ' ' = PO (DEFAULT)
     A*                                        'A' = APPOINTMENT#
     A*                                        'L' = LOAD NUMBER
     A*                                        'R' = RELEASE
     A*                                        'D' = DEPT
     A*                                        'T' = TRANSFER #
     A*                                        'B' = B/L #
     A            DEPT#O         4          COLHDG('DEPT#')
     A            QUANTO         5  0       COLHDG('QUANTITY')
     A**********************************************************************
     A*           BLSI      -                B/L SPECIAL INSTRUCTIONS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 030000 00010
     A*         R BLSIFM
     A*
     A            ACRECS         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##S         7  0       COLHDG('PRO #')
     A            SEQNOS         1  0       COLHDG('SEQ' 'NUMBER')
     A            INSTRS        70          COLHDG('INSTRUCTIONS')
     A**********************************************************************
     A*           BLST      -                BILLING STOP OFF FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 025000 00005
     A*         R BLSTFM
     A*
     A            ACREC5         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##5         7  0       COLHDG('PRO #')
     A            SEQNO5         3  0       COLHDG('SEQNO')
     A* LOCATION
     A            LOCNA5        25          COLHDG('LOCATION NAME')
     A            CITY55        17          COLHDG('CITY')
     A            STATE5         2          COLHDG('STATE')
     A            ZIPCD5         5  0       COLHDG('ZIP')
     A* STOP CODE
     A            REASN5         1          COLHDG('REASON' 'CODE')
     A*                                        P = PICKUP
     A*                                        D = DELIVERY
     A**********************************************************************
     A*           CASH      -                A/R CASH FILE
     A**********************************************************************
     * M U S T   B E   F R C R A T I O ( * Y E S )
     A*                                     SIZE   INCR.  TIMES
     A*&                                   2500000 020000 00010
     A*         R CASHFM
     A*
     A            ACRECK         1          COLHDG('ACTIVE' 'CODE')
     A            ACCT#K         5  0       COLHDG('ACCOUNT #')
     A            PRONOK         7  0       COLHDG('PRO #')
     A*
     A* CONTROLS
     A            OPERIK         2          COLHDG('OPERATOR' 'ID')
     A            DEPCCK         1S 0       COLHDG('DEPOSIT' 'CENT')
     A            DEPYYK         2S 0       COLHDG('DEPOSIT' 'YEAR')
     A            DEPMMK         2S 0       COLHDG('DEPOSIT' 'MONTH')
     A            DEPDDK         2S 0       COLHDG('DEPOSIT' 'DAY')
     A            TRANSK         7  0       COLHDG('TRANSACTION#')
     A            BATCHK         7  0       COLHDG('BATCH#')
     A*
     A* PAYMENT DATA:
     A            REFNOK        10          COLHDG('REFERENCE#')
     A            CHECKK         6  0       COLHDG('CHECK#')
     A            AMOUNK         9  2       COLHDG('AMT' 'APPLIED')
     A            GLACTK         6  0       COLHDG('GL ACCOUNT#')
     A            TTYPEK         1          COLHDG('TRANSACTION' 'TYPE')
     A*                                        A = ADJUSTMENT + OR -
     A*                                        C = APPLIED CASH
     A*                                        O = OVERPAYMENT (DEFERRED)
     A*                                        M = MISC. CASH          D)
     A            REASNK         1          COLHDG('REASON' 'CODE')
     A*                                        D = DEDUCTION
     A*                                        E = BILLING ERROR
     A*                                        W = WRITE OFF
     A            DAILYK         1          COLHDG('DAILY JOURNAL' 'PRINTED')
     A*                                        P = DAILY JOURNAL PRINTED
     A            ARFLGK         1          COLHDG('PART OF A/R')
     A*                                          = PART OF A/R
     A*                                        N = NOT PART OF A/R
     A            NRT12K         1          COLHDG('AR1/AR2')
     A*                                        F = FACTOR RELATED TRANS
     A            RESLVK         1          COLHDG('RESOLVED' 'FROM' 'DEFERED')
     A*                                        R = RESOLVED
     A            KEYREK         9  0       COLHDG('RECORD' 'KEY')
     A*
     A            RCDATK         7  0       COLHDG('REVERSE' 'CASH' 'DATE')
     A* ABOVE ADDED 7/2/06
     A**********************************************************************
     A*           CHEK      -                CHEQUE FILE(FOR PHIL)
     A**********************************************************************
     * M U S T   B E   F R C R A T I O ( * Y E S )
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 00003
     A*         R CHEKFM
     A*
     A            ACRECQ         1          COLHDG('ACTIVE' 'CODE')
     A            ACCT#Q         5  0       COLHDG('ACCOUNT #')
     A            CHECKQ         6  0       COLHDG('CHECK#')
     A            REFNOQ        10          COLHDG('REFERENCE#')
     A            CHKCCQ         1S 0       COLHDG('CHECK' 'CENT')
     A            CHKYYQ         2S 0       COLHDG('CHECK' 'YEAR')
     A            CHKMMQ         2S 0       COLHDG('CHECK' 'MONTH')
     A            CHKDDQ         2S 0       COLHDG('CHECK' 'DAY')
     A            BANK#Q         6  0       COLHDG('BANK' 'ACCT#')
     A            AMOUNQ         9  2       COLHDG('CHECK' 'AMOUNT')
     A            TRANSQ         7  0       COLHDG('TRANSACTION#')
     A            DAILYQ         1          COLHDG('DAILY JOUNRAL')
     A*                                        P = DAILY JOUNRAL PRINTE
     A            FACTRQ         1          COLHDG('FACTOR' 'CODE')
     A*                                        F = FACTOR RELATED TRANS
     A*
     A**********************************************************************
     A*           CMWK      -               CREDIT MEMO WORK FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000500 00010
     A*         R CMWKFM
     A*
     A            TYPECM         2          COLHDG('TRANSACTION' 'TYPE')
     A            CMO#CM         7  0       COLHDG('CREDIT' 'MEMO#')
     A            ACCTCM         5  0       COLHDG('ACCOUNT#')
     A            CHEKCM         6  0       COLHDG('CHECK#')
     A            DEPDCM          L         COLHDG('DEPOSIT' 'DATE')
     A                                      DFT('0001-01-01')
     A            REF#CM        10          COLHDG('REFERENCE#')
     A            BATCCM         7  0       COLHDG('BATCH#')
     A            OVRPCM         9  2       COLHDG('OVERPAID AMOUNT')
     A            REASCM        34          COLHDG('REASON')
     A            RRN#CM         9  0       COLHDG('KEYREC')
     A            COCOCM         3          COLHDG('COMP' 'CODE')
     A            DATECM          L         COLHDG('RESOLVE' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIMECM          T         COLHDG('RESOLVE' 'TIME')
     A                                      DFT('00.00.00')
     A            USERCM        10          COLHDG('USER')
     A            PROCCM         1          COLHDG('PROCESS' 'FLAG')
     A            TXT1CM        70          COLHDG('TEXT LINE #1')
     A            TXT2CM        70          COLHDG('TEXT LINE #2')
     A            TXT3CM        70          COLHDG('TEXT LINE #3')
     A            RNAMCM        25          COLHDG('REMIT TO' 'NAME')
     A            RADDCM        25          COLHDG('REMIT TO' 'ADDRESS')
     A            RCSZCM        25          COLHDG('REMIT TO' 'CITY ST ZIP')
     A            RATTCM        25          COLHDG('REMIT TO' 'ATTN')
     A*
     A**********************************************************************
     A*           COSC      -               COLLECTION SCRATCH PAD NEW
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000500 00010
     A*         R COSCFM
     A*
     A            ACRECUN        1          COLHDG('ACTIVE' 'CODE')
     A            ACTNOUN        5  0       COLHDG('ACCOUNT #')
     A            SCRM1UN       60          COLHDG('COLL. MGR. NOTES')
     A            COMDYUN        7S 0       COLHDG('DATE ENT/UPD')
     A            CRESTUN        1          COLHDG('CREDIT STATUS')
     A*                                      ' '= ACCEPTABLE
     A*                                       Y = STOP CREDIT
     A*                                       P = PROBLEM ACCOUNT
     A*                                       $ = CASH ONLY
     A**********************************************************************
     A*           COSD      -               COLLECT SCRATCH PAD NEW DET
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 002500 00010
     A*         R COSDFM
     A*
     A            ACRECUD        1          COLHDG('ACTIVE' 'CODE')
     A            ACTNOUD        5  0       COLHDG('ACCOUNT #')
     A            SEQ##UD        3  0       COLHDG('SEQUENCE#')
     A            STEXTUD       75          COLHDG('SCRATCH 1')
     A**********************************************************************
     A*           COSP      -                COLLECTION SCRATCH PAD
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R COSPFM
     A*
     A            ACTNOU         5  0       COLHDG('ACCOUNT #')
     A            SCRM1U        25          COLHDG('COLL. MGR. NOTES')
     A            SCRT1U        75          COLHDG('SCRATCH 1')
     A            SCRT2U        75          COLHDG('SCRATCH 2')
     A            SCRT3U        75          COLHDG('SCRATCH 3')
     A            COMDYU         6S 0       COLHDG('DATE ENT/UPD')
     A            CRESTU         1          COLHDG('CREDIT STATUS')
     A*                                      ' '= ACCEPTABLE
     A*                                       Y = STOP CREDIT
     A*                                       P = PROBLEM ACCOUNT
     A*                                       $ = CASH ONLY
     A**********************************************************************
     A*           CUBA      -                CUSTOMER BALANCES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00005
     A*         R CUBAFM
     A*
     A            ACREC2         1          COLHDG('ACTIVE' 'CODE')
     A            ACCT#2         5  0       COLHDG('ACCOUNT #')
     A* A/R AGING - BALANCES
     A            ARB002         9  2       COLHDG('CURRENT' 'BALANCE')
     A            ARB302         9  2       COLHDG('OVER/30' 'BALANCE')
     A            ARB452         9  2       COLHDG('OVER/45' 'BALANCE')
     A            ARB602         9  2       COLHDG('OVER/60' 'BALANCE')
     A            ARB902         9  2       COLHDG('OVER/90' 'BALANCE')
     A            ARBTO2         9  2       COLHDG('TOTAL' 'BALANCE')
     A*
     A* CURRENT/LAST YEAR SALES (ARRAY 12 BY 9.2P )
     A            CYSLS2        60          COLHDG('CURRENT' 'YEAR' 'SALES')
     A            TOTCY2        10  2       COLHDG('CUR. YEAR' 'TOTAL' 'SALES')
     A            LYSLS2        60          COLHDG('LAST' 'YEAR' 'SALES')
     A            TOTLY2        10  2       COLHDG('LAST YEAR' 'TOTAL' 'SALES')
     A**********************************************************************
     A*           CUMB      -                CUSTOMER MONTHLY BALANCES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 00005
     A*         R CUMBFM
     A*
     A            ACREC22        1          COLHDG('ACTIVE' 'CODE')
     A            ACCT#22        5  0       COLHDG('ACCOUNT #')
     A            COMPC22        3          COLHDG('COMP' 'CODE')
     A            MONTH22        2S 0       COLHDG('MONTH')
     A            YEAR222        4S 0       COLHDG('YEAR')
     A            GROUP22        2          COLHDG('GROUP' 'CODE')
     A            SUBGR22        4          COLHDG('SUB' 'GROUP')
     A* A/R AGING - BALANCES
     A            ARB0022        9  2       COLHDG('CURRENT' 'BALANCE')
     A            ARB3022        9  2       COLHDG('OVER/30' 'BALANCE')
     A            ARB4522        9  2       COLHDG('OVER/45' 'BALANCE')
     A            ARB6022        9  2       COLHDG('OVER/60' 'BALANCE')
     A            ARB9022        9  2       COLHDG('OVER/90' 'BALANCE')
     A            ARBTO22        9  2       COLHDG('TOTAL' 'BALANCE')
     A            INTER22        1          COLHDG('INTERCOMPANY')
     A*                                             ==INTERCOMPANY
     A**********************************************************************
     A*           CUMT      -                12 MONTH A/R BALANCES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000001 000001 00005
     A*         R CUMTFM
     A*
     A            P###123       11  2       COLHDG('PERIOD' 'ONE')
     A            P###223       11  2       COLHDG('PERIOD' 'TWO')
     A            P###323       11  2       COLHDG('PERIOD' 'THREE')
     A            P###423       11  2       COLHDG('PERIOD' 'FOUR')
     A            P###523       11  2       COLHDG('PERIOD' 'FIVE')
     A            P###623       11  2       COLHDG('PERIOD' 'SIX')
     A            P###723       11  2       COLHDG('PERIOD' 'SEVEN')
     A            P###823       11  2       COLHDG('PERIOD' 'EIGHT')
     A            P###923       11  2       COLHDG('PERIOD' 'NINE')
     A            P##1023       11  2       COLHDG('PERIOD' 'TEN')
     A            P##1123       11  2       COLHDG('PERIOD' 'ELEVEN')
     A            P##1223       11  2       COLHDG('PERIOD' 'TWELVE')
     A**********************************************************************
     A*           CUST      -                CUSTOMER MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CUSTFM
     A*
     A            ACRECA         1          COLHDG('UPDATE' 'CODE')
     A*                                        U = UPDATED RECORD
     A*                                        COPY TO ONLINE SYSTEM
     A            ACCT#A         5  0       COLHDG('ACCOUNT #')
     A            NAMEAA        25          COLHDG('NAME')
     A            ADDR1A        25          COLHDG('ADDRESS 1')
     A            ADDR2A        25          COLHDG('ADDRESS 2')
     A            ADDR3A        25          COLHDG('ADDRESS 3')
     A            STATEA         2          COLHDG('STATE')
     A            ZIPCDA         5          COLHDG('ZIP' 'CODE')
     A* CONTACT
     A            CNAMEA        22          COLHDG('CONTACT' 'NAME')
     A            CPHN1A         3  0       COLHDG('CONTACT' 'PHONE#' 'AREA CD')
     A            CPHN2A         3  0       COLHDG('CONTACT' 'PHONE#' 'PREFIX')
     A            CPHN3A         4  0       COLHDG('CONTACT' 'PHONE#' 'SUFFIX')
     A            FAXPHA        10          COLHDG('FAX NUMBER')
     A* BALANCES
     A            YTDSLA         9  2       COLHDG('Y-T-D' 'SALES')
     A            MTDSLA         9  2       COLHDG('M-T-D' 'SALES')
     A            ARBALA         9  2       COLHDG('A/R' 'BALANCE')
     A* A/R AGING
     A            ARB00A         9  2       COLHDG('CURRENT' 'BALANCE')
     A            ARB30A         9  2       COLHDG('OVER/30' 'BALANCE')
     A            ARB45A         9  2       COLHDG('OVER/45' 'BALANCE')
     A            ARB60A         9  2       COLHDG('OVER/60' 'BALANCE')
     A            ARB90A         9  2       COLHDG('OVER/90' 'BALANCE')
     A            ATBSEA         1          COLHDG('SELECTED' 'FOR AGE' 'TRIAL')
     A* COLLECTIONS CODES
     A            DUNNGA         1          COLHDG('PREVENT' 'DELETE')
     A*                                        Y = DO NOT DELETE CUST
     A            REPINA         1          COLHDG('INTERNAL' 'COLLECTION REP')
     A            GEOGRA         1          COLHDG('GEOGRAPHICAL AREA')
     A            STREPA         1  0       COLHDG('STATE REPRESENATIVE')
     A            REPEXA         2  0       COLHDG('PAYMENT' 'TERMS')
     A            ORIGNA         2          COLHDG('GROUP' 'CODE')
     A            GROUPA         4          COLHDG('SUB' 'GROUP')
     A* SALESMAN FIELDS
     A            SLSM#A         2  0       COLHDG('SALESMAN' 'NUMBER')
     A            SLSTPA         1  0       COLHDG('SALESMAN' 'TYPE')
     A            SLSRGA         1  0       COLHDG('SALESMAN' 'REGION')
     A            SLSMSA         1          COLHDG('SALESMAN' 'MISC.')
     A*                                     TO BE USED AT LATER DATE
     A* TERMS OF COLLECTION
     A            CRBALA         9  2       COLHDG('CREDIT' 'LIMIT')
     A            CRSTSA         1          COLHDG('STOP' 'CREDIT' 'FLAG')
     A*                                        Y = STOP CREDIT
     A*                                        $ = NO CHECKS - CASH ONLY
     A*                                        P = PROBLEM ACCOUNT
     A            COLTRA         1          COLHDG('COLLECTION' 'TERMS')
     A*                                          = NORMAL STATUS
     A*                                        C = COLLECTION AGENCY
     A*                                        L = LEGAL LETTER
     A*                                        P = PROBLEM ACCOUNT
     A*                                        I = INTERCOMPANY
     A*                                        M = CORP.
     A*                                        B = BANKRUPTCY
     A*                                        W = WRITE OFF
     A*                                        X,Y,Z=OTHER
     A            COLCCA         1S 0       COLHDG('STATUS' 'CENT')
     A            COLYYA         2S 0       COLHDG('STATUS' 'YEAR')
     A            COLMMA         2S 0       COLHDG('STATUS' 'MONTH')
     A            COLDDA         2S 0       COLHDG('STATUS' 'DAY')
     A*
     A* MISC. ACCOUNT STATUS INFORMATION
     A            INTERA         1          COLHDG('INTER-COMPANY' 'ACCOUNT')
     A*                                        I = INTER-COMPANY ACCOUNT
     A*                                        F = FLEET ACCOUNT
     A            DONOTA         1          COLHDG('DO NOT USE' 'CODE')
     A*                                        N = DO NOT USE
     A            PODRQA         1          COLHDG('POD' 'CODE')
     A*                                        B = B/L REQUIRED
     A*                                        P = POD REQUIRED
     A*                                        S = SPECIAL
     A            PODETA         1          COLHDG('PO' 'CODE')
     A            EDICDA         1          COLHDG('EDI' 'CODE')
     A*                                        S = SPECIAL
     A* ADDED 11/02 FOR LAWSON INTERFACE - INTERCOMPANY ACCOUNTS ONLY
     A* INTERCOMPANY G/L AND COMPANY GROUP CODE (IE. KEY,NRT)
     A            INTGLA         6  0       COLHDG('G/L' 'CODE')
     A            INTCOA         3          COLHDG('COMP' 'CODE')
     A* FUEL SURCHARGE CUST PROFILE CODE (3/2005)
     A            FSCRPA         4          COLHDG('REG.FUEL' 'PROFILE')
     A            FSCCPA         4          COLHDG('CONT.FUEL' 'PROFILE')
     A* CUST CODE FOR STORE ASSOCIATION
NC36 A            CCODEA         2          COLHDG('CUST' 'CODE')
     A* FLAG TO USE / NOT USE CLASS MULTIPLIER
     A            MLTFLA         1          COLHDG('MULT' 'FLAG')
     A*                                        N = NO CLASS MULTIPLIER
     A* MILER CALCULATOR TOOL ID
     A            MILERA         1          COLHDG('MILER' 'TOOL ID')
     A            FPRODA          L         COLHDG('FIRST PRO' 'DATE')
     A                                      DFT('0001-01-01')
     A            PCMVRA         2          COLHDG('PCM' 'VERSION')
     A            PCMOPA         1          COLHDG('PCM' 'OPTION')
     A**********************************************************************
     A*           DESC      -                COMMODITY DESC. FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R DESCFM
     A*
     A            ACRECC         1          COLHDG('ACTIVE' 'CODE')
      *                                     Use for: Flagged for Commission.
      *                                     Y=Yes or Blank
     A            DESCRC        20          COLHDG('DESCRIPTION')
     A            DCODEC         4          COLHDG('DESCR. CODE')
     A            CHCODC         1          COLHDG('CARTON/' 'HANGING' 'CODE')
     A            GLCODC         6  0       COLHDG('GL CODE')
     A            EDISDC         3          COLHDG('EDI 210' 'STANDARD')
     A*
     A**********************************************************************
     A*           DSWF      -                DSW  CASH REMITTANCE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 001000 00010
     A*         R DSWFFM
     A*
     A            MAILBXDS      10          COLHDG('FAUX MAILBOX ID')
     A            CANAMEDS      20          COLHDG('CARRIER' 'NAME')
     A            ACCT##DS       7  0       COLHDG('ACCOUNT' 'NUMBER')
     A            PRO###DS       7  0       COLHDG('PRO' 'NUMBER')
     A            SHIP##DS       7  0       COLHDG('SHIPMENT' 'NUMBER')
     A            INDATEDS        L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            SHDATEDS        L         COLHDG('SHIPMENT' 'DATE')
     A                                      DFT('0001-01-01')
     A            BILAMTDS       9  2       COLHDG('BILLED' 'AMOUNT')
     A            SAVAMTDS       9  2       COLHDG('SAVINGS' 'AMOUNT')
     A            PAID$$DS       9  2       COLHDG('PAID' 'AMOUNT')
     A            CLAIM$DS       9  2       COLHDG('CLAIM' 'AMOUNT')
     A*
     A**********************************************************************
     A*           DGEN      -                DOLLAR GEN CASH REMITTANCE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 001000 00010
     A*         R DGENFM
     A*
     A            MAILBXDG      10          COLHDG('FAUX MAILBOX ID')
     A            VEND##DG      10  0       COLHDG('VENDOR' 'NUMBER')
     A            REMITODG      10          COLHDG('REMIT TO')
     A            CHECH#DG      10  0       COLHDG('CHECK NUMBER')
     A            PO####DG      10          COLHDG('PO NUMBER')
     A            INV###DG      10          COLHDG('INVOICE NUMBER')
     A            INDATEDG        L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            CHDATEDG        L         COLHDG('CHECK' 'DATE')
     A                                      DFT('0001-01-01')
     A            GROSSADG       9  2       COLHDG('GROSS' 'AMOUNT')
     A            DISCNTDG       9  2       COLHDG('DISCOUNT')
     A            NETAMTDG       9  2       COLHDG('NET' 'AMOUNT')
     A            COMMNTDG      25          COLHDG('COMMENTS')
     A*
     A**********************************************************************
     A*           DSGC      -                DSG CASH REMITTANCE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 001000 00010
     A*         R DSGCFM
     A*
     A            MAILBXDC      10          COLHDG('FAUX MAILBOX ID')
     A            INVID#DC      30          COLHDG('INVOICE ID')
     A            VOUCHRDC      10          COLHDG('VOUCHER ID')
     A            INDATEDC        L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            TAXAMTDC       9  2       COLHDG('SALES' 'TAX')
     A            SHPAMTDC       9  2       COLHDG('SHIPPING')
     A            INVAMTDC       9  2       COLHDG('INVOICE' 'TOTAL')
     A            DSCAMTDC       9  2       COLHDG('DISCOUNT')
     A            PAYAMTDC       9  2       COLHDG('PAYMENT' 'AMOUNT')
     A            PAYMSGDC      50          COLHDG('PAYMENT' 'MESSAGE')
     A            PAYNOTDC      12          COLHDG('PAYMENT' 'NOTE')
     A            PAYREFDC      12          COLHDG('PAYMENT ID' 'REFERENCE')
     A            CHDATEDC        L         COLHDG('CHECK' 'DATE')
     A                                      DFT('0001-01-01')
     A*
     A****************************************************************
     A* 820 DOC   E82A      EDI DETAIL RMR REMITTANCE ADVISE A/R OPEN
     A****************************************************************
     A*                                     REF(FLDREFEDI FLDEDIFM)
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 005000 01000

     A*         R E82AFM

     A            MAILRA34      10          COLHDG('MAILBOX ID#')
     A            ENT01RA34      6          COLHDG('SEQ #')

     A            RMR01RA34      3          COLHDG('REF # QU')
     A            RMR02RA34     30          COLHDG('REF #')
     A            RMR03RA34      2          COLHDG('PAY ACR CDE')
     A            RMR04RA34     18  2       COLHDG('$ AMOUNT')
     A            RMR05RA34     18  2       COLHDG('TOT INV/CRD $')
     A            RMR06RA34     18  2       COLHDG('DIS TAKEN $')
     A            RMR07RA34      2          COLHDG('Adj reason cde')
     A            RMR08RA34     18  2       COLHDG('DIS TAKEN $')

     A            NM103RA12     35          COLHDG('NAME')
     A            NM104RA12     25          COLHDG('NAME FIRST')
     A            NM101RA12      3          COLHDG('ENT ID CDE')
     A            PAYCOE82A     10          COLHDG('Pay co code')
     A            BILTYE82A      1          COLHDG('Bill' 'Type')
      *                                     R= receipt
      *                                     P= pro#
      *                                     A= Adjustment
     A            STAT_E82A      1          COLHDG('Status')
      *                                     I= invoice not valid
      *                                     P= cash partly applied
      *                                     A= cash applied
     A****************************************************************
     A* 820 DOC   E82b      EDI DETAIL REF
     A****************************************************************
     A****************************************************************
     A*                                     REF(FLDREFEDI FLDEDIFM)
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 005000 01000

     A*         R E82BFM

     A            MAILRA36      10          COLHDG('MAILBOX ID#')

     A            RMR02RA36     30          COLHDG('REF #')

     A            REF01RA36      3          COLHDG('Ref # Qu   ')
     A            REF02E82B     80          COLHDG('Ref #      ')
     A            REF03E82B      8          COLHDG('Pay Acr Cde')
     A

     A****************************************************************
     A* 820 DOC   E82C      EDI DETAIL ADX
     A****************************************************************
     A*                                     REF(FLDREFEDI FLDEDIFM)

     A*         R E82CFM
     A            MAILRA48      10          COLHDG('MAILBOX ID#')

     A            RMR02RA48     30          COLHDG('REF #')
     A

     A            ADX01E82C     18  2       COLHDG('Adj $ Amt   ')
     A            ADX02RA48      2          COLHDG('Adj Reas    ')
     A            ADX03RA48      3          COLHDG('Adj Ref # Qu')
     A            ADX04RA48     30          COLHDG('Adj Ref #   ')

     A            STAT_E82C      1          COLHDG('PAY STATUS')
      *                                     I= invoice not valid
      *                                     P= ADJUSTMENT PARTLY APPLIED
      *                                     A= ADJUSTMENT RESOLVED

     A****************************************************************
     A* 820 DOC   E82D      EDI DETAIL ADX
     A****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R E82DFM
     A*
     A            MAILRA49      10          COLHDG('Mailbox Id#')
     A            RMR02RA49     30          COLHDG('Ref #      ')
     A            NTE01RA49      3          COLHDG('Adj Ref Cde')
     A            NTE02RA49     80          COLHDG('Adj Message')

     A**********************************************************************
     A*           E82H      -                820 HEADER FILE (EDI)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R E82HFM
     A*
     A            ACREC8H        1          COLHDG('ACTIVE' 'CODE')
     A            CONT#8H        9          COLHDG('CONTROL #')
     A            MAIL#8H       10          COLHDG('MAILBOX ID')
     A            AMOUN8H        9  2       COLHDG('TOTAL' 'AMT')
     A            REFNO8H       17          COLHDG('REF/CHK #')
     A            TRNDT8H        8  0       COLHDG('TRANS' 'DATE')
     A            INVTY8H        1          COLHDG('INV' 'TYPE')
     A*                                        P = PROS
     A*                                        R = RECEIPT
     A*
     A            BATCH8H        7  0       COLHDG('BATCH #')
     A            ERROR8H        1          COLHDG('ERRORS')
     A*                                       ' '= UNEDITED
     A*                                        Y = ERRORS
     A*                                        N = NO ERRORS
     A            STATU8H        1          COLHDG('STATUS')
     A*                                       ' '= UNAPPLIED
     A*                                        A = APPLIED
     A            PAYCO8H       15          COLHDG('PAYING' 'COMPANY')
     A            TARCO8H       15          COLHDG('TARGET' 'COMPANY')
     A            CREDT8H        9  2       COLHDG('CREDIT' 'AMT')
     A**********************************************************************
     A*           E82O      -                CASH 820 OVERPAY DETAILS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   3000000 030000 00010
     A*         R E82OFM
     A*
     A            ACRECOP        1          COLHDG('ACTIVE' 'CODE')
     A            MAIL#OP       10          COLHDG('MAILBOX ID')
     A            TRNDTOP        8  0       COLHDG('TRANS' 'DATE')
     A            PAYCOOP       15          COLHDG('PAYING' 'COMPANY')
     A            TARCOOP       15          COLHDG('TARGET' 'COMPANY')
     A            REFNOOP       17          COLHDG('REF/CHK #')
     A            BATCHOP        7  0       COLHDG('BATCH #')
     A            PROCTOP        1          COLHDG('PROCESS' 'TYPE')
     A*                                        P = PROS
     A*                                        R = RECEIPT
     A*                                        C = CONS
     A*
     A            REF##OP       30          COLHDG('REF #')
     A            PRO##OP        7  0       COLHDG('PRO #')
     A            OVPAMOP        9  2       COLHDG('OVP$' 'AMT')
     A**********************************************************************
     A*           E82X      -                CASH 820 CONS CHGS.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   3000000 030000 00010
     A*         R E82XFM
     A*
     A            ACRECCX        1          COLHDG('ACTIVE' 'CODE')
     A            MAIL#CX       10          COLHDG('MAILBOX ID')
     A            TRNDTCX        8  0       COLHDG('TRANS' 'DATE')
     A            PAYCOCX       15          COLHDG('PAYING' 'COMPANY')
     A            TARCOCX       15          COLHDG('TARGET' 'COMPANY')
     A            REFNOCX       17          COLHDG('REF/CHK #')
     A            BATCHCX        7  0       COLHDG('BATCH #')
     A            ACCT#CX        5  0       COLHDG('CUSTOMER #')
     A            WREC#CX        7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            REF##CX       30          COLHDG('REF #')
     A            PRO##CX        7  0       COLHDG('PRO #')
     A            CONC$CX        9  2       COLHDG('CON CHG')
     A            CONP$CX        9  2       COLHDG('CON PAID')
     A            OPN$$CX        9  2       COLHDG('OPEN AMT')
     A            HDTYPCX        3  0       COLHDG('HEADING' 'TYPE')
     A            APRN$CX        7  2       COLHDG('APRON' 'CHG')
     A            BREAKCX        1          COLHDG('NEEDS' 'BREAKDOWN')
     A*****************************************************************
     A*           GLCA      -                CHART OF ACCOUNTS FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000250 000025 00003
     A*         R GLCAFM
     A*
     A            ACRECB         1          COLHDG('ACTIVE' 'CODE')
     A            GLACTB         6  0       COLHDG('G/L' 'ACCOUNT#')
     A            DESCSB        20          COLHDG('DESCRIPTION')
     A*
     A* SPECIAL CODES
     A            BNKCDB         1          COLHDG('BANK' 'CODE')
     A*                                        B = DEPOSIT ACCOUNT
     A            FACTRB         1          COLHDG('FACT' 'CODE')
     A*                                        F = DEPOSIT TO FACTOR
     A            CREDIB         1          COLHDG('CREDIT' 'CODE')
     A*                                       CODES SAME AS DEBITB
     A            DEBITB         1          COLHDG('DEBIT' 'CODE')
     A*                                          = MISC G/L
     A*                                        B = BANK DEPOSIT
     A*                                        C = A/R CLEARED
     A*                                        D = DEFERRED
     A*                                        I = INTER CO DEBIT
     A*                                        M = MISC G/L
     A*                                        R = RECONCILED DEFERED
     A*                                        W = WRITE OFF
     A*                                        X = INTER-CO CREDIT
     A*****************************************************************
     A*           GRUP      -                ACCOUNT GROUP MASTER FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000250 000025 00003
     A*         R GRUPFM
     A*
     A            ACREC1         1          COLHDG('ACTIVE' 'CODE')
     A*                                        Y = SHOW ON YTD REPORT
     A            CORPG1         2          COLHDG('CORP' 'GROUP')
     A            GROUP1         4          COLHDG('SUB' 'GROUP')
     A            DESCR1        25          COLHDG('DESCRIPTION')
     A**********************************************************************
     A*           ICAC      -                INTERCOMPANY ACCT# X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R ICACFM
     A*
     A            BILLIC         3          COLHDG('BILLING' 'CO.')
     A            PAYCIC         3          COLHDG('PAYING' 'CO.')
     A            ACC#IC        12  0       COLHDG('ACCOUNT#')
     A*
     A**********************************************************************
     A*           ICAS      -                INTER CO CASH APPL SUMM
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R ICASFM
     A*
     A            BANKIS         6  0       COLHDG('BANK' 'ACCT#')
     A            BAT#IS         7  0       COLHDG('BATCH #')
     A            TRN#IS         7  0       COLHDG('TRANSACTION #')
     A            BILLIS         3          COLHDG('BILLING' 'CO.')
     A            PAYCIS         3          COLHDG('PAYING' ' CO.')
     A            TDATIS          L         COLHDG('TRANSACTION' 'DATE')
     A                                      DFT('0001-01-01')
     A            AMT$IS        10  2       COLHDG('AMOUNT')
     A*
     A**********************************************************************
     A*           ICTR      -                A/R INTERCOMPANY TRANSFERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 005000 00003
     A*         R ICTRFM
     A*
     A            ACRECG         1          COLHDG('ACTIVE' 'CODE')
     A*                                        B = HAS BEEN BATCHED
     A*
     A* FROM/TO COMPANIES
     A            FCOMPG         4          COLHDG('FROM' 'COMPANY')
     A            FCGL#G         6  0       COLHDG('FROM' 'CO G/L#')
     A            TCOMPG         4          COLHDG('TO' 'COMPANY')
     A            TCGL#G         6  0       COLHDG('TO' 'CO G/L#')
     A*
     A* CONTROLS
     A            OPERIG         2          COLHDG('OPERATOR' 'ID')
     A            DEPCCG         1S 0       COLHDG('DEPOSIT' 'CENT')
     A            DEPYYG         2S 0       COLHDG('DEPOSIT' 'YEAR')
     A            DEPMMG         2S 0       COLHDG('DEPOSIT' 'MONTH')
     A            DEPDDG         2S 0       COLHDG('DEPOSIT' 'DAY')
     A            TRANSG         7  0       COLHDG('TRANSACTION#')
     A            BATCHG         7  0       COLHDG('BATCH#')
     A*
     A* CHECK INFO:
     A            REFNOG        10          COLHDG('REFERENCE#')
     A            CHECKG         6  0       COLHDG('CHECK#')
     A            CHKCCG         1S 0       COLHDG('CHECK' 'CENT')
     A            CHKYYG         2S 0       COLHDG('CHECK' 'YEAR')
     A            CHKMMG         2S 0       COLHDG('CHECK' 'MONTH')
     A            CHKDDG         2S 0       COLHDG('CHECK' 'DAY')
     A            AMOUNG         9  2       COLHDG('AMOUNT')
     A            ACCT#G         5  0       COLHDG('ORIG.' 'ACCT')
     A            NAMEAG        25          COLHDG('ACCT' 'NAME')
     A            FACTRG         1          COLHDG('FACTOR' 'CODE')
     A*
     A* REPORT CONTROL
     A            STAT1G         1          COLHDG('REPORT' 'STATUS')
     A*                                        R = HAS BEEN REPORTED
     A            TRNCCG         1S 0       COLHDG('TRANS.' 'CENT')
     A            TRNYYG         2S 0       COLHDG('TRANS.' 'YEAR')
     A            TRNMMG         2S 0       COLHDG('TRANS.' 'MONTH')
     A            TRNDDG         2S 0       COLHDG('TRANS.' 'DAY')
     A*
     A**********************************************************************
     A*           IKEA      -                IKEA CASH REMITTANCE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 001000 00010
     A*         R IKEAFM
     A*
     A            MAILBXIK      10          COLHDG('FAUX MAILBOX ID')
     A            SHIPIDIK      20          COLHDG('SHIPMENT ID')
     A            COSTTYIK      10          COLHDG('COST TYPE')
     A            AMOUNTIK       9  2       COLHDG('AMOUNT')
     A            CONTIDIK      11          COLHDG('CONTAINER')
     A            LUTYPEIK       5          COLHDG('CONTAINER TYPE')
     A            BILLOLIK      16          COLHDG('BILL OF LADING')
     A            STDATEIK        L         COLHDG('START DATE')
     A                                      DFT('0001-01-01')
     A            SHPRTEIK      16          COLHDG('ORIG SHIP ROUTE')
     A            SHPUSAIK      10          COLHDG('ORIG COUNTRY')
     A            SHPCTYIK      20          COLHDG('ORIG CITY')
     A            DSTRTEIK      16          COLHDG('DEST SHIP ROUTE')
     A            DSTUSAIK      10          COLHDG('DEST COUNTRY')
     A            DSTCTYIK      20          COLHDG('DEST CITY')
     A            CORFLDIK      10          COLHDG('COR')
     A            CEEFLDIK      10          COLHDG('CEE')
     A            STATUSIK       1          COLHDG('STATUS')
     A*
     A**********************************************************************
     A*           ILAP      -                INTERLINE PAYMENTS FILE
     A**********************************************************************
     * *** NOT USED / RENAMED TO ILAPX / NEEDED TO BE KEPT ***
     A**********************************************************************
     * IF BELOW RECORD FORMAT LAYOUT IS CHANGED, THEN FILE ILAP01MF MUST BE
     * MANUALLY RECOMPILED INTO BLPGM.           MIKE LESIN©
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R ILAPFM
     A*
     A*SEE ILPH   ACRECJ         1          COLHDG('ACTIVE' 'CODE')
     A*SEE ILPH   PRO##J         7  0       COLHDG('PRO #')
     A*SEE ILPH   ILCODJ         4          COLHDG('I/L' 'CODE')
     A*
     A* PAYMENT DATA:
     A            TRNCCJ         1S 0       COLHDG('TRANS' 'CENT')
     A            TRNYYJ         2S 0       COLHDG('TRANS' 'YEAR')
     A            TRNMMJ         2S 0       COLHDG('TRANS' 'MONTH')
     A            TRNDDJ         2S 0       COLHDG('TRANS' 'DAY')
     A*SEE ILPH   AMOUNJ         7  2       COLHDG('AMOUNT')
     A*SEE ILPH   VOUCHJ         7  0       COLHDG('VOUCHER')
     A**********************************************************************
     A*           ILCA      -                INTERLINE CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R ILCAFM
     A*
     A            ACRECI         1          COLHDG('ACTIVE' 'CODE')
     A*                                     'X' = WE DO NOT USE I/L PAYABLE FOR
     A*                                           THAT CARRIER, HOWEVER IT IS
     A*                                           ABSOLUTELY LEGITIMATE ONE...
     A            ILCODI         4          COLHDG('I/L' 'CODE')
     A            NAMEAI        25          COLHDG('NAME')
     A            ACCT#I         5  0       COLHDG('BILL TO' 'ACCT')
     A            ADDRSI        25          COLHDG('STREET ADDRESS')
     A            CITYII        16          COLHDG('CITY')
     A            STATEI         2          COLHDG('STATE')
     A            ZIPCDI         5          COLHDG('ZIP' 'CODE')
     A            LAWIDI         9  0       COLHDG('LAWSON' 'ID')
     A            LAWLOI         4          COLHDG('LAWSON' 'LOCT')
     A*
     A*************************************************************************
     A*           ILCL      -                INTERLINE CARRIER LIABITY WORKFILE
     A*************************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00005
     A*         R ILCLFM
     A*
     A            COCODIZ        3          COLHDG('COMP' 'CODE')
     A            FRDATIZ         L         COLHDG('FROM' 'DATE')
     A                                      DFT('0001-01-01')
     A            TODATIZ         L         COLHDG('TO' 'DATE')
     A                                      DFT('0001-01-01')
     A            TERM#IZ        4          COLHDG('TERMINAL')
     A            IPAIDIZ        9  2       COLHDG('I/L PAID')
     A            ILNONIZ        9  2       COLHDG('I/L NON-PAID')
     A            ILESTIZ        9  2       COLHDG('I/L EST')
     A            COAMTIZ        9  2       COLHDG('CO AMT')
     A            TOTALIZ        9  2       COLHDG('TOTAL')
     A            PERCTIZ        5  2       COLHDG('PCT')
     A            PDATEIZ         L         COLHDG('PROCESS' 'DATE')
     A                                      DFT('0001-01-01')
     A            PFLAGIZ        1          COLHDG('PROCESS' 'FLAG')
     A            WORKFIZ       10          COLHDG('WORK' 'FIELD')
     A*
     A**********************************************************************
     A*           ILWK      -                INTERLINE REPORT WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R ILWKFM
     A*
     A            ILCODIW        4          COLHDG('I/L' 'CODE')
CHG  A            ORIGNIW        4          COLHDG('ORIGIN')
     A            CURAMIW        9  2       COLHDG('CUR AMOUNT')
     A            YTDAMIW        9  2       COLHDG('YTD AMOUNT')
     A*
     A*************************************************************************
     A*           IORV      -                INBOUND OUTBOUND REV WORKFILE
     A*************************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00005
     A*         R IORVFM
     A*
     A            COCODIO        3          COLHDG('COMP' 'CODE')
     A            FRDATIO         L         COLHDG('FROM' 'DATE')
     A                                      DFT('0001-01-01')
     A            TODATIO         L         COLHDG('TO' 'DATE')
     A                                      DFT('0001-01-01')
     A            TERM#IO        6          COLHDG('TERMINAL')
     A            LOCATIO       25          COLHDG('LOCATION')
     A            SHIP#IO        9  0       COLHDG('# OF SHIPMENTS')
     A            OBREVIO        9  2       COLHDG('OUTBOUND REVENUE')
     A            IBREVIO        9  2       COLHDG('INBOUND REVENUE')
     A            PDATEIO         L         COLHDG('PROCESS' 'DATE')
     A                                      DFT('0001-01-01')
     A            PFLAGIO        1          COLHDG('PROCESS' 'FLAG')
     A            WORKFIO       10          COLHDG('WORK' 'FIELD')
     A*
     A**********************************************************************
     A*           LOCT      -                LOCATION FILE (KMART EDI)
     A* !!!!!!!! OBJECT TAKEN OUT SINCE IT IS A KMART FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00010
     A*         R LOCTFM
     A*
     A            ACRECL         1          COLHDG('ACTIVE' 'CODE')
     A            LOC##L         4          COLHDG('LOC' 'CODE')
     A            LTYPEL         1          COLHDG('LOC' 'TYPE')
     A*                                        = STORE
     A*                                      D = HARDLINE DC
     A*                                      d = DISTRIB DEPOT
     A*                                    e OR c = SOFTLINE DC
     A*                                      F = FIXTURE WAREHOUSE
     A*                                      R = RETURN CENTER
     A*                                      o = CORP. OFFICE
     A            ADDR1L        25          COLHDG('ADDRESS 1')
     A            CITYLL        16          COLHDG('CITY')
     A            STATEL         2          COLHDG('STATE')
     A            ZIPCDL         5          COLHDG('ZIP' 'CODE')
     A*                                                                *****
     A**********************************************************************
     A*           LFPE      -                LF SOURCING PRO EXCEPTION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 000200 00003
     A*         R LFPEFM
     A*
     A            ACCTLF         5  0       COLHDG('ACCOUNT#')
     A            PRO#LF         7  0       COLHDG('PRO#')
     A            EXCPLF         1          COLHDG('EXCEPTION' 'FLAG')
     A*                                        Y = YES DO NOT INVOICE
     A*                                        R = REMOVE INVOICE
     A            EDATLF          L         COLHDG('EXCEPTION' 'DATE')
     A                                      DFT('0001-01-01')
     A            RDATLF          L         COLHDG('REMOVED' 'DATE')
     A                                      DFT('0001-01-01')
     A*                                                                *****
     A**********************************************************************
     A*           LGWK      -                LG OPEN RECV. WRKF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 000200 00003
     A*         R LGWKFM
     A*
     A            COMPLG         3          COLHDG('COMPANY' 'CODE')
     A            INV#LG         7  0       COLHDG('INVOICE #')
     A            PDATLG          L         COLHDG('PRO' 'DATE')
     A                                      DFT('0001-01-01')
     A            BOL#LG        17          COLHDG('BOL#')
     A            PTOTLG         9  2       COLHDG('PRO AMOUNT')
     A            POPNLG         9  2       COLHDG('PRO OPEN$')
     A            PO##LG        17          COLHDG('PO#')
     A            LOD#LG        17          COLHDG('LOAD#')
     A            PRO#LG         7  0       COLHDG('PRO #')
     A            BUC1LG         9  2       COLHDG('OPEN' '0-30 DAYS')
     A            BUC2LG         9  2       COLHDG('OPEN' '31-60 DAYS')
     A            BUC3LG         9  2       COLHDG('OPEN' '61-90 DAYS')
     A            BUC4LG         9  2       COLHDG('OPEN' '91-120 DAYS')
     A            BUC5LG         9  2       COLHDG('OPEN' 'GT 120 DAYS')
     A*                                                                *****
     A**********************************************************************
     A*           PDWK      -                NRC/NRT PASS DUE WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000100 00005
     A*         R PDWKFM
     A*
     A            ACRECPD        1          COLHDG('ACTIVE' 'CODE')
     A            PRO##PD        7  0       COLHDG('PRO#/ RECEIPT#')
     A            PDATEPD        7  0       COLHDG('PRO DATE')
     A            ACCT#PD        5  0       COLHDG('ACCOUNT #')
     A            CONS#PD        5  0       COLHDG('CONSIGNEE #')
     A            INVNOPD        7  0       COLHDG('INVOICE #')
     A            IDATEPD        7  0       COLHDG('INVOICE DATE')
     A            REC##PD        6  0       COLHDG('RECEIPT #')
     A            WREC#PD        7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            RDATEPD        7  0       COLHDG('RECEIPT DATE')
     A            WMANFPD        7  0       COLHDG('WALSH MANIFEST #')
     A            MANF#PD        7  0       COLHDG('CUSTOMER MANIFEST#')
     A            MDATEPD        7  0       COLHDG('MANIFEST DATE')
     A            TOTALPD        9  2       COLHDG('TOTAL PRO/RCP AMOUNT')
     A            AMTPDPD        9  2       COLHDG('AMOUNT PAID')
     A            OPAMTPD        7  2       COLHDG('OUTSTANDING AMT')
     A            ODAYSPD        5  0       COLHDG('DAYS PAST DUE')
     A*
     A**********************************************************************
     A*           PMET      -                ENTITY PAY METHOD
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00005
     A*         R PMETFM
     A*
     A            ACRECPM        1          COLHDG('ACTIVE' 'CODE')
     A            ENAMEPM       35          COLHDG('ENTITY NAME')
     A            GROUPPM        2          COLHDG('GROUP' 'CODE')
     A*
     A**********************************************************************
     A*           RCPY      -                REVERSE CASH PAYMENT FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 002500 00005
     A*         R RCPYFM
     A*
     A            ACRECV         1          COLHDG('ACTIVE' 'CODE')
     A*
     A            PRO##V         7  0       COLHDG('PRO' 'NUMBER')
     A            ACCT#V         5  0       COLHDG('ACCOUNT')
     A            AMOUNV         9  2       COLHDG('AMT' 'UNAPPLIED')
     A*
     A* CASH RECORD INFO
     A            DEPCCV         1S 0       COLHDG('DEPOSIT' 'CENT')
     A            DEPYYV         2S 0       COLHDG('DEPOSIT' 'YEAR')
     A            DEPMMV         2S 0       COLHDG('DEPOSIT' 'MONTH')
     A            DEPDDV         2S 0       COLHDG('DEPOSIT' 'DAY')
     A            CHECKV         6  0       COLHDG('CHECK#')
     A            TRANSV         7  0       COLHDG('TRANSACTION#')
     A            BATCHV         7  0       COLHDG('BATCH#')
     A            FACTRV         1          COLHDG('FACTOR' 'CODE')
     A            MONTHV         1          COLHDG('CURR MONTH' 'FLAG')
     A*                                        P = PREVIOUS MONTH
     A*                                        C = CURRENT MONTH
     A*
     A* REPORT CONTROL
     A            OPERIV         2          COLHDG('OPERATOR' 'ID')
     A            TRNCCV         1S 0       COLHDG('TRANS.' 'CENT')
     A            TRNYYV         2S 0       COLHDG('TRANS.' 'YEAR')
     A            TRNMMV         2S 0       COLHDG('TRANS.' 'MONTH')
     A            TRNDDV         2S 0       COLHDG('TRANS.' 'DAY')
     A            STAT1V         1          COLHDG('REPORT' 'STATUS')
     A*                                        D = DAILY JRN PRINTED
     A*                                        M = MONTHLY JRN PRINTED
     A**********************************************************************
     A*           RLDX      -                ROLLODEX FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0015000 005000 00003
     A*         R RLDXFM
     A*
     A            ACRECR         1          COLHDG('ACTIVE' 'REC CODE')
     A            ACCT#R         5  0       COLHDG('ACCOUNT #')
     A            BILL1R         5  0       COLHDG('BILL TO # 1')
     A            BILL2R         5  0       COLHDG('BILL TO # 2')
     A            BILL3R         5  0       COLHDG('BILL TO # 3')
     A            BILL4R         5  0       COLHDG('BILL TO # 4')
     A            TEXT1R        75          COLHDG('TEXT1')
     A            TEXT2R        75          COLHDG('TEXT2')
     A            TEXT3R        75          COLHDG('TEXT3')
     A            TEXT4R        75          COLHDG('TEXT4')
     A*
     A**********************************************************************
     A*           ROSF      -                ROSS STORES CASH REMITTANCE FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000100 00010
     A*         R ROSFFM
     A*
     A            MAILBRS       10          COLHDG('FAUX MAILBOX ID')
     A            PRO##RS        7  0       COLHDG('PRO#')
     A            NAMNTRS        9  2       COLHDG('NET' 'AMOUNT')
     A            TRANDRS         L         COLHDG('TRANSACTION' 'DATE')
     A                                      DFT('0001-01-01')
     A*
     A**********************************************************************
     A*           SLSC      -                SALESMAN COMMISSION TRANS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00005
     A*         R SLSCFM
     A*
     A            PRO##8         7  0       COLHDG('PRO #')
     A            COMPC8         3          COLHDG('COMPANY' 'CODE')
     A            ORGCC8         4          COLHDG('ORIGIN' 'CC')
     A            DSTCC8         4          COLHDG('DESTINATION' 'CC')
     A            SLSM#8         2  0       COLHDG('SALESMAN' 'NUMBER')
     A            PROYY8         4  0       COLHDG('PRO YEAR')
     A            PROMM8         2  0       COLHDG('PRO MONTH')
     A            COMM$8         6  2       COLHDG('COMM $' 'PAID')
     A            COMMR8         5  4       COLHDG('COMMISSION' 'RATE')
     A            COMMQ8         1          COLHDG('COMMISSION' 'QUAL')
     A            PDATE8          L         COLHDG('DATE' 'PAID')
     A                                      DFT('0001-01-01')
     A            MEDAT8          L         COLHDG('PERIOD END' 'DATE')
     A                                      DFT('0001-01-01')
     A            VOUCH8         7  0       COLHDG('VOUCHER' 'NUMBER')
     A            PRODT8          L         COLHDG('PRO' 'DATE')
     A                                      DFT('0001-01-01')
     A            MILES8         5  0       COLHDG('MILEAGE')
     A            ACCT#8         5  0       COLHDG('ACCOUNT #')
     A            TRLD$8         9  2       COLHDG('TRUCK LOAD $')
     A**********************************************************************
     A*           SLSD      -                SALESMAN ACCOUNT MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000010 00001
     A*         R SLSDFM
     A*
     A            SLSM#7         2  0       COLHDG('SALESMAN #')
     A            ACCT#7         5  0       COLHDG('ACCOUNT#')
     A            SDATE7          L         COLHDG('START EFF' 'DATE')
     A                                      DFT('0001-01-01')
     A            EDATE7          L         COLHDG('END EFF' 'DATE')
     A                                      DFT('0001-01-01')
     A            RQUAL7         1          COLHDG('COMMISSION' 'QUALIFIER')
     A*                                        C=COMMISSION RATE
     A*                                        M=COMMISSION RATE/ MILE
     A            CRATE7         6  4       COLHDG('COMMISSION' 'RATE')
     A            RMILE7         6  4       COLHDG('COMM.RATE' '/MILE')
     A            COMPC7         3          COLHDG('COMP' 'CODE')
     A            CRAT27         6  4       COLHDG('COMMISSION' 'RATE #2')
     A**********************************************************************
     A*           SLSL      -                SALESMAN LANE RATE MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000010 00001
     A*         R SLSLFM
     A*
     A            SLSM#11        2  0       COLHDG('SALESMAN #')
     A            COMPC11        3          COLHDG('COMP' 'CODE')
     A            ACCT#11        5  0       COLHDG('ACCOUNT#')
     A            FRSTA11        2          COLHDG('FROM' 'STATE')
     A            TOSTA11        2          COLHDG('TO' 'STATE')
     A            LANER11        6  4       COLHDG('LANE' 'RATE')
     A**********************************************************************
     A*           SLSM      -                SALESMAN FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000010 00001
     A*         R SLSMFM
     A*
     A            SLSM#6         2  0       COLHDG('SALESMAN #')
     A            SLSNM6        20          COLHDG('SALESMAN' 'NAME')
     A            CRATE6         5  4       COLHDG('COMMISSION' 'RATE')
     A*                                  *** NO LONGER USED - IN SLSD
     A            RMILE6         5  4       COLHDG('COMM.RATE' '/MILE')
     A*                                  *** NO LONGER USED - IN SLSD
     A*
     A**********************************************************************
     A*           SLSW      -                SALESMAN COMMISSION WRKF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000200 00003
     A*         R SLSWFM
     A*
     A            PRO##9         7  0       COLHDG('PRO #')
     A            COMPC9         3          COLHDG('COMPANY' 'CODE')
     A            ORGCC9         4          COLHDG('ORIGIN' 'CC')
     A            DSTCC9         4          COLHDG('DESTINATION' 'CC')
     A            SLSM#9         2  0       COLHDG('SALESMAN' 'NUMBER')
     A            PROYY9         4  0       COLHDG('PRO YEAR')
     A            PROMM9         2  0       COLHDG('PRO MONTH')
     A            COMM$9         6  2       COLHDG('COMM $' 'PAID')
     A            COMMR9         5  4       COLHDG('COMMISSION' 'RATE')
     A            COMMQ9         1          COLHDG('COMMISSION' 'QUAL')
     A            PDATE9          L         COLHDG('DATE' 'PAID')
     A                                      DFT('0001-01-01')
     A            MEDAT9          L         COLHDG('PERIOD END' 'DATE')
     A                                      DFT('0001-01-01')
     A            VOUCH9         7  0       COLHDG('VOUCHER' 'NUMBER')
     A            PRODT9          L         COLHDG('PRO' 'DATE')
     A                                      DFT('0001-01-01')
     A            MILES9         5  0       COLHDG('MILEAGE')
     A            ACCT#9         5  0       COLHDG('ACCOUNT #')
     A            TRLD$9         9  2       COLHDG('TRUCK LOAD $')
     A**********************************************************************
     A*           SUBQ      -                SUB. PAYMENT VERF. FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 025000 00005
     A*         R SUBQFM
     A*
     A* THESE VALUES ARE IMAGES OF BLHD AT TIME OF CREATION
     A            ACREC3         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO##3         7  0       COLHDG('PRO' 'NUMBER')
     A            ACCT#3         5  0       COLHDG('ACCOUNT' 'NUMBER')
     A            TOTAL3         9  2       COLHDG('TOTAL' 'AMOUNT')
     A            AMTPD3         9  2       COLHDG('AMOUNT' 'PAID')
     A            AMTOP3         9  2       COLHDG('AMOUNT' 'OPEN')
     A**********************************************************************
     A*           TRAC      -                TRACK OF ACTIONS IN A/R
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0150000 010000 00005
     A*         R TRACFM
     A*
     A* CONTROLS
     A            OPERIT         2          COLHDG('OPERATOR' 'ID')
     A            CHGCCT         1S 0       COLHDG('CHANGE' 'CENT')
     A            CHGYYT         2S 0       COLHDG('CHANGE' 'YEAR')
     A            CHGMMT         2S 0       COLHDG('CHANGE' 'MONTH')
     A            CHGDDT         2S 0       COLHDG('CHANGE' 'DAY')
     A* ORIGINAL:
     A            OACCTT         5  0       COLHDG('ORIGINAL' 'ACCT#')
     A            OPRO#T         7  0       COLHDG('ORIGINAL' 'PRO#')
     A            OAMT$T         9  2       COLHDG('ORIGINAL' 'AMT')
     A* NEW:
     A            NACCTT         5  0       COLHDG('NEW' 'ACCT#')
     A            NPRO#T         7  0       COLHDG('NEW' 'PRO#')
     A            NAMT$T         9  2       COLHDG('NEW' 'AMT')
     A* REASON CODE:
     A            REACDT         1          COLHDG('REASON' 'CODE')
     A*                                        B = BAD DEBT            D
     A*                                        E = ERROR IN BILLING    D
     A* PRINTOUT CONTROLS:
     A            EFFECT         1          COLHDG('AREA OF EFFECT')
     A*                                          = REGULAR OPEN ITEM
     A*                                        U = UNDERPAYMENT FILE
     A            MONTHT         1          COLHDG('CURR. MONTH FLAG')
     A*                                        P = PREVIOUS MONTH      D
     A*                                        C = CURRENT MONTH       TED
     A            DAILYT         1          COLHDG('DAILY PRINT FLAG')
     A*                                        P = DAILY JOURNAL PRINTED
     A*                                        M = MONTHLY JOURNAL PRINTED
     A**********************************************************************
     A*           TPID      -                TRADING PARTNER ID  FED820
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00005
     A*         R TPIDFM
     A            ACRECTP        1          COLHDG('ACTIVE' 'CODE')
     A            PAYCOTP       15          COLHDG('PAYING' 'COMPANY')
     A**********************************************************************
     A*           TRID      -                TERMINAL I.D.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00005
     A*         R TRIDFM
CHG  A            TERMIZ         4          COLHDG('TERMINAL')
     A            LOCATZ        20          COLHDG('LOCATION NAME')
     A*                                        Y = IPDS PRINTER
     A* THE FOLLOWING FIELDS WERE ADDED TO XREF ACCOUNTINGS COST CENTER
     A            COSTCZ         4          COLHDG('I/B' 'COST' 'CENTER')
     A            COST2Z         4          COLHDG('O/B' 'COST' 'CENTER')
     A* THE FOLLOWING FIELDS WERE ADDED  - 2/05
     A            CITYZZ        16          COLHDG('CITY NAME')
     A            STATEZ         2          COLHDG('STATE')
     A            ZIPCDZ         5  0       COLHDG('ZIP CODE')
NEW  A            OTERMZ         4          COLHDG('OLD TERMINAL#')
     A**********************************************************************
     A*           EFNH    -    FH           EDI HEADER FOR FED 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EFNHFM
     A*
     A            ACRECFH        1          COLHDG('ACTIVE' 'REC CODE')
     A            EDICLFH        8          COLHDG('FED210')
     A            PRO#LFH        8          COLHDG('PRO #')
     A*  FOR CONS PROS (EDI BUILT FROM PGM NRC210 IN CONPGM)
     A*     WE PUT 99 + REC# AS PRO# AND THAT LEN IS 9 NOW
     A*    SEE PR#CONH FLD
     A            APPT#FH        8          COLHDG('FED APPOINTMENT#')
     A*                                            GIVEN BY FEDERATED
GP   A*                                           USE NEW FLD APPTNFH NOW
     A            BLN#1FH       17          COLHDG('BILL OF LADING')
     A            BLN#2FH       17          COLHDG('BILL OF LADING')
     A            PAYCLFH        2          COLHDG('PREPAID/COLLECT')
     A            TRANMFH        2          COLHDG('TRANSPORT METHOD')
     A*                                         'T' - TRUCKLOAD
     A*                                         'LT' - LESS THAN TRUCKLOAD
     A*                                         'C' - CONSOLIDATED
     A*                                         'K' - BACKHAUL
     A            PRODLFH        8  0       COLHDG('PRO' 'DATE')
     A            TOT$LFH        9  2       COLHDG('TOTAL AMOUNT')
     A            DELDLFH        8  0       COLHDG('DELIVERY' 'DATE')
     A*                                         YYYYMMDD
     A            SHPDLFH        8  0       COLHDG('SHIPPED' 'DATE')
     A*                                         YYYYMMDD
     A            SCACLFH        4          COLHDG('SCAC')
     A*                                        NART
     A            SHIPLFH       25          COLHDG('SHIPPER NAME')
     A            SHIDLFH       10          COLHDG('ID' 'CODE')
     A*                                         FED-01
     A            SHADLFH       25          COLHDG('SHIPPER ADD1')
     A            SHCTLFH       16          COLHDG('SHIPPER CITY')
     A            SHSTLFH        2          COLHDG('SHIPPER STATE')
     A            SHZPLFH        5          COLHDG('SHIPPER ZIP')
     A            CONSLFH       25          COLHDG('CONSIGNEE NAME')
     A            COADLFH       25          COLHDG('CONSIGNEE ADD1')
     A            COCTLFH       16          COLHDG('CONSIGNEE CITY')
     A            COSTLFH        2          COLHDG('CONSIGNEE STATE')
     A            COZPLFH        5          COLHDG('CONSIGNEE ZIP')
     A            BILLLFH       25          COLHDG('BILL-TO NAME')
     A            BILALFH       25          COLHDG('BILL-TO ADD1')
     A*           BIA2LFH       25          COLHDG('CONSIGNEE ADD2')
     A            BICTLFH       16          COLHDG('BILL-TO CITY')
     A            BISTLFH        2          COLHDG('BILL-TO STATE')
     A            BIZPLFH        5          COLHDG('BILL-TO ZIP')
     A            TQTYLFH        6  0       COLHDG('TOTAL QTY')
     A            TOWGLFH        6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            DELTRFH        6          COLHDG('DELIVERY' 'TRAIL#')
     A*                                     ONLY FOR T/L
GP   A            APPTNFH       20          COLHDG('FED APPOINTMENT#')
     A*                                            GIVEN BY FEDERATED
GP   A            PR#CONH        9          COLHDG('CONS PRO#')
     A*                                       PRO# IS '99' + REC# OUT OF
     A*                                        CONS SYSTEM FOR CONS PROS
SC   A            SEAL#FH        8          COLHDG('SEAL#    ')
     A**********************************************************************
     A*           EFNB    -    FB           EDI HEADER FOR FED 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EFNBFM
     A*
     A            ACRECFB        1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#LFB        8          COLHDG('PRO #')
     A            QUALIFB        2          COLHDG('QUALIFIER')
     A*                                         'PO' - PO#
     A*                                         'BM' - BOL#            OAD
     A            BLPO1FB       17          COLHDG('BOL#/PO#')
     A            QUANTFB        6  0       COLHDG('QUANTITY')
     A*                                          FOR FUTURE REF
     A*                                          NOT USED NOW
     A**********************************************************************
     A*           EFNC    -    FC           EDI HEADER FOR FED 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EFNCFM
     A*
     A            PRO#LFC        8          COLHDG('PRO #')
     A            CURRFC         3          COLHDG('CURRENCY')
     A**********************************************************************
     A*           EFND    -    F1      EDI DETAIL FOR FED 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0150000 010000 01000
     A*         R EFNDFM
     A*
     A            ACREF1         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#F1         8          COLHDG('PRO #')
     A            SEQNF1         1  0       COLHDG('SEQ' 'NUMBER')
     A*                                      FOR THE S5 SEGMENT
     A*           SEQ2F1         1  0       COLHDG('SEQ' 'NUMBER2')
     A            STREF1         2          COLHDG('STOP REASON' 'CODE')
     A*                                     PL - PARTIAL LOAD
     A*                                     CL - COMPLETE LOAD
     A*                                     PU - PARTIAL UNLOAD
     A*                                     CU - COMPLETE UNLOAD
     A            TOWGF1         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYF1         6  0       COLHDG('TOTAL QTY')
     A            ENAMF1        35          COLHDG('NAME')
     A            ECITF1        30          COLHDG('CITY')
     A            ESTAF1         2          COLHDG('STATE')
     A            EZIPF1         5          COLHDG('ZIP')
     A**********************************************************************
     A*           EFNR    -    LR      EDI (SECOND) DETAIL FOR FED 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R EFNRFM
     A*
     A            ACREFR         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#FR         8          COLHDG('PRO #')
     A            SEQNFR         1  0       COLHDG('SEQ' 'NUMBER')
     A            SEQ2FR         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L0 SEGMENT
     A* DETAILS OF QTY,...
     A            DESCFR        25          COLHDG('LADING' 'DESC')
     A*                                     LNT OUTBOUND CARTONS
     A            TOWGFR         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYFR         6  0       COLHDG('TOTAL QTY')
     A            RATEFR         9  2       COLHDG('RATE')
     A            RATQFR         2          COLHDG('RATE' 'QUALIFIER')
     A*                                      PP = PER PCS
     A*                                      PM = PER MILE
     A*                                      FR = FLAT RATE
     A*                                      LB = PER POUND
     A*                                      MN = MINIMUM CHARGE
     A            TOT$FR         9  2       COLHDG('EXTENDED' 'AMT')
     A            TOQFFR         3          COLHDG('SPECIAL CHARGE' 'QUALIFIER')
     A*                                        FUE = FUEL SURCHARGE
     A*                                        DSC = DISCOUNT
     A            PACKFR         3          COLHDG('PACKAGING CODE')
     A**********************************************************************
     A*           EFNK    -    LK      EDI FOR CASS/FED
     A*                                ACKNOWLEDGEMENT (997)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EFNKFM
     A*
     A            MAILL9        10          COLHDG('997 MAILBOX ID#')
     A            TDGPL9        15          COLHDG('TDG PARTNER' 'ID')
     A            GRPRL9        14          COLHDG('GROUP' 'REF#')
     A            STATL9         1          COLHDG('FED STATUS')
     A*                                       A = ACCEPTED
     A*                                       A = REJECTED
     A*                                       E = PROCESSED WITH ERROR
     A            NUMSL9         6  0       COLHDG('NUMBER' 'SENT')
     A            RECVL9         6  0       COLHDG('NUMBER' 'RECVD')
     A            ACCPL9         6  0       COLHDG('NUMBER' 'ACCEPTED')
     A            PROCL9         1          COLHDG('PROCESSED')
     A*                                       Y = MATCHED WITH 210
     A*                                       X = THESE 997 WERE FOR
     A*                                           THE 214 WE SEND OUT
     A**********************************************************************
     A*           EKH1      -      EDI B/L HEADER FOR KMART
     A*!!!!!!!!!!         MUST BE IN LIBRARY BLPGM
GP   A* !!!!!!!! EKD1, EKD2,EKH1, EKH2, EKT1
GP   A* !!!!!!!! OBJECTS TAKEN OUT SINCE IT IS A KMART FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EKH1FM
     A*** !! MUST BE IN LIBRARY BLPGM !!!
     A            EINT#H        15          COLHDG('EDI INTERCHANGE ID')
     A            EPRO#H         7  0       COLHDG('PRO #')
     A            ESTATH         2          COLHDG('STATUS')
     A**                                           CORRECTION INDICATOR
     A**                                           FOR EDI
     A            EBL##H        17          COLHDG('BILL OF LADING')
     A            EPAYMH         2          COLHDG('PAYMENT METHOD')
     A**                                     CC= COLLECT
     A**                                     PP = PREPAID
     A            EPRDTH         6S 0       COLHDG('PRO DATE')
     A**                                      YYMMDD
     A            EDELDH         6S 0       COLHDG('DELIVERY DATE')
     A**                                      YYMMDD
     A            EDTQFH         3          COLHDG('DATE' 'QUALIFIER')
     A            ESH##H         5  0       COLHDG('SHIPPER#')
     A            ESHPNH        25          COLHDG('SHIPPER NAME')
     A            ESAD1H        25          COLHDG('SHIPPER ADD1')
     A            ESCITH        17          COLHDG('SHIPPER CITY')
     A            ESSTAH         2          COLHDG('SHIPPER STATE')
     A            ESZIPH         5          COLHDG('SHIPPER ZIP')
     A            ESCODH         4          COLHDG('SHP LOC' 'CODE')
     A*
     A            ESTRLH         6          COLHDG('DELIVERY' 'TRAILER#')
     A* CONSIGNEE
     A            ECN##H         5  0       COLHDG('CONSIGNEE #')
     A            ECNSNH        25          COLHDG('CONSIGNEE NAME')
     A            ECAD1H        25          COLHDG('CONSIGNEE ADD1')
     A            ECCITH        17          COLHDG('CONSIGNEE CITY')
     A            ECSTAH         2          COLHDG('CONSIGNEE STATE')
     A            ECZIPH         5          COLHDG('CONS. ZIP')
     A            ECCODH         4          COLHDG('CON LOC' 'CODE')
     A            ETOTLH         9  2       COLHDG('TOTAL AMOUNT')
OUT  A***         ETQTYH         5  0       COLHDG('TOTAL QTY')
OUT  A***         ETWGTH         5  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
GPNEWA            ETQTYH         6  0       COLHDG('TOTAL QTY')
GPNEWA            ETWGTH         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A*
     A* OUR  CARRIER INFO.
     A            ERTSQH         2          COLHDG('ROUTING' 'SEQ.CODE')
     A**                                     'O' - We are origin carrier
     A**                                     'B' - we are origin/delivery carrie
     A**                                     '1' to '9' - we were 2nd carrier
     A**                                       (i.e. '1' seq.code) after origin
     A**                                       carrier
     A            EILTMH         1          COLHDG('TRANSPORT' 'METHOD')
     A            ESCACH         4          COLHDG('SCAC CODE')
     A**                                           'NART' OR 'KYSO'
     A            EPRDYH         8S 0       COLHDG('PRO DATE')
     A**                                      YYYYMMDD
     A            EDELYH         8S 0       COLHDG('DELIVERY DATE')
     A**                                      YYYYMMDD
     A            ERRRTH         3          COLHDG('ROUND' 'TRIP')
     A**                                      RRR = ROUND TRIP
     A**                                       THIS PRO INVOLVES
     A**                                        GOING BACK TO ORIGIN
     A**                                        DC WITH STUFF FROM
     A**                                        STORE OR VENDOR
     A**********************************************************************
     A*           EKH2      -      EDI B/L HEADER FOR KMART
     A*!!!!!!!!!!         MUST BE IN LIBRARY BLPGM
GP   A* !!!!!!!! EKD1, EKD2,EKH1, EKH2, EKT1
GP   A* !!!!!!!! OBJECTS TAKEN OUT SINCE IT IS A KMART FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EKH2FM
     A*
     A            EPRO#O         7  0       COLHDG('PRO #')
     A            ERFQFO         2          COLHDG('REF. QUALIF.')
     A            EREF#O        15          COLHDG('REF. NUMBER')
     A**********************************************************************
     A*           EKD1      -      EDI B/L DETAIL FOR KMART
     A*                            (SHOWS STOP-OFF INFO.)
     A*                            (EXCLUDING FINAL DEST.)
     A*!!!!!!!!!!!        MUST BE IN LIBRARY BLPGM
GP   A* !!!!!!!! EKD1, EKD2,EKH1, EKH2, EKT1
GP   A* !!!!!!!! OBJECTS TAKEN OUT SINCE IT IS A KMART FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EKD1FM
     A*
     A            EPRO#D         7  0       COLHDG('PRO #')
     A            ESEQ#D         2  0       COLHDG('SEQ #')
     A            EREASD         2          COLHDG('STOP-OFF' 'REASON CODE')
     A            EIDCDD         2          COLHDG('ID CODE')
     A            ENAMED        35          COLHDG('NAME')
     A            ECITYD        30          COLHDG('CITY')
     A            ESTATD         2          COLHDG('STATE')
     A            EZIPCD         5          COLHDG('ZIP')
     A**********************************************************************
     A*           EKD2      -      EDI B/L DETAIL FOR KMART
     A*!!!!!!!!!!!        MUST BE IN LIBRARY BLPGM
     A*                            (SHOWS DETAIL ITEMS LINE INFO.)
GP   A* !!!!!!!! EKD1, EKD2,EKH1, EKH2, EKT1
GP   A* !!!!!!!! OBJECTS TAKEN OUT SINCE IT IS A KMART FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EKD2FM
     A*
     A            EPR##D         7  0       COLHDG('PRO #')
     A            ELINED         2  0       COLHDG('PRO' 'LINE#')
     A            EDESCD        25          COLHDG('DESCRIPTION')
     A            EWTASD         5  0       COLHDG('WEIGHT' 'RATED AS')
     A            EASQFD         2          COLHDG('RATED AS' 'QUALIFIER')
     A            EWGTAD         5  0       COLHDG('WEIGHT' 'ACTUAL')
     A            EWTQFD         2          COLHDG('WEIGHT' 'QUALIFIER')
     A**                                     N = ACTUAL WEIGHT
     A**                                     F = DEFICIT WEIGHT
     A**                                     B = BILLED/RATED
OUT  A******      EQTY1D         5  0       COLHDG('QTY' )
GPNEWA            EQTY1D         6  0       COLHDG('QTY' )
     A            EQTYPD         3          COLHDG('QTY' 'PCS/???' )
     A**
     A** SPECIAL CHARGES FIELDS
     A**
     A            ERATED         5  2       COLHDG('FREIGHT RATE')
     A            ERTQFD         2          COLHDG('RATE QAULIFIER')
     A**                                     'PH' = PER HUNDRED
     A**                                     'PM' = PER MILE
     A            ESCHGD         9  2       COLHDG('CHARGE')
     A            ESCCDD         3          COLHDG('SPECIAL CHARGE' 'CODE')
     A**                                  UND = UNLOADING
     A**                                  LDG = LOADING
     A**                                  SOC = STOP-OFF CHARGE
     A**                                  FUE = FUEL SURCHARGE
     A            ETOTMD         5  0       COLHDG('TOTAL MILES')
     A            EMILQD         1          COLHDG('MILE QUALIFIER')
     A**********************************************************************
     A*           EKT1      -      EDI B/L TOTALS FOR KMART
GP   A* !!!!!!!! EKD1, EKD2,EKH1, EKH2, EKT1
GP   A* !!!!!!!! OBJECTS TAKEN OUT SINCE IT IS A KMART FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00005
     A*         R EKT1FM
     A*
     A            EINT#W        15          COLHDG('EDI INTERCHANGE ID')
     A            E#RECW         3  0       COLHDG('# OF EDI' '210 DOC. SENT')
     A            ETOTLW        10  2       COLHDG('TOTAL AMOUNT')
     A*
     A**********************************************************************
     A*           EFOM    -    N       WORK FILE FOR FEDERATED EDI 214 G CREATED
     A*                                FOR KEYSTONE
     A*                                (MANF/MOVE LEVEL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R EFOMFM
     A*
     A            SNDIDN         4          COLHDG('SENDER ID #')
     A*                                      OUTSIDE CARRIER SENDER
     A*                                      ID = SCAC
     A            CONSEN         5  0       COLHDG('CONSIGNEE #')
     A*
     A            OSCACN         4          COLHDG('OUTBOUND SCAC')
     A*                                           (KYSO FOR NOW)
     A            MANCEN         2S 0       COLHDG('MANIFEST' 'CENT')
     A*                                           E.G. YEAR 1998 --
     A*                                                MANCEM=19
     A            MANYEN         2S 0       COLHDG('MANIFEST' 'YEAR')
     A            MANMEN         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANDEN         2S 0       COLHDG('MANIFEST' 'DAY')
     A*
     A            TRTYEN         2          COLHDG('TRANS.' 'TYPE')
     A**                                     VALUES('00 -- ORIGINAL EDI'
     A            SNAMEN        35          COLHDG('CONTACT' 'NAME')
     A            STELEN        20          COLHDG('TEL.NUMBER')
     A*
     A            DELCEN         2S 0       COLHDG('DELIVERY' 'CENT')
     A            DELYEN         2S 0       COLHDG('DELIVERY' 'YEAR')
     A            DELMEN         2S 0       COLHDG('DELIVERY' 'MONTH')
     A            DELDEN         2S 0       COLHDG('DELIVERY' 'DAY')
     A            DELTEN         4  0       COLHDG('DELIVERY' 'TIME')
     A            DELTQN         2          COLHDG('DEL TIME' 'QUAL')
     A*                                     VALUES(LT=LOCAL TIME)
     A            TRAILN        10          COLHDG('TRAILER #')
     A            SEA1EN        10          COLHDG('SEAL #1')
     A            SEA2EN        10          COLHDG('SEAL #2')
     A*
???? A            AKEYEN         6          COLHDG('CONS# + TYPE')
     A*                                     VALUE('L'TYPE= LTL ACCOUNT)
     A**********************************************************************
     A*           EFOR    -    U       WORK FILE FOR FEDERATED EDI 214 G CREATED
     A*                                (PROS LEVEL)
     A*                                FOR KEYSTONE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFORFM
     A*
     A            SNDIDU         4          COLHDG('SENDER ID #')
     A*                                      OUTSIDE CARRIER SENDER
     A*                                      ID = SCAC
     A            PRO#EU        20          COLHDG('PRO' 'NUMBER')
     A*
     A            CONSEU         5  0       COLHDG('CONSIGNEE #')
     A*
     A            BLNUEU        20          COLHDG('SHIPPER B/L')
     A            PUSCEU         4          COLHDG('P/U SCAC' 'CODE')
     A**                                     SAME AS OSCACN
     A            SHPNEU        25          COLHDG('SHIPPER NAME')
     A            SHADEU        25          COLHDG('SHIPPER ADDR')
     A            SHCTEU        16          COLHDG('SHIPPER CITY')
     A            SHZPEU         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHSTEU         2          COLHDG('SHIPPER' 'STATE')
     A*
     A            CTNGEU         3          COLHDG('CTN OR' 'GOH')
     A            TOQTEU         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWTEU         5  0       COLHDG('TOTAL' 'WGT')
     A            PAYCEU         2          COLHDG('PRE-PAID OR COLLECT')
     A*                                               CC = COLLECT
     A*                                               PP = PREPAID
     A**                                    (WILL BE BLANK FOR NOW)
     A**                                     (THIS INFO. NOT ENTERED)
     A            PICCEU         2S 0       COLHDG('PICK-UP' 'CENT')
     A            PICYEU         2S 0       COLHDG('PICK-UP' 'YEAR')
     A            PICMEU         2S 0       COLHDG('PICK-UP' 'MONTH')
     A            PICDEU         2S 0       COLHDG('PICK-UP' 'DAY')
     A*
     A            TOTLEU         9  2       COLHDG('TOTAL' 'AMOUNT')
     A*                                      (WILL BE ZERO FOR NOW)
     A*                                      (THIS INFO. NOT ENTERED)
     A            LDSQEU         3  0       COLHDG('LOAD' 'SEQ')
     A**                                         FROM NOSE TO TAIL
     A**                                         VALUES=001,002...
     A            OSCACU         4          COLHDG('OUTBOUND SCAC')
     A*                                           (KYSO FOR NOW)
     A            DELCEU         2S 0       COLHDG('DELIVERY' 'CENT')
     A            DELYEU         2S 0       COLHDG('DELIVERY' 'YEAR')
     A            DELMEU         2S 0       COLHDG('DELIVERY' 'MONTH')
     A            DELDEU         2S 0       COLHDG('DELIVERY' 'DAY')
     A*                                     VALUES(LT=LOCAL TIME)
     A            TRAILU        10          COLHDG('TRAILER #')
     A            AKEYEU         6          COLHDG('CONS# + TYPE')
     A*                                     VALUE('L'TYPE= LTL ACCOUNT)
     A            CKEYEU         6          COLHDG('CONS# + TYPE')
     A*                                     VALUE('K'TYPE= FM KEYSTONE)
     A*
     A**********************************************************************
     A*           EFOP    -    V       PO FILE FOR 214 FORMAT DETAIL
     A*                                FOR FEDERATED EDI
     A*                                FOR KEYSTONE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFOPFM
     A*
     A            SNDIDV         4          COLHDG('SENDER ID #')
     A*                                      OUTSIDE CARRIER SENDER
     A*                                      ID = SCAC
     A            PRO#EV        20          COLHDG('PRO #')
     A            CONSEV         5  0       COLHDG('CONSIGNEE #')
     A            LDSQEV         3  0       COLHDG('LOAD' 'SEQ')
     A            PONUEV        15          COLHDG('PO #')
     A            QUANEV         5  0       COLHDG('QUANTITY')
     A            DEPTEV         4          COLHDG('DEPT #')
     A**********************************************************************
     A*           OSFC      -      OUTSIDE CARRIERS FOR FEDERATED TO
     A*                            GET INFO. FOR EDI 214 FOR THE
     A*                            KEYSTONE CARRIER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R OSFCFM
     A*
     A            SCAC#4         4          COLHDG('CARRIER SCAC')
     A            SHPNE4        25          COLHDG('SHIPPER NAME')
     A            SHADE4        25          COLHDG('SHIPPER ADDR')
     A            SHCTE4        16          COLHDG('SHIPPER CITY')
     A            SHSTE4         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPE4         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SCNAM4        35          COLHDG('CONTACT' 'NAME')
     A            SCTEL4        20          COLHDG('SHIPPER' 'TEL#')
     A            SCFAX4        20          COLHDG('SHIPPER' 'FAX#')
     A            SCEML4        20          COLHDG('SHIPPER' 'E-MAIL')
     A**********************************************************************
     A*           EJOH    -    JH      EDI HEADER FOR 210 FOR JOANN
     A*                                STORES PROS
     A*                                  OBJECT IN WSFILE2
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EJOHFM
     A*
     A            EDICJH         8          COLHDG('JOANN210')
     A            PRO#JH         7  0       COLHDG('PRO #')
     A            BLNUJH        17          COLHDG('BILL OF LADING')
     A            PAYCJH         2          COLHDG('PREPAID/COLLECT')
     A*                                       ALWAYS PP -- PREPAID
     A            PRODJH         8  0       COLHDG('PRO' 'DATE')
     A            TOT$JH         9  2       COLHDG('TOTAL AMOUNT')
     A            DELDJH         8  0       COLHDG('DELIVERY' 'DATE')
     A*                                         YYYYMMDD
     A            SCACJH         4          COLHDG('SCAC')
     A*                                        NART
     A            TARFJH         2          COLHDG('TARIFF' 'CODE')
     A*                                        LT = LESS THAN TRUCKLOAD
     A*                                        TL= TRUCKLOAD
     A            SHPDJH         8  0       COLHDG('SHIPPED' 'DATE')
     A*                                         YYYYMMDD
     A*                                        FOR NRT -- PRO DATE
     A            PICKJH         8  0       COLHDG('PICK-UP' 'DATE')
     A*                                         YYYYMMDD
     A*                                        FOR NRT -- PRO DATE
     A            SHIPJH        25          COLHDG('SHIPPER NAME')
     A            SHIDJH        10          COLHDG('ID' 'CODE')
     A*                                         JOAN-01
     A            SHADJH        25          COLHDG('SHIPPER ADD1')
     A            SHCTJH        16          COLHDG('SHIPPER CITY')
     A            SHSTJH         2          COLHDG('SHIPPER STATE')
     A            SHZPJH         5          COLHDG('SHIPPER ZIP')
     A            CONSJH        25          COLHDG('CONSIGNEE NAME')
     A            COADJH        25          COLHDG('CONSIGNEE ADD1')
     A            COCTJH        16          COLHDG('CONSIGNEE CITY')
     A            COSTJH         2          COLHDG('CONSIGNEE STATE')
     A            COZPJH         5          COLHDG('CONSIGNEE ZIP')
     A            BILLJH        25          COLHDG('BILL-TO NAME')
     A            BILAJH        25          COLHDG('BILL-TO ADD1')
     A            BIA2JH        25          COLHDG('CONSIGNEE ADD2')
     A            BICTJH        16          COLHDG('BILL-TO CITY')
     A            BISTJH         2          COLHDG('BILL-TO STATE')
     A            BIZPJH         5          COLHDG('BILL-TO ZIP')
     A            DESCJH        25          COLHDG('LADING' 'DESC')
     A*                                      NOT USED
OUT  A**          TQTYJH         5  0       COLHDG('TOTAL QTY')
OUT  A***         TOWGJH         5  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
GPNEWA            TQTYJH         6  0       COLHDG('TOTAL QTY')
GPNEWA            TOWGJH         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A**********************************************************************
     A*           EJOD    -    JD      EDI DETAIL FOR 210 FOR JOANN
     A*                                STORES PROS  DETAIL CHARGES
     A*                                  OBJECT IN WSFILE2
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EJODFM
     A*
     A            PRO#JD         7  0       COLHDG('PRO #')
     A            SEQNJD         1  0       COLHDG('SEQ' 'NUMBER')
     A*                                      FOR THE LX,L1 SEGMENT
     A            SEQ2JD         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L5,L0,L7 SEGMENT
     A            RATQJD         2          COLHDG('RATE' 'QUALIFIER')
     A*                                      LB -- PER POUND
     A*                                      MN = MINIMUM CHARGE
     A            RATEJD         5  2       COLHDG('RATE')
     A            TOT$JD         9  2       COLHDG('EXTENDED' 'AMT')
     A            TOQFJD         3          COLHDG('SPECIAL CHARGE' 'QUALIFIER')
     A*                                        FUE = FUEL SURCHARGE
     A*                                        DSC = DICOUNT
     A* DETAILS OF QTY,...
     A            DESCJD        25          COLHDG('LADING' 'DESC')
     A*                                      JO-ANN'S OUTBOUND CARTONS
OUT  A***         TQTYJD         5  0       COLHDG('TOTAL QTY')
OUT  A***         TOWGJD         5  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
GPNEWA            TQTYJD         6  0       COLHDG('TOTAL QTY')
GPNEWA            TOWGJD         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            FRTCJD         2          COLHDG('FREIGHT' 'CLASS')
     A*                                          70
     A**********************************************************************
     A*           EJOI    -    JI      EDI DETAIL FOR 210 FOR JOANN
     A*                                STORES INSTRUCTIONS
     A*                                  OBJECT IN WSFILE2
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EJOIFM
     A*
     A            PRO#JI         7  0       COLHDG('PRO #')
     A            SEQNJI         1  0       COLHDG('SEQ' 'NUMBER')
     A            INSTJI        70          COLHDG('INSTRUCTIONS')
     A**********************************************************************
     A*           EJOK    -    JK      EDI DETAIL FOR 210 FOR JOANN
     A*                                STORES ACKNOWLEDGEMENT (997)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EJOKFM
     A*
     A            MAILJK        10          COLHDG('997 MAILBOX ID#')
     A            TDGPJK        15          COLHDG('TDG PARTNER' 'ID')
     A            GRPRJK        14          COLHDG('GROUP' 'REF#')
     A            STATJK         1          COLHDG('TARGET STATUS')
     A*                                       A = ACCEPTED
     A            NUMSJK         6  0       COLHDG('NUMBER' 'SENT')
     A            RECVJK         6  0       COLHDG('NUMBER' 'RECVD')
     A            ACCPJK         6  0       COLHDG('NUMBER' 'ACCEPTED')
     A            PROCJK         1          COLHDG('PROCESSED')
     A*                                       Y = MATCHED WITH 210
     A*                                       X = THESE 997 WERE FOR
     A*                                           THE 214 WE SEND OUT
     A**********************************************************************
     A*           ELNC    -    LC      EDI  FOR CASS/LNT COMPTON
     A*                                ACKNOWLEDGEMENT (997)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 01000
     A*         R ELNCFM
     A*
     A            MAILLC        10          COLHDG('997 MAILBOX ID#')
     A            TDGPLC        15          COLHDG('TDG PARTNER' 'ID')
     A            GRPRLC        14          COLHDG('GROUP' 'REF#')
     A            STATLC         1          COLHDG('LNT STATUS')
     A*                                       A = ACCEPTED
     A*                                       A = REJECTED
     A*                                       E = PROCESSED WITH ERROR
     A            NUMSLC         6  0       COLHDG('NUMBER' 'SENT')
     A            RECVLC         6  0       COLHDG('NUMBER' 'RECVD')
     A            ACCPLC         6  0       COLHDG('NUMBER' 'ACCEPTED')
     A            PROCLC         1          COLHDG('PROCESSED')
     A*                                       Y = MATCHED WITH 210
     A*                                       X = THESE 997 WERE FOR
     A*                                           THE 214 WE SEND OUT
     A**********************************************************************
     A*           ELNH    -    LH      EDI HEADER FOR LNT 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 01000
     A*         R ELNHFM
     A*
     A            EDICLH         8          COLHDG('LNT210')
     A            PRO#LH         8          COLHDG('PRO #')
     A            BLNULH        17          COLHDG('BILL OF LADING')
     A            PAYCLH         2          COLHDG('PREPAID/COLLECT')
     A*                                       ALWAYS PP -- PREPAID
     A            PRODLH         8  0       COLHDG('PRO' 'DATE')
     A            TOT$LH         9  2       COLHDG('TOTAL AMOUNT')
     A            DELDLH         8  0       COLHDG('DELIVERY' 'DATE')
     A*                                         YYYYMMDD
     A            SHPDLH         8  0       COLHDG('SHIPPED' 'DATE')
     A*                                         YYYYMMDD
     A            SCACLH         4          COLHDG('SCAC')
     A*                                        NART
     A            SHIPLH        25          COLHDG('SHIPPER NAME')
     A            SHIDLH        10          COLHDG('ID' 'CODE')
     A*                                         LNT-01
     A            SHADLH        25          COLHDG('SHIPPER ADD1')
     A            SHCTLH        16          COLHDG('SHIPPER CITY')
     A            SHSTLH         2          COLHDG('SHIPPER STATE')
     A            SHZPLH         5          COLHDG('SHIPPER ZIP')
     A            CONSLH        25          COLHDG('CONSIGNEE NAME')
     A            COADLH        25          COLHDG('CONSIGNEE ADD1')
     A            COCTLH        16          COLHDG('CONSIGNEE CITY')
     A            COSTLH         2          COLHDG('CONSIGNEE STATE')
     A            COZPLH         5          COLHDG('CONSIGNEE ZIP')
     A            BILLLH        25          COLHDG('BILL-TO NAME')
     A            BILALH        25          COLHDG('BILL-TO ADD1')
     A*           BIA2LH        25          COLHDG('CONSIGNEE ADD2')
     A            BICTLH        16          COLHDG('BILL-TO CITY')
     A            BISTLH         2          COLHDG('BILL-TO STATE')
     A            BIZPLH         5          COLHDG('BILL-TO ZIP')
     A            TQTYLH         6  0       COLHDG('TOTAL QTY')
     A            TOWGLH         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A**********************************************************************
     A*           ELND    -    LD      EDI DETAIL FOR LNT 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R ELNDFM
     A*
     A            PRO#LD         8          COLHDG('PRO #')
     A            SEQNLD         1  0       COLHDG('SEQ' 'NUMBER')
     A*                                      FOR THE S5 SEGMENT
     A*           SEQ2LD         1  0       COLHDG('SEQ' 'NUMBER2')
     A            STRELD         2          COLHDG('STOP REASON' 'CODE')
     A*                                     PL - PARTIAL LOAD
     A*                                     CL - COMPLETE LOAD
     A*                                     PU - PARTIAL UNLOAD
     A*                                     CU - COMPLETE UNLOAD
     A            TOWGLD         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYLD         6  0       COLHDG('TOTAL QTY')
     A            ENAMLD        35          COLHDG('NAME')
     A            ECITLD        30          COLHDG('CITY')
     A            ESTALD         2          COLHDG('STATE')
     A            EZIPLD         5          COLHDG('ZIP')
     A**********************************************************************
     A*           ELNK    -    LK      EDI  FOR CASS/LNT
     A*                                ACKNOWLEDGEMENT (997)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 01000
     A*         R ELNKFM
     A*
     A            MAILLK        10          COLHDG('997 MAILBOX ID#')
     A            TDGPLK        15          COLHDG('TDG PARTNER' 'ID')
     A            GRPRLK        14          COLHDG('GROUP' 'REF#')
     A            STATLK         1          COLHDG('LNT STATUS')
     A*                                       A = ACCEPTED
     A*                                       A = REJECTED
     A*                                       E = PROCESSED WITH ERROR
     A            NUMSLK         6  0       COLHDG('NUMBER' 'SENT')
     A            RECVLK         6  0       COLHDG('NUMBER' 'RECVD')
     A            ACCPLK         6  0       COLHDG('NUMBER' 'ACCEPTED')
     A            PROCLK         1          COLHDG('PROCESSED')
     A*                                       Y = MATCHED WITH 210
     A*                                       X = THESE 997 WERE FOR
     A*                                           THE 214 WE SEND OUT
     A**********************************************************************
     A*           ELNR    -    LR      EDI (SECOND) DETAIL FOR LNT 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R ELNRFM
     A*
     A            PRO#LR         8          COLHDG('PRO #')
     A            SEQNLR         1  0       COLHDG('SEQ' 'NUMBER')
     A            SEQ2LR         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L0 SEGMENT
     A* DETAILS OF QTY,...
     A            DESCLR        25          COLHDG('LADING' 'DESC')
     A*                                     LNT OUTBOUND CARTONS
     A            TOWGLR         5  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYLR         5  0       COLHDG('TOTAL QTY')
     A            RATELR         9  2       COLHDG('RATE')
     A            RATQLR         2          COLHDG('RATE' 'QUALIFIER')
     A*                                      PP = PER PCS
     A*                                      PM = PER MILE
     A*                                      FR = FLAT RATE
     A*                                      LB = PER POUND
     A*                                      MN = MINIMUM CHARGE
     A            TOT$LR         9  2       COLHDG('EXTENDED' 'AMT')
     A            TOQFLR         3          COLHDG('SPECIAL CHARGE' 'QUALIFIER')
     A*                                        FUE = FUEL SURCHARGE
     A*                                        DSC = DISCOUNT
     A            PACKLR         3          COLHDG('PACKAGING CODE')
     A**********************************************************************
     A*           EMH1      -      EDI B/L HEADER FOR MICHAELS
     A*                             OBJECT IN KYFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EMH1FM
     A            EINTMH        15          COLHDG('EDI INTERCHANGE ID')
     A            EPROMH         7  0       COLHDG('PRO #')
     A            ELD#MH        30          COLHDG('FMX' 'LOAD#')
     A            EPYMMH         2          COLHDG('PAYMENT METHOD')
     A**                                     TP (HARD CODED AS PER
     A**                                          EDI SPECS)
     A            EPRDMH         8S 0       COLHDG('PRO DATE')
     A**                                      YYYYMMDD
     A            ESCAMH         4          COLHDG('SCAC')
     A*                                        KYSO
     A            ECURMH         3          COLHDG('CURRENCY')
     A*                                        USD
     A            ECHGMH         9  2       COLHDG('TOTAL AMOUNT')
     A            EPDDMH         8S 0       COLHDG('PAYMENT' 'DUEDATE')
     A**                                      YYYYMMDD
     A**********************************************************************
     A*           EMD1      -      EDI B/L DETAIL FOR MICHAELS
     A*                            (SHOWS DETAIL ITEMS LINE INFO.)
     A*                             OBJECT IN KYFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EMD1FM
     A*
     A            EPR#MD         7  0       COLHDG('PRO #')
     A            ELINMD         2  0       COLHDG('PRO' 'LINE#')
     A            ELD#MD        30          COLHDG('FMX' 'LOAD#')
     A            EWGTMD         5  0       COLHDG('WEIGHT' 'ACTUAL')
     A            EWTQMD         2          COLHDG('WEIGHT' 'QUALIFIER')
     A**                                     N = ACTUAL WEIGHT
     A**                                     F = DEFICIT WEIGHT
     A**                                     B = BILLED/RATED
GPNEWA            EQTYMD         6  0       COLHDG('QTY' )
     A            EQTPMD         3          COLHDG('QTY' 'PCS/???' )
     A**
     A** SPECIAL CHARGES FIELDS
     A**
GP   A            ERATMD         9  2       COLHDG('FREIGHT RATE')
     A            ERTQMD         2          COLHDG('RATE QAULIFIER')
     A**                                     'PH' = PER HUNDRED
     A**                                     'PM' = PER MILE
     A            ESCHMD         9  2       COLHDG('CHARGE')
     A            ESCCMD         3          COLHDG('SPECIAL CHARGE' 'CODE')
     A**                                  UND = UNLOADING
     A**                                  LDG = LOADING
     A**                                  SOC = STOP-OFF CHARGE
     A**                                  FUE = FUEL SURCHARGE
     A            EPYMMD         1          COLHDG('PAYMENT METHOD')
     A**                                     C = COLLECT
     A**                                     P  = PREPAID
     A            FRTCMD         2          COLHDG('FREIGHT' 'CLASS')
     A*                                          70 IF ESCCMD IS
     A*                                             BY WEIGHT I.E. 400
     A            FR2CMD         3          COLHDG('FREIGHT' 'CLASS')
     A*                                          FAK
     A**********************************************************************
     A*           EMH9    -    M9      EDI DETAIL FOR 210 FOR MICHEALS
     A*                                       ACKNOWLEDGEMENT (997)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R EMH9FM
     A*
     A            MAILM9        10          COLHDG('997 MAILBOX ID#')
     A            TDGPM9        15          COLHDG('TDG PARTNER' 'ID')
     A*                                      MH210
     A            GRPRM9        14          COLHDG('GROUP' 'REF#')
     A            STATM9         1          COLHDG('MICHEALS STATUS')
     A*                                       A = ACCEPTED
     A            NUMSM9         6  0       COLHDG('NUMBER' 'SENT')
     A            RECVM9         6  0       COLHDG('NUMBER' 'RECVD')
     A            ACCPM9         6  0       COLHDG('NUMBER' 'ACCEPTED')
     A            PROCM9         1          COLHDG('PROCESSED')
     A*                                       Y = MATCHED WITH 210
     A*                                       X = THESE 997 WERE FOR
     A*                                           THE 210 WE SEND OUT
     A* SUSAN
     A**********************************************************************
     A*           ETGB    -    GB           EDI HEADER FOR TARGET210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETGBFM
     A*
     A            AEDIGB         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJM210
     A            PRO#GB         7  0       COLHDG('PRO#')
     A            LINEGB         2  0       COLHDG('LINE #')
     A**???       WRAMGB         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            DESCGB        50          COLHDG('DESC')
     A            COMMGB        30          COLHDG('COMMODITY' 'CODE')
     A            COMQGB         1          COLHDG('COMMODITY' 'QUAL')
     A*                                      N
     A*                                      Z
     A            BWGTGB        11          COLHDG('WGT' 'BILLED')
     A            BWGQGB         2          COLHDG('QUALIF')
     A*                                      'LB'  = POUNDS
     A*                                      'FR'  = FLAT RATE
     A*                                      'NP'  = PER PIECE
     A*                                     'DM'   = MILES
     A            WGTTGB         9  0       COLHDG('WGT')
     A            WGTQGB         1          COLHDG('WGT' 'QUALIF')
     A*                                        B = BILLED WEIGHT
     A*                                        G = GROSS WEIGHT
     A*                                        F = DEFICIT WEIGHT
     A            WGTUGB         1          COLHDG('WGT' 'UNIT')
     A*                                        L
     A            QUANGB         9  0       COLHDG('QTY')
     A            PACKGB         3          COLHDG('PACKING' 'CODE')
     A*
     A            FRTRGB         9  2       COLHDG('FREIGHT' 'RATE')
     A            FRTQGB         2          COLHDG('FREIGHT' 'QUALIF')
     A*                                        FR= FLAT RATE
     A*                                        MN= MINIMUM
     A*                                        PH= PER HUNDRED (BASE UNITS)
     A*                                        PL= PER LOAD
     A*                                        PM= PER MILE
     A*                                        WM= WEIGHT MEASUREMENT
     A            SPECGB         3          COLHDG('SPECIAL' 'CODE')
     A            AMT$GB         9  2       COLHDG('CHARGES')
     A            FRTR2B        10          COLHDG('FREIGHT' 'RATE')
     A*                                     SAME VALUE AS FRTQTB
     A*                                     BUT WITH A DECIMAL POINT
     A**********************************************************************
     A**********************************************************************
     A*           ETGH    -    GH           EDI HEADER FOR TARGET210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R ETGHFM
     A*
     A*
     A            AEDIGH         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJM210
     A            PRO#GH         7  0       COLHDG('PRO#')
     A            SHPIGH        30          COLHDG('SHIPMENT' 'ID#')
     A            CCPPGH         2          COLHDG('PRE-PAID OR COLLECT')
     A            PRODGH         8S 0       COLHDG('PRO' 'DATE')
     A*                                        YYYYMMDD
     A            NET$GH         9  2       COLHDG('NET' 'DUE')
     A            DELDGH         8S 0       COLHDG('DEL' 'DATE')
     A*                                        YYYYMMDD
     A            DTQFGH         3          COLHDG('DATE' 'QUALIFIER')
     A*                                       035
     A            SCACGH         4          COLHDG('CARRIER' 'SCAC')
     A            BILQGH         3          COLHDG('BILLING' 'TYPE')
     A*                                      BLT
     A            BILIGH         4          COLHDG('BILLING' 'INFO')
     A*                                      CC = COLLECT
     A*                                      PP = PREPAID
     A*                                      POEA = POE ADVANCED
     A*                                      POEH = POE HANDLING
     A            SHPDGH         8S 0       COLHDG('SHIP' 'DATE')
     A*                                        YYYYMMDD
     A            SHQFGH         2          COLHDG('SHIP DT' 'QUALIFIER')
     A*                                       11
     A            TQTYGH         9  0       COLHDG('TOTAL' 'QTY')
     A            TOWTGH         9  0       COLHDG('TOTAL' 'WGT')
     A            WGTQGH         1          COLHDG('WGT' 'QUALIF')
     A*                                        G = GROSS WEIGHT
     A            TVOLGH         9  0       COLHDG('GROSS' 'TOT VOL')
     A            VOLQGH         1          COLHDG('VOL' 'QUALIF')
     A*                                        E
     A            INV#GH         9  0       COLHDG('INV#')
     A*                                       FOR NRT P/U --
     A*                                        INV#=PRO#
     A            SHPNGH        60          COLHDG('SHIPPER NAME')
     A            SHIDGH        12          COLHDG('LOC' 'ID')
     A*                                       FROM COMP FILE
     A            SHADGH        55          COLHDG('SHIPPER' 'ADDR')
     A            SHCTGH        25          COLHDG('SHIPPER' 'CITY')
     A            SHSTGH         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPGH         5  0       COLHDG('SHIPPER' 'ZIP')
     A            CNNMGH        60          COLHDG('CONSIGNEE')
     A            CNIDGH        12          COLHDG('LOC' 'ID')
     A*                                       FROM CADR FILE
     A            CNADGH        55          COLHDG('CONSIG' 'ADDR')
     A            CNCTGH        25          COLHDG('CONSIG' 'CITY')
     A            CNSTGH         2          COLHDG('CONSIG' 'STATE')
     A            CNZPGH         5  0       COLHDG('CONSIG' 'ZIP')
     A            EQP#GH        10          COLHDG('EQP#')
     A*                                        TRL# OR
     A*                                       CONTAINER# (W/O CHECK DIG
     A            EQPDGH         2          COLHDG('EQP' 'DESC')
     A*                                         TL = TRAILER
     A*                                         CN = CONTAINER
     A            EQSCGH         4          COLHDG('EQP' 'SCAC')
     A*                                       SCAC OF TRL/CONTAINER
     A**********************************************************************
     A*                                     ONLY FOR T/L
     A**********************************************************************
     A**********************************************************************
     A*           ETGP      -  GP  EDI 210 DETAIL FOR TJ MAX(MARMAX)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETGPFM
     A*
     A            AEDIGP         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TGT210
     A            PRO#GP         7  0       COLHDG('PRO#')
     A            STP#GP         2  0       COLHDG('STOP #')
     A*                                         = 0
     A*                                       NOT USED SINCE
     A*                                        SPO IS AT HEADER LEVEL
     A*                                        IN THE 210 NOW
     A*                                      !!! DO NOT WRITE PO FOR
     A*                                         EACH STOP
     A            STPRGP         2          COLHDG('STP REASON' 'CODE')
     A*                                       CU
     A*                                       CL
     A*                                       PL
     A*                                       PU
     A            REFIGP         2          COLHDG('REF ID')
     A*                                       04 - WMILP
     A*                                       05 - TK MAXX
     A*                                       08 - TJ MAX
     A*                                       10 - MARSHALLS
     A*                                       19 - AJ WRIGHT
     A*                                       24 - WMI LP
     A*                                       28 - HOME GOODS
     A            PO##GP        22          COLHDG('PO #')
     A            CORGGP         3          COLHDG('CT/' 'PC')
     A            WGTTGP         5  0       COLHDG('WGT')
     A            WGTUGP         1          COLHDG('WGT' 'UNIT CD')
     A*                                        L
     A            QUANGP         5  0       COLHDG('QTY')
     A            OBMFGP        30          COLHDG('O/B MANF#')
     A            WRECGP         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A****************************************************************
     A**********************************************************************
     A*           ETGR    -    GR      EDI (SECOND) DETAIL FOR  TARGET210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R ETGRFM
     A*
     A            AEDIGR         6          COLHDG('EDI' 'INTERCHANGE#')
     A            PRO#GR         7  0       COLHDG('PRO #')
     A            SEQNGR         1  0       COLHDG('SEQ' 'NUMBER')
     A            SEQ2GR         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L0 SEGMENT
     A* DETAILS OF QTY,...
     A            DESCGR        25          COLHDG('LADING' 'DESC')
     A*                                     LNT OUTBOUND CARTONS
     A            TOWGGR         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYGR         6  0       COLHDG('TOTAL QTY')
     A            RATEGR         9  2       COLHDG('RATE')
     A            RATQGR         2          COLHDG('RATE' 'QUALIFIER')
     A*                                      PP = PER PCS
     A*                                      PM = PER MILE
     A*                                      FR = FLAT RATE
     A*                                      LB = PER POUND
     A*                                      MN = MINIMUM CHARGE
     A            TOT$GR         9  2       COLHDG('EXTENDED' 'AMT')
     A            TOQFGR         3          COLHDG('SPECIAL CHARGE' 'QUALIFIER')
     A*                                        FUE = FUEL SURCHARGE
     A*                                        DSC = DISCOUNT
     A            PACKGR         3          COLHDG('PACKAGING CODE')
     A**********************************************************************
     A* SUSAN
     A**********************************************************************
     A*           ETJH    -    TH           EDI HEADER FOR TJMAX 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R ETJHFM
     A*
     A            ACRECTH        1          COLHDG('ACTIVE' 'REC CODE')
     A            EDICLTH        8          COLHDG('FED210')
     A            PRO#LTH        8          COLHDG('PRO #')
     A            APPT#TH        8          COLHDG('FED APPOINTMENT#')
     A*                                            GIVEN BY FEDERATED
     A            BLN#1TH       17          COLHDG('BILL OF LADING')
     A            BLN#2TH       17          COLHDG('BILL OF LADING')
     A            PAYCLTH        2          COLHDG('PREPAID/COLLECT')
     A            TRANMTH        2          COLHDG('TRANSPORT METHOD')
     A*                                         'T' - TRUCKLOAD
     A*                                         'LT' - LESS THAN TRUCKLOAD
     A*                                         'C' - CONSOLIDATED
     A*                                         'K' - BACKHAUL
     A            PRODLTH        8  0       COLHDG('PRO' 'DATE')
     A            TOT$LTH        9  2       COLHDG('TOTAL AMOUNT')
     A            DELDLTH        8  0       COLHDG('DELIVERY' 'DATE')
     A*                                         YYYYMMDD
     A            SHPDLTH        8  0       COLHDG('SHIPPED' 'DATE')
     A*                                         YYYYMMDD
     A            SCACLTH        4          COLHDG('SCAC')
     A*                                        NART
     A            SHIPLTH       25          COLHDG('SHIPPER NAME')
     A            SHIDLTH       10          COLHDG('ID' 'CODE')
     A*                                         FED-01
     A            SHADLTH       25          COLHDG('SHIPPER ADD1')
     A            SHCTLTH       16          COLHDG('SHIPPER CITY')
     A            SHSTLTH        2          COLHDG('SHIPPER STATE')
     A            SHZPLTH        5          COLHDG('SHIPPER ZIP')
     A            CONSLTH       25          COLHDG('CONSIGNEE NAME')
     A            COADLTH       25          COLHDG('CONSIGNEE ADD1')
     A            COCTLTH       16          COLHDG('CONSIGNEE CITY')
     A            COSTLTH        2          COLHDG('CONSIGNEE STATE')
     A            COZPLTH        5          COLHDG('CONSIGNEE ZIP')
     A            BILLLTH       25          COLHDG('BILL-TO NAME')
     A            BILALTH       25          COLHDG('BILL-TO ADD1')
     A*           BIA2LTH       25          COLHDG('CONSIGNEE ADD2')
     A            BICTLTH       16          COLHDG('BILL-TO CITY')
     A            BISTLTH        2          COLHDG('BILL-TO STATE')
     A            BIZPLTH        5          COLHDG('BILL-TO ZIP')
     A            TQTYLTH        6  0       COLHDG('TOTAL QTY')
     A            TOWGLTH        6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            MILESTH        5  0       COLHDG('MILEAGE')
     A            DELTRTH        6          COLHDG('DELIVERY' 'TRAIL#')
     A*                                     ONLY FOR T/L
     A            HOURSTH        9  2       COLHDG('HOURS')
     A**********************************************************************
     A*           ETJB    -    TB           EDI HEADER FOR TJMAX 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R ETJBFM
     A*
     A            ACRECTB        1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#LTB        8          COLHDG('PRO #')
     A            QUALITB        2          COLHDG('QUALIFIER')
     A*                                         'PO' - PO#
     A*                                         'BM' - BOL#            OAD
     A            BLPO1TB       17          COLHDG('BOL#/PO#')
     A            QUANTTB        6  0       COLHDG('QUANTITY')
     A*                                          FOR FUTURE REF
     A*                                          NOT USED NOW
     A**********************************************************************
     A*           ETJD    -    T1      EDI DETAIL FOR TJMAX 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0150000 010000 01000
     A*         R ETJDFM
     A*
     A            ACRET1         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#T1         8          COLHDG('PRO #')
     A            SEQNT1         1  0       COLHDG('SEQ' 'NUMBER')
     A*                                      FOR THE S5 SEGMENT
     A*           SEQ2T1         1  0       COLHDG('SEQ' 'NUMBER2')
     A            STRET1         2          COLHDG('STOP REASON' 'CODE')
     A*                                     PL - PARTIAL LOAD
     A*                                     CL - COMPLETE LOAD
     A*                                     PU - PARTIAL UNLOAD
     A*                                     CU - COMPLETE UNLOAD
     A            TOWGT1         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYT1         6  0       COLHDG('TOTAL QTY')
     A            ENAMT1        35          COLHDG('NAME')
     A            ECITT1        30          COLHDG('CITY')
     A            ESTAT1         2          COLHDG('STATE')
     A            EZIPT1         5          COLHDG('ZIP')
     A**********************************************************************
     A*           ETJK    -    TK      EDI DETAIL REMARKS FOR TJMAX 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0150000 010000 01000
     A*         R ETJKFM
     A*
     A            ACRETK         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#TK         8          COLHDG('PRO #')
     A            SEQNTK         1  0       COLHDG('SEQ' 'NUMBER')
     A            SEQ2TK         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L0 SEGMENT
     A            REM1TK        30          COLHDG('REMARKS #1')
     A            REM2TK        30          COLHDG('REMARKS #2')
     A**********************************************************************
     A*           ETJR    -    TR      EDI (SECOND) DETAIL FOR TJMAX 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R ETJRFM
     A*
     A            ACRETR         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#TR         8          COLHDG('PRO #')
     A            SEQNTR         1  0       COLHDG('SEQ' 'NUMBER')
     A            SEQ2TR         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L0 SEGMENT
     A* DETAILS OF QTY,...
     A            DESCTR        25          COLHDG('LADING' 'DESC')
     A*                                     LNT OUTBOUND CARTONS
     A            TOWGTR         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYTR         6  0       COLHDG('TOTAL QTY')
     A            RATETR         9  2       COLHDG('RATE')
     A            RATQTR         2          COLHDG('RATE' 'QUALIFIER')
     A*                                      PP = PER PCS
     A*                                      PM = PER MILE
     A*                                      FR = FLAT RATE
     A*                                      LB = PER POUND
     A*                                      MN = MINIMUM CHARGE
     A            TOT$TR         9  2       COLHDG('EXTENDED' 'AMT')
     A            TOQFTR         3          COLHDG('SPECIAL CHARGE' 'QUALIFIER')
     A*                                        FUE = FUEL SURCHARGE
     A*                                        DSC = DISCOUNT
     A            PACKTR         3          COLHDG('PACKAGING CODE')
     A**********************************************************************
     A*           BTCH    -    A/R CASH BATCHES LOG FILE (HDR)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R BTCHFM
     A*
     A            ACREB#         1          COLHDG('ACTIVE' 'REC CODE')
     A            BTCHB#         7  0       COLHDG('BATCH' 'NUMBER')
     A            GOODB#         1          COLHDG('GOOD TO GO')
     A*                                             Y = READY TO BE ASSIGNED
     A            USERB#         2          COLHDG('ASSIGNED' 'USER')
     A            AMNTB#         9  2       COLHDG('BATCH' 'AMOUNT')
     A            DATEB#          L         COLHDG('DEPOSIT/TRAN' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A* "NORMAL" MANUAL BATCH
     A            CHCKB#         5  0       COLHDG('NUMBER' 'OF CHECKS')
     A* "SPECIAL" MANUAL BATCH
     A            ACNTB#         5  0       COLHDG('ACCOUNT' 'NUMBER')
     A* EDI BATCH
     A            TPIDB#        15          COLHDG('T/P' 'NAME')
     A* AUDIT FIELDS
     A            ADUSB#        10          COLHDG('ADD' 'USER')
     A            ADDTB#          L         COLHDG('ADD' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            ADTMB#         4  0       COLHDG('ADD' 'TIME')
     A            DLUSB#        10          COLHDG('DLT' 'USER')
     A            DLDTB#          L         COLHDG('DLT' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            DLTMB#         4  0       COLHDG('DLT' 'TIME')
     A**********************************************************************
     A*           BTCD    -    A/R CASH BATCHES LOG FILE (DTL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R BTCDFM
     A*
     A            ACREB$         1          COLHDG('ACTIVE' 'REC CODE')
     A            BTCHB$         7  0       COLHDG('BATCH' 'NUMBER')
     A            AMNTB$         9  2       COLHDG('CHECK' 'AMOUNT')
     A**********************************************************************
     A*           BTCA    -    A/R CASH BATCHES - I/C ACH
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R BTCAFM
     A*
     A            ACREB@         1          COLHDG('ACTIVE' 'REC CODE')
     A            BTCHB@         7  0       COLHDG('BATCH' 'NUMBER')
     A            RRN#B@         9  0       COLHDG('ICTR' 'RRN')
     A* FROM ICTR
     A            FCOMB@         4          COLHDG('FROM' 'COMPANY')
     A            FCGLB@         6  0       COLHDG('FROM' 'CO G/L#')
     A            TCOMB@         4          COLHDG('TO' 'COMPANY')
     A            TCGLB@         6  0       COLHDG('TO' 'CO G/L#')
     A            OPERB@         2          COLHDG('OPERATOR' 'ID')
     A            DEPCB@         1S 0       COLHDG('DEPOSIT' 'CENT')
     A            DEPYB@         2S 0       COLHDG('DEPOSIT' 'YEAR')
     A            DEPMB@         2S 0       COLHDG('DEPOSIT' 'MONTH')
     A            DEPDB@         2S 0       COLHDG('DEPOSIT' 'DAY')
     A            TRANB@         7  0       COLHDG('TRANSACTION#')
     A            BATCB@         7  0       COLHDG('BATCH#')
     A            REFNB@        10          COLHDG('REFERENCE#')
     A            CHECB@         6  0       COLHDG('CHECK#')
     A            CHKCB@         1S 0       COLHDG('CHECK' 'CENT')
     A            CHKYB@         2S 0       COLHDG('CHECK' 'YEAR')
     A            CHKMB@         2S 0       COLHDG('CHECK' 'MONTH')
     A            CHKDB@         2S 0       COLHDG('CHECK' 'DAY')
     A            AMOUB@         9  2       COLHDG('AMOUNT')
     A            ACCTB@         5  0       COLHDG('ORIG.' 'ACCT')
     A            NAMEB@        25          COLHDG('ACCT' 'NAME')
     A            FACTB@         1          COLHDG('FACTOR' 'CODE')
     A**********************************************************************
     A*           FLCT    -    FLEET'S INVOICE CONTROL (SINGLE ACCESS)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R FLCTFM
     A*
     A            CUSTCT        10          COLHDG('CUSTOMER' 'NAME')
     A            ACCTCT         5  0       COLHDG('BILL-TO' 'ACCOUNT#')
     A            USERCT        10          COLHDG('LOCKING' 'USER')
     A            NAMECT        33          COLHDG('SCREEN' 'HEADER')
     A            LATECT         5  0       COLHDG('MAX LATE' 'MINUTES')
     A            DATACT        10          COLHDG('DATA' 'LIBRARY')
     A            AUTOCT         1          COLHDG('AUTO' 'TRIAL/FINAL')
     A*                                        Y = LEGIBLE, OTHERWISE - NO
     A**********************************************************************
     A*           FLIN    -    FLEET'S INVOICE'S LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R FLINFM
     A*
     A            INV#IN         7  0       COLHDG('INVOICE' 'NUMBER')
     A            ACCTIN         5  0       COLHDG('BILL-TO' 'ACCOUNT#')
     A            COFFIN          L         COLHDG('CUT-OFF' 'DATE')
     A                                      DFT('0001-01-01')
     A            DATEIN          L         COLHDG('RUN' 'DATE')
     A            USERIN        10          COLHDG('RUN' 'USER')
     A            AMNTIN         9  2       COLHDG('INVOICE' 'TOTAL')
     A            PROSIN         4  0       COLHDG('NUMBER' 'OF PROS')
     A            ORDSIN         4  0       COLHDG('NUMBER' 'OF ORDERS')
     A            HUB_IN         1          COLHDG('HUB' 'FLAG')
     A*                                     H/BLANK
     A**********************************************************************
     A*           FLTX    -    FLEET'S TRAILER FIX
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R FLTXFM
     A*
     A            PRO#TX         7  0       COLHDG('PRO' 'NUMBER')
     A            ORD#TX         7  0       COLHDG('ORDER' 'NUMBER')
     A            TRL1TX         7          COLHDG('TRAILER 1')
     A            SCA1TX         4          COLHDG('SCAC 1')
     A            TRL2TX         7          COLHDG('TRAILER 2')
     A            SCA2TX         4          COLHDG('SCAC 2')
     A            USERTX        10          COLHDG('USER')
     A            DATETX          L         COLHDG('DATE')
     A                                      DFT('0001-01-01')
     A**********************************************************************
     A**********************************************************************
     A* SUSAN
     A**********************************************************************
     A*           STNH    -    NH           EDI HEADER FOR STEINMART 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R STNHFM
     A*
     A            ACRECNH        1          COLHDG('ACTIVE' 'REC CODE')
     A            EDICLNH        8          COLHDG('FED210')
     A            PRO#LNH        8          COLHDG('PRO #')
     A            APPT#NH        8          COLHDG('FED APPOINTMENT#')
     A*                                            GIVEN BY FEDERATED
     A            BLN#1NH       17          COLHDG('BILL OF LADING')
     A            BLN#2NH       17          COLHDG('BILL OF LADING')
     A            PAYCLNH        2          COLHDG('PREPAID/COLLECT')
     A            TRANMNH        2          COLHDG('TRANSPORT METHOD')
     A*                                         'T' - TRUCKLOAD
     A*                                         'LT' - LESS THAN TRUCKLOAD
     A*                                         'C' - CONSOLIDATED
     A*                                         'K' - BACKHAUL
     A            PRODLNH        8  0       COLHDG('PRO' 'DATE')
     A            TOT$LNH        9  2       COLHDG('TOTAL AMOUNT')
     A            DELDLNH        8  0       COLHDG('DELIVERY' 'DATE')
     A*                                         YYYYMMDD
     A            SHPDLNH        8  0       COLHDG('SHIPPED' 'DATE')
     A*                                         YYYYMMDD
     A            SCACLNH        4          COLHDG('SCAC')
     A*                                        NART
     A            SHIPLNH       25          COLHDG('SHIPPER NAME')
     A            SHIDLNH       10          COLHDG('ID' 'CODE')
     A*                                         FED-01
     A            SHADLNH       25          COLHDG('SHIPPER ADD1')
     A            SHCTLNH       16          COLHDG('SHIPPER CITY')
     A            SHSTLNH        2          COLHDG('SHIPPER STATE')
     A            SHZPLNH        5          COLHDG('SHIPPER ZIP')
     A            CONSLNH       25          COLHDG('CONSIGNEE NAME')
     A            COADLNH       25          COLHDG('CONSIGNEE ADD1')
     A            COCTLNH       16          COLHDG('CONSIGNEE CITY')
     A            COSTLNH        2          COLHDG('CONSIGNEE STATE')
     A            COZPLNH        5          COLHDG('CONSIGNEE ZIP')
     A            BILLLNH       25          COLHDG('BILL-TO NAME')
     A            BILALNH       25          COLHDG('BILL-TO ADD1')
     A*           BIA2LNH       25          COLHDG('CONSIGNEE ADD2')
     A            BICTLNH       16          COLHDG('BILL-TO CITY')
     A            BISTLNH        2          COLHDG('BILL-TO STATE')
     A            BIZPLNH        5          COLHDG('BILL-TO ZIP')
     A            TQTYLNH        6  0       COLHDG('TOTAL QTY')
     A            TOWGLNH        6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            MILESNH        5  0       COLHDG('MILEAGE')
     A            DELTRNH        6          COLHDG('DELIVERY' 'TRAIL#')
     A*                                     ONLY FOR T/L
     A            HOURSNH        9  2       COLHDG('HOURS')
     A**********************************************************************
     A*           STNB    -    NB           EDI HEADER FOR STEIMNART 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R STNBFM
     A*
     A            ACRECNB        1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#LNB        8          COLHDG('PRO #')
     A            QUALINB        2          COLHDG('QUALIFIER')
     A*                                         'PO' - PO#
     A*                                         'BM' - BOL#            OAD
     A            BLPO1NB       17          COLHDG('BOL#/PO#')
     A            QUANTNB        6  0       COLHDG('QUANTITY')
     A**********************************************************************
     A*           STNK    -    NK      EDI DETAIL REMARKS FOR STEINMART 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0150000 010000 01000
     A*         R STNKFM
     A*
     A            ACRENK         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#NK         8          COLHDG('PRO #')
     A            SEQNNK         1  0       COLHDG('SEQ' 'NUMBER')
     A            SEQ2NK         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L0 SEGMENT
     A            REM1NK        30          COLHDG('REMARKS #1')
     A            REM2NK        30          COLHDG('REMARKS #2')
     A**********************************************************************
     A*           STNR    -    NR      EDI (SECOND) DETAIL FOR STEINMART 210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 010000 01000
     A*         R STNRFM
     A*
     A            ACRENR         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO#NR         8          COLHDG('PRO #')
     A            SEQNNR         1  0       COLHDG('SEQ' 'NUMBER')
     A            SEQ2NR         1  0       COLHDG('SEQ' 'NUMBER2')
     A*                                      FOR THE L0 SEGMENT
     A* DETAILS OF QTY,...
     A            DESCNR        25          COLHDG('LADING' 'DESC')
     A*                                     LNT OUTBOUND CARTONS
     A            TOWGNR         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            TQTYNR         6  0       COLHDG('TOTAL QTY')
     A            RATENR         9  2       COLHDG('RATE')
     A            RATQNR         2          COLHDG('RATE' 'QUALIFIER')
     A*                                      PP = PER PCS
     A*                                      PM = PER MILE
     A*                                      FR = FLAT RATE
     A*                                      LB = PER POUND
     A*                                      MN = MINIMUM CHARGE
     A            TOT$NR         9  2       COLHDG('EXTENDED' 'AMT')
     A            TOQFNR         3          COLHDG('SPECIAL CHARGE' 'QUALIFIER')
     A*                                        FUE = FUEL SURCHARGE
     A*                                        DSC = DISCOUNT
     A            PACKNR         3          COLHDG('PACKAGING CODE')
     A**********************************************************************
     A*           BBFB    -                 BEST BUY FLEET BILLS       0
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R BBFBFM
     A*
     A            ACRECBB        1          COLHDG('ACTIVE' 'REC CODE')
     A            INVNOBB       15          COLHDG('INVOICE #')
     A            INVDTBB         L         COLHDG('INVOICE DATE')
     A                                      DFT('0001-01-01')
     A            INAMTBB        9  2       COLHDG('INVOICE AMOUNT')
     A            ACCT#BB        5  0       COLHDG('ACCOUNT #')
     A            LOCIDBB        6          COLHDG('LOCATION')
     A            EDISTBB        1          COLHDG('EDI SENT' 'STATUS')
     A            EDIDTBB         L         COLHDG('EDI' 'DATE')
     A                                      DFT('0001-01-01')
     A            EDITMBB        4  0       COLHDG('EDI' 'TIME')
     A                                      DFT(0)
     A            LOCCDBB        3          COLHDG('LOCATION' 'CODE')
     A**********************************************************************
     A*           TADT    -                 TARGET DETENTION CHGS (EDI)0
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00005
     A*         R TADTFM
     A*
     A            ARECDTD        1          COLHDG('ACTIVE' 'RECORD')
     A            PRO##TD        7  0       COLHDG('PRO #')
     A            DTAMTTD        7  2       COLHDG('DETENTION' 'AMOUNT')
     A            STATFTD        1          COLHDG('STATUS' 'FLAG')
     A            EDATETD         L         COLHDG('EDI' 'DATE')
     A                                      DFT('0001-01-01')
     A**********************************************************************
     A*           TWRK    -                 TARHET WORKFILE FOR A/R    0
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R TWRKFM
     A*
     A            PROTYTW        1          COLHDG('PRO' 'TYPE')
     A            PRO##TW        7  0       COLHDG('PRO #')
     A            MANF#TW        7  0       COLHDG('MANIFEST #')
     A            SHPDTTW         L         COLHDG('SHIP' 'DATE')
     A                                      DFT('0001-01-01')
     A            INVDTTW         L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            PROTOTW        9  2       COLHDG('PRO' 'TOTL')
     A            PROPDTW        9  2       COLHDG('PRO' 'PAID')
     A            PROONTW        9  2       COLHDG('PRO' 'OPEN')
     A            CONTOTW        9  2       COLHDG('CON' 'TOTL')
     A            CONPDTW        9  2       COLHDG('CON' 'PAID')
     A            CONONTW        9  2       COLHDG('CON' 'OPEN')
     A            CONS#TW       25          COLHDG('CONSIGNEE' 'NAME')
     A            AGE##TW        4  0       COLHDG('AGE')
     A            SCAC#TW        4          COLHDG('SCAC' 'CODE')
     A            COMMNTW       15          COLHDG('COMMENTS')
     A            WMANFTW        7  0       COLHDG('WALSH' 'MANIFEST#')
     A            WINV#TW        7  0       COLHDG('WALSH' 'INVOICE#')
     A            IMPFLTW        1          COLHDG('IMPORT' 'CODE')
     A**********************************************************************
     A*           IL8W    -            I/L CARRIER SUMMARY WORKFILE     210
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R IL8WFM
     A*
     A            ACRECI8        1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO##I8        7  0       COLHDG('PRO #')
     A            ILCODI8        4          COLHDG('I/L' 'CODE')
     A            ILAMTI8        8  2       COLHDG('I/L AMT')
     A            ILNRTI8        8  2       COLHDG('I/L NRT')
     A            ILTOTI8        8  2       COLHDG('I/L TOT')
     A**********************************************************************
     A*           ILXF IS TO REPLACE BLIL
     A**********************************************************************
     A*           ILXF      -                NRS PRO# / I/L INVOICE# X-REF
     A**********************************************************************
     * IF BELOW RECORD FORMAT LAYOUT IS CHANGED, THEN FILES ILXF01MF & ILXF02MF
     * MUST BE MANUALLY RECOMPILED INTO BLPGM.           MIKE LESIN©
      *
     * IF BELOW RECORD FORMAT LAYOUT IS CHANGED, THEN FILE ILXFSV MAST BE
     * CHANGED ACCORDINGLY TO CONTINUE TO BE A TWIN.     MIKE LESIN©
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 025000 00010
     A*         R ILXFFM
     A*
     A            ACRECF         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##F         7  0       COLHDG('NRS' 'PRO #')
     A            ILCODF         4          COLHDG('I/L' 'CARRIER')
     A            ILPROF        17          COLHDG('I/L' 'INVOICE#')
     A            ILAMTF         7  2       COLHDG('INVOICE' 'TOTAL AMOUNT')
     A            ILPAYF         7  2       COLHDG('INVOICE' 'PAID AMOUNT')
     A            ILOPNF         7  2       COLHDG('INVOICE' 'OPEN AMOUNT')
     A            ENTDTF          L         COLHDG('ENTRY' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            ENTTMF         4  0       COLHDG('ENTRY' 'TIME')
     A            ENTUSF        10          COLHDG('ENTRY' 'USER')
     A            CHGDTF          L         COLHDG('UPDATE' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            CHGTMF         4  0       COLHDG('UPDATE' 'TIME')
     A            CHGUSF        10          COLHDG('UPDATE' 'USER')
     A**********************************************************************
     A*           ILXD      -                DETAIL ADDITION TO ILXF
     A**********************************************************************
     * IF BELOW RECORD FORMAT LAYOUT IS CHANGED, THEN FILE ILXDWORK MAST
     * BE CHANGED ACCORDINGLY TO CONTINUE TO BE A TWIN.     MIKE LESIN©
      *
     * IF BELOW RECORD FORMAT LAYOUT IS CHANGED, THEN FILE ILXDSV MAST
     * BE CHANGED ACCORDINGLY TO CONTINUE TO BE A TWIN.     MIKE LESIN©
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 025000 00010
     A*         R ILXDFM
     A*
     A            ACRECXD        1          COLHDG('ACTIVE' 'CODE')
     A            PRO##XD        7  0       COLHDG('NRS' 'PRO #')
     A            ILCODXD        4          COLHDG('I/L' 'CARRIER')
     A            ILPROXD       17          COLHDG('I/L' 'INVOICE#')
     A            ILRVNXD        4          COLHDG('REVENUE' 'CODE')
     A            ILAMTXD        7  2       COLHDG('LINE' 'AMOUNT')
     A            LSTDTXD         L         COLHDG('LAST ACTION' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            LSTTMXD        4  0       COLHDG('LAST ACTION' 'TIME')
     A            LSTUSXD       10          COLHDG('LAST ACTION' 'USER')
     A**********************************************************************
     A*           ILPH IS TO REPLACE ILAP
     A**********************************************************************
     A*           ILPH      -                INTERLINE PAYMENTS HISTORY
     A**********************************************************************
     * REQUIRED MULTI-FORMAT FILE SIMILAR TO ILAP01MF
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R ILPHFM
     A*
     A            ACRECJ         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##J         7  0       COLHDG('NRS' 'PRO #')
     A            ILCODJ         4          COLHDG('I/L' 'CARRIER')
     A            ILPROJ        17          COLHDG('I/L' 'INVOICE#')
     A            TRNDTJ          L         COLHDG('TRANS' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            AMOUNJ         7  2       COLHDG('AMOUNT' 'PAID')
     A            VOUCHJ         7  0       COLHDG('VOUCHER#')
     A**********************************************************************
     A*           ILNM      -                INTERLINE PAYMENTS AUTH LIST
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R ILNMFM
     A*
     A            ACRENM         1          COLHDG('ACTIVE' 'CODE')
     A*                                     'Y' - SIGN TO RUN AND JUMP OVER 115%
     A*                                     ' ' - SIGN TO RUN ONLY
     A            USERNM        10          COLHDG('USER' 'PROFILE')
     A**********************************************************************
     A*           BBXA      -                BEST BUY DC'S FIXED ALLOC TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXAFM
     A*
     A            ACRENBA        1          COLHDG('ACTIVE' 'CODE')
     A            DCNAMBA       15          COLHDG('DC NAME')
     A            FORE_BA        1          COLHDG('FIXED/EXTRA')
     A*                                       F=FIXED
     A*                                       E=EXTRA
     A*                                       S=SWITCHING
     A*                                       X=FIXED SERVICES
     A            BBYCDBA        6          COLHDG('BBY' 'CODE')
     A            NOUOMBA        6  2       COLHDG('NUMBER' 'OF UOMS')
     A**********************************************************************
     A*           BBXB      -                BEST BUY LOCATIONS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXBFM
     A*
     A            ACRENBB        1          COLHDG('ACTIVE' 'CODE')
     A            LOCATBB        6          COLHDG('BB LOCATION' 'CODE')
     A**********************************************************************
     A*           BBXC      -                BEST BUY NON-NUMERIC DC CONVERSION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXCFM
     A*
     A            ACRENBC        1          COLHDG('ACTIVE' 'CODE')
     A            DCCODBC        6          COLHDG('DC CODE')
     A            ACCT#BC        5  0       COLHDG('BILL-TO')
     A            DCNUMBC        4          COLHDG('NUMBER')
     A**********************************************************************
     A*           BBXD      -                BEST BUY DC'S TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXDFM
     A*
     A            ACRENBD        1          COLHDG('ACTIVE' 'CODE')
     A            DCNAMBD       15          COLHDG('DC NAME')
     A            FORE_BD        1          COLHDG('FIXED/EXTRA')
     A*                                       F=FIXED
     A*                                       E=EXTRA
     A*                                       X=FIXED SERVICES
     A            ACCT#BD        5  0       COLHDG('BILL-TO')
     A            LOCCDBD        6          COLHDG('DC' 'LOCATION' 'CODE')
     A**********************************************************************
     A*           BBXE      -                BEST BUY EXPENCE TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXEFM
     A*
     A            ACRENBE        1          COLHDG('ACTIVE' 'CODE')
     A            FORE_BE        1          COLHDG('FIXED/EXTRA')
     A*                                       F=FIXED
     A*                                       E=EXTRA
     A*                                       X=FIXED SERVICES
     A            BBYCDBE        6          COLHDG('BBY' 'CODE')
     A            DESCRBE       25          COLHDG('DESCRIPTION')
     A            AMNT$BE        7  2       COLHDG('AMOUNT' 'PER UOM')
     A            EXPDTBE        8  0       COLHDG('EXP' 'DATE')
     A            NRSCDBE        4          COLHDG('NRS' 'CODE')
     A            MANUABE        1          COLHDG('MANUAL' 'RATE ENTRY')
     A*                                       Y-ALLOWED, OTHERWISE NO
     A            ACCT#BE        5  0       COLHDG('BILL-TO')
     A**********************************************************************
     A*           BBXF      -                BEST BUY CARRIER CONVERSION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXFFM
     A*
     A            ACRENBF        1          COLHDG('ACTIVE' 'CODE')
     A            OL5CDBF        6          COLHDG('OL5' 'CODE')
     A            BBYCDBF        6          COLHDG('BBY' 'CODE')
     A**********************************************************************
     A*           BBXG      -                PRIMARY/SECONDARY ACCOUNT X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXGFM
     A*
     A            ACRENBG        1          COLHDG('ACTIVE' 'CODE')
     A            FORE_BG        1          COLHDG('CHARGES' 'ID')
     A            PRMACBG        5  0       COLHDG('PRIMARY' 'ACCOUNT')
     A            SECACBG        5  0       COLHDG('SECONDARY' 'ACCOUNT')
     A**********************************************************************
     A*           BBXM      -                BEST BUY SERVICE EXCEPTIONS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXMFM
     A*
     A            ACRENBM        1          COLHDG('ACTIVE' 'CODE')
     A            VALUEBM        6          COLHDG('SEARCH' 'VALUE')
     A            SRVCEBM        4          COLHDG('BBY' 'SERVICE')
     A**********************************************************************
     A*           BBXP      -                BEST BUY PRO SPREADSHEET
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXPFM
     A*
     A            ACRENBP        1          COLHDG('ACTIVE' 'CODE')
     A            PRO##BP        7  0       COLHDG('PRO#')
     A            ACCT#BP        5  0       COLHDG('BILL-TO')
     A            WKENDBP         L         COLHDG('WEEK' 'END')
     A                                      DFT('0001-01-01')
     A            FORE_BP        1          COLHDG('FIXED/EXTRA')
     A*                                       F=FIXED
     A*                                       E=EXTRA
     A*                                       S=SWITCHING
     A*                                       X=FIXED SERVICES
     A            DCNAMBP       15          COLHDG('DC NAME')
     A            BBYCDBP        6          COLHDG('BBY' 'CODE')
     A            DESCRBP       25          COLHDG('DESCRIPTION')
     A            NRSCDBP        4          COLHDG('NRS' 'CODE')
     A            AMNT$BP        7  2       COLHDG('AMOUNT' 'PER UOM')
     A            NOUOMBP        6  2       COLHDG('NUMBER' 'OF UOMS')
     A            TOTALBP        9  2       COLHDG('TOTAL' 'AMOUNT')
     A            DATE_BP         L         COLHDG('ADDED' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIME_BP        4  0       COLHDG('ADDED' 'TIME')
     A            USER_BP       10          COLHDG('ADDED' 'USER')
     A**********************************************************************
     A*           BBXQ      -                BEST BUY PRO SPREADSHEET
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXQFM
     A*
     A            ACRENBQ        1          COLHDG('ACTIVE' 'CODE')
     A            INV#_BQ        7  0       COLHDG('INVOICE#')
     A            INVDTBQ         L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            ACCT#BQ        5  0       COLHDG('BILL-TO')
     A            NRSCDBQ        4          COLHDG('NRS' 'CODE')
     A            BKGTRBQ        4          COLHDG('BKG' 'TERMINAL')
     A            SMPROBQ        7  0       COLHDG('SUMMARY' 'PRO#')
     A            DTPROBQ        7  0       COLHDG('DETAIL' 'PRO#')
     A            RATE$BQ        9  2       COLHDG('RATE')
     A            ORDR#BQ        7  0       COLHDG('ORDER#')
     A            ROUTEBQ       84          COLHDG('DELIVERY' 'STORES')
     A            EVENTBQ       14          COLHDG('EVENT' 'PER' 'STOP')
     A            DATE_BQ         L         COLHDG('ADDED' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIME_BQ        4  0       COLHDG('ADDED' 'TIME')
     A            USER_BQ       10          COLHDG('ADDED' 'USER')
     A**********************************************************************
     A*           BBXS      -                BEST BUY SWITCHING EXPENCE TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXSFM
     A*
     A            ACRENBS        1          COLHDG('ACTIVE' 'CODE')
     A            ACCT#BS        5  0       COLHDG('BILL-TO')
     A            BBYCDBS        6          COLHDG('BBY' 'CODE')
     A            DESCRBS       25          COLHDG('DESCRIPTION')
     A            AMNT$BS        7  2       COLHDG('AMOUNT' 'PER UOM')
     A            EXPDTBS        8  0       COLHDG('EXP' 'DATE')
     A            NRSCDBS        4          COLHDG('NRS' 'CODE')
     A            MANUABS        1          COLHDG('MANUAL' 'RATE ENTRY')
     A*                                       Y-ALLOWED, OTHERWISE NO
     A**********************************************************************
     A*           BBXT      -                BEST BUY CODE CONVERSION TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXTFM
     A*
     A            ACRENBT        1          COLHDG('ACTIVE' 'CODE')
     A            NRSCDBT        4          COLHDG('NRS' 'CODE')
     A            BBYCDBT        6          COLHDG('BBY' 'CODE')
     A            DESCRBT       25          COLHDG('DESCRIPTION')
     A**********************************************************************
     A*           BBXU      -                BEST BUY EXCEPT ACCESSOR RATES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXUFM
     A*
     A            ACRENBU        1          COLHDG('ACTIVE' 'CODE')
     A            BILTOBU        5  0       COLHDG('ACCOUNT')
     A            FLAG_BU        1          COLHDG('F/E/S...')
     A            DCNAMBU       15          COLHDG('DC NAME')
     A            BBYCDBU        6          COLHDG('BBY' 'CODE')
     A            NRSCDBU        4          COLHDG('NRS' 'CODE')
     A            AMNT$BU        7  2       COLHDG('AMOUNT' 'PER UOM')
     A**********************************************************************
     A*           BBXV      -                BEST BUY DC NAME/DC CODE X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXVFM
     A*
     A            ACRENBV        1          COLHDG('ACTIVE' 'CODE')
     A            DCNAMBV       15          COLHDG('DC NAME')
     A            DCCDEBV        6          COLHDG('DC LOCATION' 'CODE')
     A**********************************************************************
     A*           BBXW      -                BEST BUY BILL-TO/DC CODE X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXWFM
     A*
     A            ACRENBW        1          COLHDG('ACTIVE' 'CODE')
     A            BLLTOBW        5  0       COLHDG('BILL-TO' 'ACCOUNT')
     A            DCCDEBW        6          COLHDG('DC LOCATION' 'CODE')
     A**********************************************************************
     A*           BBXX      -                BEST BUY EXTENTION FOR FLCT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXXFM
     A*
     A            ACRENBX        1          COLHDG('ACTIVE' 'CODE')
     A*                                      "I" = INACTIVE (IGNORE)
     A*                                      "A" = ACCESSORIAL
     A*                                      " " = REGULAR
     A*                                      "X" = EXCLUDE FROM BILLING REPORT
     A            ACCT#BX        5  0       COLHDG('BILL-TO' 'ACCOUNT')
     A            SUFIXBX        4          COLHDG('BUSINESS' 'UNIT')
     A            WORE_BX        1          COLHDG('FLEET' 'ID')
     A*                                       E = EAST COAST
     A*                                       W = WEST COAST
     A            DCCDEBX        6          COLHDG('DC LOCATION' 'CODE')
     A            TERM_BX        4          COLHDG('TERMINAL' 'CODE')
     A**********************************************************************
     A*           BBXY      -                BEST BUY RATES & EXP DATE
     A*           LGXY      -                LG       RATES & EXP DATE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXYFM
     A*
     A            ACRENBY        1          COLHDG('ACTIVE' 'CODE')
     A            DMC$$BY        6  3       COLHDG('DMC' 'RATE')
     A            FSC$$BY        4          COLHDG('FSC' 'PROFILE')
     A            STOP$BY        6  3       COLHDG('STOP' 'RATE')
     A            DETN$BY        6  3       COLHDG('DETN' 'RATE')
     A            DETN#BY        2  0       COLHDG('DETN' 'UOM' 'MINUTES')
     A*                                       USUALLY 15 (MINUTES)
     A            DETN@BY        1          COLHDG('DETN' 'RATE' 'FLAG')
     A*                                       (IF DETN#BY = 15 MINUTES)
     A*                                       H = HALF ADJUST (38 MINS = 45)
     A*                                       T = TRANCATE    (38 MINS = 30)
     A            EXPDTBY        8  0       COLHDG('EXP' 'DATE')
     A            LAYMNBY        9  2       COLHDG('CONVERT TO' 'LAYOVER IF')
     A            LAY$$BY        9  2       COLHDG('LAYOVER' 'RATE')
     A*
     A            FREMNBY        3  0       COLHDG('FREE TIME' 'AT STOP')
     A*                                        IN MINUTES
     A            LATMNBY        5  0       COLHDG('MAX' 'LATE' 'MINUTES')
     A*                                        IN MINUTES
     A* NOT FOR LGXY... (ML 11/10/21)
     A            PLAYMNBY       9  2       COLHDG('CONVERT TO' 'PEAK LAYOVER')
     A            PLAY$$BY       9  2       COLHDG('PEAK LAYOVER' 'RATE')
     A            PLAYFRBY       4  0       COLHDG('PEAK LAYOVER' 'FROM MMDD')
     A            PLAYTOBY       4  0       COLHDG('PEAK LAYOVER' 'TO MMDD')
     A            PLAYDTBY        L         COLHDG('LAYOVER' 'UPDATE DATE')
     A                                      DFT('0001-01-01')
     A            PLAYTMBY       4  0       COLHDG('LAYOVER' 'UPDATE TIME')
     A            PLAYUSBY      10          COLHDG('LAYOVER' 'UPDATE USER')
     A**********************************************************************
     A*           BBXZ      -                BEST BUY BILLING RPT LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R BBXZFM
     A*
     A            ACRENBZ        1          COLHDG('ACTIVE' 'CODE')
     A            WKENDBZ         L         COLHDG('WEEK' 'END')
     A                                      DFT('0001-01-01')
     A            CONTRBZ        1          COLHDG('TRIAL' 'FINAL')
     A*                                       T = TRIAL
     A*                                       F = FINAL
     A            AMOUNBZ        9  2       COLHDG('TOTAL' 'AMOUNT')
     A            WORE_BZ        1          COLHDG('FLEET' 'ID')
     A*                                       E = EAST COAST
     A*                                       W = WEST COAST
     A**********************************************************************
     A*           AIHD      -                AIRBILL INTERLINE LIABILITY HDR
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R AIHDFM
     A*
     A            ACRENAH        1          COLHDG('ACTIVE' 'CODE')
     A            CARCDAH        4          COLHDG('CARRIER' 'SCAC')
     A            BILDTAH         L         COLHDG('BILLING' 'DATE')
     A                                      DFT('0001-01-01')
     A            SUMBLAH       17          COLHDG('SUMMARY' 'BILL')
     A            TOTALAH        9  2       COLHDG('BILLED' 'AMOUNT')
     A            EDATEAH         L         COLHDG('ENTRY' 'DATE')
     A                                      DFT('0001-01-01')
     A            ETIMEAH        4  0       COLHDG('ENTRY' 'TIME')
     A            EUSERAH       10          COLHDG('ENTRY' 'USER')
     A            VOUCHAH        7  0       COLHDG('VOUCHER #')
     A**********************************************************************
     A*           AID1      -                AIRBILL INTERLINE LIABILITY DTL1
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R AID1FM
     A*
     A            ACRENA1        1          COLHDG('ACTIVE' 'CODE')
     A            CARCDA1        4          COLHDG('CARRIER' 'SCAC')
     A            BILDTA1         L         COLHDG('BILLING' 'DATE')
     A                                      DFT('0001-01-01')
     A            SUMBLA1       17          COLHDG('SUMMARY' 'BILL')
     A            MANF#A1        7  0       COLHDG('MANIFEST #')
     A            BOL##A1        7  0       COLHDG('BOL #')
     A            INV##A1       17          COLHDG('INVOICE #')
     A            SHPDTA1         L         COLHDG('SHIP' 'DATE')
     A                                      DFT('0001-01-01')
     A            REF##A1       17          COLHDG('CUSTOMER' 'REF #')
     A            AMNT$A1        9  2       COLHDG('MANF/BOL' 'AMOUNT')
     A**********************************************************************
     A*           AID2      -                AIRBILL INTERLINE LIABILITY DTL2
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 020000 00010
     A*         R AID2FM
     A*
     A            ACRENA2        1          COLHDG('ACTIVE' 'CODE')
     A            CARCDA2        4          COLHDG('CARRIER' 'SCAC')
     A            BILDTA2         L         COLHDG('BILLING' 'DATE')
     A                                      DFT('0001-01-01')
     A            SUMBLA2       17          COLHDG('SUMMARY' 'BILL')
     A            MANF#A2        7  0       COLHDG('MANIFEST #')
     A            BOL##A2        7  0       COLHDG('BOL #')
     A            PRO##A2        7  0       COLHDG('PRO #')
     A            WEIGTA2        7  2       COLHDG('WEIGHT')
     A            AMNT$A2        9  2       COLHDG('PRO' 'AMOUNT')
     A*
     A**********************************************************************
     A*           CQHT      -                SALESMAN QTR COMM HISTORY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   2000000 020000 00010
     A*         R CQHTFM
     A*
     A            SLS#QH         5  0       COLHDG('SALEMANS' 'CODE')
     A            COMPQH         3          COLHDG('COMPANY' 'CODE')
     A            PRO#QH         7  0       COLHDG('PRO #')
     A            DESCQH         4          COLHDG('STANDARD' 'DESCR.')
     A            DAMTQH         9  2       COLHDG('PRO DTL' 'AMOUNT')
     A            TDATQH          L         COLHDG('TRANSACTION' 'DATE')
     A                                      DFT('0001-01-01')
     A            PDATQH          L         COLHDG('PRO DATE')
     A                                      DFT('0001-01-01')
     A            FDATQH          L         COLHDG('FIRST' 'PRO DATE')
     A                                      DFT('0001-01-01')
     A            PERCQH         8  5       COLHDG('COMM' 'PERCENT')
     A            ACCTQH         5  0       COLHDG('ACCOUNT#')
     A*
     A**********************************************************************
     A*           CQWK      -                SALESMAN QTR COMM WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CQWKFM
     A*
     A            SLS#QW         5  0       COLHDG('SALEMANS' 'CODE')
     A            COMPQW         3          COLHDG('COMPANY' 'CODE')
     A            ACCTQW         5  0       COLHDG('ACCOUNT#')
     A            PRO1QW          L         COLHDG('FIRST' 'PRO DATE')
     A                                      DFT('0001-01-01')
     A            PERCQW         8  5       COLHDG('COMM' 'PERCENT')
     A            TAMTQW        10  2       COLHDG('TOTAL' 'AMOUNT')
     A            CAMTQW        10  2       COLHDG('COMMISSION' 'AMOUNT')
     A*
     A**********************************************************************
     A*           CSCM      -                COMMENT FILE FOR BLPGM/CUST
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R CSCMFM
     A*
     A            ACCT#UC        5  0       COLHDG('ACCOUNT' 'NUMBER')
     A            ADDDTUC         L         COLHDG('ADD' 'DATE')
     A                                      DFT('0001-01-01')
     A            ADDTMUC        6  0       COLHDG('ADD' 'TIME')
     A            ADDUSUC       10          COLHDG('ADD' 'USER')
     A            SEQ##UC        3  0       COLHDG('LINE' 'SEQ#')
     A            CMTYPUC        1          COLHDG('COMMENT' 'TYPE')
     A*                                       TBD
     A            COMMTUC       45          COLHDG('COMMENT')
     A            UPDDTUC         L         COLHDG('UPD' 'DATE')
     A                                      DFT('0001-01-01')
     A            UPDTMUC        6  0       COLHDG('UPD' 'TIME')
     A            UPDUSUC       10          COLHDG('UPD' 'USER')
     A*
     A*
     A**********************************************************************
     A*           CSWK      -                DAILY CASH REPORT WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 000100 00010
     A*         R CSWKFM
     A*
     A            COMPCS         3          COLHDG('COMPANY' 'CODE')
     A            ACCTCS         5  0       COLHDG('ACCOUNT#')
     A            NAMECS        25          COLHDG('CUSTOMER NAME')
     A            GRUPCS         2          COLHDG('GROUP CODE')
     A            DATECS          L         COLHDG('DATE')
     A                                      DFT('0001-01-01')
     A            AMNTCS        10  2       COLHDG('CASH AMOUNT')
     A*
     A**********************************************************************
     A*           ILEX      -                EXCLUDE PRO FROM I/L PAYMENT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R ILEXFM
     A*
     A            PRO#IX         7  0       COLHDG('PRO' 'NUMBER')
     A            PRDTIX          L         COLHDG('PRO' 'DATE')
     A                                      DFT('0001-01-01')
     A            DATEIX          L         COLHDG('DATE')
     A                                      DFT('0001-01-01')
     A            TIMEIX         4  0       COLHDG('TIME')
     A            USERIX        10          COLHDG('USER')
     A**********************************************************************
     A*           MGHS      -                MERCURY GATE RECONCILIATION HISTORY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R MGHSFM
     A*
     A            PRO#MG         7  0       COLHDG('PRO' 'NUMBER')
     A            COMPMG         3          COLHDG('PRO' 'COMPANY')
     A            TPIDMG        15          COLHDG('EDI' 'TRADING' 'PARTNER')
     A            MBOXMG        10          COLHDG('EDI' 'MAIL' 'BOX')
     A            NUMBMG         7  0       COLHDG('ORDER' 'OR' 'PICKUP')
     A            OORPMG         1          COLHDG('O' 'OR' 'P')
     A*                                       O=ORDER
     A*                                       P=PICKUP
     A            ERR_MG         1          COLHDG('NUMBER' 'ERROR')
     A*                                       Y=INVALID/CANCELLED ORDER/PICKUP
     A            MG$$MG         9  2       COLHDG('MG' 'RATING')
     A            ACC$MG         9  2       COLHDG('STRIPPED' 'ACCESSORIAL')
     A            NRSBMG         9  2       COLHDG('NRS' 'RATING' 'BEFORE')
     A            NRSAMG         9  2       COLHDG('NRS' 'RATING' 'AFTER')
     A            USERMG        10          COLHDG('RECONCILIATION' 'USER')
     A            DATEMG          L         COLHDG('RECONCILIATION' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIMEMG         4  0       COLHDG('RECONCILIATION' 'TIME')
     A**********************************************************************
     * COMPANY WIDE - MUST RESIDE IN BLPGM
     A*           BDED      -               BILLING DEFICIENCY EDI STATUS CHANGE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R BDEDFM
     A*
     A            ACRCBD         1          COLHDG('RECORD' 'STATUS')
     A            PRO#BD         7  0       COLHDG('PRO' 'NUMBER')
     A            COMPBD         3          COLHDG('PRO' 'COMPANY')
     A            BLTOBD         5  0       COLHDG('BILL-TO' 'ACCOUNT')
     A            USERBD        10          COLHDG('USER')
     A            DATEBD          L         COLHDG('DATE') DFT('0001-01-01')
     A            TIMEBD         4  0       COLHDG('TIME')
     A            OPN$BD         9  2       COLHDG('OPEN AMOUNT' 'AT BD STAT')
     A            BDDTBD          L         COLHDG('BD STAT' 'DATE')
     A                                      DFT('0001-01-01')
     A            BDTMBD         4  0       COLHDG('BD STAT' 'TIME')
     A**********************************************************************
     A*           ETJN    -    TN      EDI HEADER REMARKS FOR TJMAX 210
     A*                                 (PF FILE IS ETJN_210)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0150000 010000 01000
     A*         R ETJN9FM
     A*
     A            PRO#TN         8          COLHDG('PRO #')
     A            SEQNTN         1  0       COLHDG('SEQ' 'NUMBER')
     A            REFQTN         3          COLHDG('REF#' 'QUALIFIER')
     A            REF#TN        30          COLHDG('REF#')
     A**********************************************************************
     * COMPANY WIDE - MUST RESIDE IN BLPGM
     A*           UPDN      -               UPSIDE DOWN PROS REPORT DISTRO
     A*           MILI      -               MISSED I/L INVOICES DISTRO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R UPDNFM
     A*
     A            ACRCUD         1          COLHDG('RECORD' 'STATUS')
     A            SEQ#UD         3  0       COLHDG('SEQUENCE' 'NUMBER')
05/12A            USERUD       100          COLHDG('UP TO' '10 USERS')
     A            TERMUD        40          COLHDG('UP TO' '10 TERMINALS')
     A            MIN$UD        11  2       COLHDG('MIN' 'DIFFERENCE')
     A**********************************************************************
     A*           TJXI      -               TJX FLEET INVOICING TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R TJXIFM
     A*
     A            ACRCTI         1          COLHDG('RECORD' 'STATUS')
     A            ACT#TI         5  0       COLHDG('ACCOUNT#')
     A            WORETI         1          COLHDG('WEST/EAST' 'COAST')
     A            FORBTI         1          COLHDG('F/H / B/H')
     A            PRNTTI         1          COLHDG('PRINT' 'PROS')
     A            ACTNTI         3          COLHDG('BACT' 'ACTION' 'CODE')
     A**********************************************************************
     A*           BBAM      -               BEST BUY MATCH AFTER THE FACT LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R BBAMFM
     A*
     A            ACRCAM         1          COLHDG('RECORD' 'STATUS')
     A            WEEKAM          L         COLHDG('W/END') DFT('0001-01-01')
     A            TYPEAM         1  0       COLHDG('TYPE')
     A            BPROAM         7  0       COLHDG('B/H' 'PRO')
     A            BORDAM         7  0       COLHDG('B/H' 'ORDER')
     A            BACTAM         5  0       COLHDG('B/H' 'ACCOUNT#')
     A            FPROAM         7  0       COLHDG('F/H' 'PRO')
     A            FORDAM         7  0       COLHDG('F/H' 'ORDER')
     A            FACTAM         5  0       COLHDG('F/H' 'ACCOUNT#')
     A            TERMAM         4          COLHDG('TERMINAL')
     A            TRIPAM         7  0       COLHDG('TRIP#')
     A            OLD$AM         9  2       COLHDG('B/H' 'OLD' 'TOTAL')
     A            DISCAM         9  2       COLHDG('B/H' 'CALC' 'DISCOUNT')
     A            NEW$AM         9  2       COLHDG('B/H' 'NEW TOTAL')
     A            POSTAM         9  2       COLHDG('B/H' 'POSTED' 'DISCOUNT')
     A            EXCLAM         1          COLHDG('EXCLUDED' 'BY USER')
     A*                                       Y=YES
     A            USERAM        10          COLHDG('USER')
     A            DATEAM          L         COLHDG('DATE') DFT('0001-01-01')
     A            TIMEAM         4  0       COLHDG('TIME')
     A**********************************************************************
     A*           BLEX      -               MONTHLY PRO EXCEPTION REGISTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R BLEXFM
     A*
     A            ACRECEX        1          COLHDG('RECORD' 'CODE')
     A            PRO##EX        7  0       COLHDG('PRO #')
     A            PDATEEX         L         COLHDG('PRO DATE')
     A                                      DFT('0001-01-01')
     A            ACCT#EX        5  0       COLHDG('ACCOUNT#')
     A            SHIPNEX       25          COLHDG('SHIPPER NAME')
     A            CONSNEX       25          COLHDG('CONSIGNEE NAME')
     A            SDESCEX        4          COLHDG('STANDARD' 'DESCR / TYPE')
     A            TOQTYEX        6  0       COLHDG('TOTAL QTY')
     A            WGTACEX        5  0       COLHDG('WEIGHT' 'ACTUAL')
     A            RATESEX        6  3       COLHDG('RATE')
     A            TOTALEX        9  2       COLHDG('TOTAL AMOUNT')
     A            MOVE1EX        7  0       COLHDG('MANIFEST#' 'MOVE#')
     A            ORICCEX        4          COLHDG('ORIGIN CC' 'TERM')
     A            RDATEEX         L         COLHDG('RUN DATE')
     A                                      DFT('0001-01-01')
     A            RTIMEEX         T         COLHDG('RUN TIME')
     A                                      DFT('00.00.00')
     A**********************************************************************
     A*           BLSJ      -               SALES JOURNAL WORK FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R BLSJFM
     A*
     A            ACRECSJ        1          COLHDG('RECORD' 'CODE')
     A            OPRO#SJ        7  0       COLHDG('ORIGINAL PRO #')
     A            PDATESJ         L         COLHDG('PRO DATE')
     A                                      DFT('0001-01-01')
     A            ADATESJ         L         COLHDG('ADJ DATE')
     A                                      DFT('0001-01-01')
     A            EFFECSJ        1          COLHDG('AREA OF EFFECT')
     A            REACDSJ        1          COLHDG('REASON CODE')
     A            OACCTSJ        5  0       COLHDG('ORIGINAL ACCT#')
     A            NACCTSJ        5  0       COLHDG('NEW ACCT#')
     A            NAMT$SJ        9  2       COLHDG('NEW AMT')
     A            OAMT$SJ        9  2       COLHDG('ORIGINAL AMT')
     A            CNET$SJ        9  2       COLHDG('CURRENT' 'NET AMOUNT')
     A            PNET$SJ        9  2       COLHDG('PREV.MO.' 'NET AMOUNT')
     A            RDATESJ         L         COLHDG('RUN DATE')
     A                                      DFT('0001-01-01')
     A            RTIMESJ         T         COLHDG('RUN TIME')
     A                                      DFT('00.00.00')
     A**********************************************************************
     A*           BLPR      -               MONTLY PRO REGISTER WORK FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R BLPRFM
     A*
     A            ACRECPR        1          COLHDG('RECORD' 'CODE')
     A            PRO##PR        7  0       COLHDG('PRO #')
     A            PDATEPR         L         COLHDG('PRO DATE')
     A                                      DFT('0001-01-01')
     A            ACCT#PR        5  0       COLHDG('ACCOUNT #')
     A            SHIPNPR       25          COLHDG('SHIPPER NAME')
     A            CONSNPR       25          COLHDG('CONSIGNEE NAME')
     A            CONS#PR        5  0       COLHDG('CONSIGNEE #')
     A            TYPETPR        4          COLHDG('TYPE' 'STANDARD' 'DESCR')
     A            TOQTYPR        6  0       COLHDG('TOTAL QTY')
     A            ACWGTPR        6  0       COLHDG('ACTUAL' 'WEIGHT')
     A            RATE$PR        6  3       COLHDG('RATE')
     A            TOTALPR        9  2       COLHDG('TOTAL AMOUNT')
     A            ORIGNPR        4          COLHDG('ORIGIN')
     A            DESTNPR        4          COLHDG('DESTINATION')
     A            RDATEPR         L         COLHDG('RUN DATE')
     A                                      DFT('0001-01-01')
     A            RTIMEPR         T         COLHDG('RUN TIME')
     A                                      DFT('00.00.00')
     A**********************************************************************
     A*           ILHS      -               SUBMISSION OF I/L VOUCHERS LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R ILHSFM
     A*
     A            STATXX         1          COLHDG('RECORD' 'STATUS')
     A            POSTXX         1          COLHDG('POST INTO' 'LAWSON Y/N')
     A            COMPXX         3          COLHDG('COMPANY' 'CODE')
     A            SCACXX         4          COLHDG('CARRIER' 'SCAC CODE')
     A            SIGNXX        10          COLHDG('RECORDS' 'SIGNATURE')
     A            USERXX        10          COLHDG('SUBMITTER')
     A            DATEXX          L         COLHDG('SUBMIT' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIMEXX          T         COLHDG('SUBMIT' 'TIME')
     A                                      DFT('00.00.00')
     A**********************************************************************
     A*           TJDB      -               TJX DIFFERENTIAL BILLING SETUP
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R TJDBFM
     A*
     A            STATDB         1          COLHDG('RECORD' 'STATUS')
     A            WHATDB         6          COLHDG('SEGMENT' 'ID')
     A            VALUDB        15          COLHDG('VALUE')
     A            DEFIDB        10          COLHDG('DEFINITION')
     A            ADDUDB        10          COLHDG('ADD' 'USER')
     A            ADDDDB          L         COLHDG('ADD' 'DATE')
     A                                      DFT('0001-01-01')
     A            ADDTDB          T         COLHDG('ADD' 'TIME')
     A                                      DFT('00.00.00')
     A            UPDUDB        10          COLHDG('UPDATE' 'USER')
     A            UPDDDB          L         COLHDG('UPDATE' 'DATE')
     A                                      DFT('0001-01-01')
     A            UPDTDB          T         COLHDG('UPDATE' 'TIME')
     A                                      DFT('00.00.00')
     A**********************************************************************
     A*           TJD$      -               TJX DIFFERENTIAL BILLING LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R TJD$FM
     A*
     A            STATD$         1          COLHDG('RECORD' 'STATUS')
     A            COASD$         1          COLHDG('COAST' 'W/E')
     A            SCACD$         4          COLHDG('I/L' 'CARRIER')
     A            INV#D$        17          COLHDG('I/L' 'INVOICE#')
     A            INV$D$         7  2       COLHDG('I/L' 'TOTAL AMOUNT')
     A            LAWDD$          L         COLHDG('POSTED IN LAWSON' 'DATE')
     A                                      DFT('0001-01-01')
     A            PRO#D$         7  0       COLHDG('DETAIL' 'PRO#')
     A            PRO$D$         9  2       COLHDG('PRO' 'TOTAL AMOUNT')
     A            ADJ$D$         7  2       COLHDG('I/L' 'ADJUSTED AMOUNT')
     A            DIFFD$         9  2       COLHDG('BILLABLE' 'DIFFERENCE')
     A            PRODD$          L         COLHDG('PROCESSED' 'DATE')
     A                                      DFT('0001-01-01')
     A            PROTD$         4  0       COLHDG('PROCESSED' 'TIME')
     A            SPROD$         7  0       COLHDG('SUMMARY' 'PRO')
     A            SUMDD$          L         COLHDG('SUMMARY' 'DATE')
     A                                      DFT('0001-01-01')
     A            SUMTD$         4  0       COLHDG('SUMMARY' 'TIME')
     A            MKUPD$         3  2       COLHDG('MARKUP' '%')
     A            ADFED$         3  2       COLHDG('ADM FEE' '%')
     A**********************************************************************
     A*           EDIH      -               EDI REQUIREMENTS HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R EDIHFM
     A*
     A            STATRH         1          COLHDG('RECORD' 'STATUS')
     A            COMPRH         4          COLHDG('COMPANY')
     A            ACCTRH         5  0       COLHDG('ACCOUNT#')
     A            EDI#RH         3          COLHDG('EDI' 'DOCIMENT')
     A            DATERH          L         COLHDG('DATE') DFT('0001-01-01')
     A            TIMERH         4  0       COLHDG('TIME')
     A            USERRH        10          COLHDG('USER')
     A**********************************************************************
     A*           EDID      -               EDI REQUIREMENTS DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R EDIDFM
     A*
     A            CTATRD         1          COLHDG('RECORD' 'STATUS')
     A            COMPRD         4          COLHDG('COMPANY')
     A            ACCTRD         5  0       COLHDG('ACCOUNT#')
     A            EDI#RD         3          COLHDG('EDI' 'DOCIMENT')
     A            LINERD         5  0       COLHDG('LINE#')
     A            DATARD        79          COLHDG('FREE' 'FORMAT')
     A**********************************************************************
     A*           CH3P      -               3-RD PARTY I/L CHASSIS CHARGES LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R CH3PFM
     A*
     A            COST3CH        1          COLHDG('COAST')
     A            PRO#3CH        7  0       COLHDG('DRAYAGE' 'PRO#')
     A            PRDT3CH         L         COLHDG('DRAYAGE' 'PRO DATE')
     A                                      DFT('0001-01-01')
     A            CONT3CH       11          COLHDG('CONTAINER#')
     A            CHAS3CH       11          COLHDG('CHASSIS#')
     A            SCAC3CH        4          COLHDG('CARRIER' 'SCAC')
     A            INV#3CH       17          COLHDG('CARRIER' 'INVOICE#')
     A            VDAT3CH         L         COLHDG('VOUCHER' 'DATE')
     A                                      DFT('0001-01-01')
     A            INV$3CH        7  2       COLHDG('INVOICE' 'AMOUNT')
     A            BLD$3CH        9  2       COLHDG('BILLED' 'AMOUNT')
     A            SUM#3CH        7  0       COLHDG('SUMMARY' 'PRO#')
     A            SMDT3CH         L         COLHDG('SUMMARY' 'PRO DATE')
     A                                      DFT('0001-01-01')
     A            MKUP3CH        3  2       COLHDG('MARKUP' '%')
     A            ADFE3CH        3  2       COLHDG('ADM FEE' '%')
     A**********************************************************************
     A*           MDLA      -               MEDLINE ACCESSORIAL PROS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00010
     A*         R MDLAFM
     A*
     A            STATMDL        1          COLHDG('RECORD' 'STATUS')
     A            PRO#MDL        7  0       COLHDG('PRO#')
     A            PRODMDL         L         COLHDG('PRO' 'DATE')
     A                                      DFT('0001-01-01')
     A            DESCMDL        4          COLHDG('SHORT' 'DESCRIPTION')
     A            QTY_MDL        9  3       COLHDG('QUANTITY' 'OF UOMS')
     A********    DAYSMDL        6  2       COLHDG('NUMBER' 'OF DAYS')
     A********    HOURMDL        6  2       COLHDG('NUMBER' 'OF HOURS')
     A            RATEMDL        7  3       COLHDG('RATE' 'PER UOM')
     A            TOTLMDL        9  2       COLHDG('LINE' 'AMOUNT')
     A            USERMDL       10          COLHDG('PROCESS' 'USER')
     A            DATEMDL         L         COLHDG('PROCESS' 'DATE')
     A                                      DFT('0001-01-01')
     A**********************************************************************
     A*           VHWK      -               VOUCHER FOR RESOLVING OVERPAYMENTS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000500 00010
     A*         R VHWKFM
     A*
     A            ACCTVK         5  0       COLHDG('ACCOUNT#')
     A            PRO#VK         7  0       COLHDG('PRO#')
     A            CHEKVK         6  0       COLHDG('CHECK#')
     A            REF#VK        10          COLHDG('REFERENCE#')
     A            TRANVK         7  0       COLHDG('TRANSACTION#')
     A            RRN#VK         9  0       COLHDG('RRN#')
     A            COCOVK         3          COLHDG('COMP' 'CODE')
     A            DATEVK          L         COLHDG('RESOLVE' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIMEVK          T         COLHDG('RESOLVE' 'TIME')
     A                                      DFT('00.00.00')
     A            USERVK        10          COLHDG('USER')
     A            PROCVK         1          COLHDG('PROCESS' 'FLAG')
     A            REQ#VK         7  0       COLHDG('REQUEST #')
     A            TXT1VK        70          COLHDG('TEXT LINE #1')
     A            TXT2VK        70          COLHDG('TEXT LINE #2')
     A            TXT3VK        70          COLHDG('TEXT LINE #3')
     A            TXT4VK        70          COLHDG('TEXT LINE #4')
     A            TXT5VK        70          COLHDG('TEXT LINE #5')
     A            TXT6VK        70          COLHDG('TEXT LINE #6')
     A            TXT7VK        70          COLHDG('TEXT LINE #7')
     A            RNAMVK        25          COLHDG('REMIT TO' 'NAME')
     A            RADDVK        25          COLHDG('REMIT TO' 'ADDRESS')
     A            RCSZVK        25          COLHDG('REMIT TO' 'CITY ST ZIP')
     A            RATTVK        25          COLHDG('REMIT TO' 'ATTN')
     A            OVP$VK         9  2       COLHDG('OVER PAY' 'AMOUNT')
     A**********************************************************************
     A*           BCFH      -               BURINGTON COAT FACTORY HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00100
     A*         R BCFHFM
     A*
     A            ACRECBH        1          COLHDG('RECORD' 'CODE')
     A            CCODEBH        3          COLHDG('CUSTOMER' 'CODE')
     A            LOADIBH       10          COLHDG('LOAD ID' 'NUMBER')
     A            ITRALBH       12          COLHDG('INBOUND' 'TRAILER')
     A            ADATEBH         L         COLHDG('EST.ARRIVAL' 'DATE')
     A                                      DFT('0001-01-01')
     A            FDATEBH         L         COLHDG('FILE PROCESS' 'DATE')
     A                                      DFT('0001-01-01')
     A            STATFBH        1          COLHDG('STATUS' 'FLAG')
     A*                                       *BLANK = NOT PROCESSED YET
     A*                                       P = PROCESSED
     A*                                       E = ERRORS IN FILE
     A*
     A**********************************************************************
     A*           BCFD      -               BURINGTON COAT FACTORY DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00100
     A*         R BCFDFM
     A*
     A            LOADIBK       10          COLHDG('LOAD ID' 'NUMBER')
     A            STOREBK        6  0       COLHDG('STORE#')
     A            STQTYBK        7  0       COLHDG('STORE' 'CARTON QTY')
     A            STWGTBK        7  0       COLHDG('STORE' 'CARTON WEIGHT')
     A            PRO##BK        7  0       COLHDG('PRO#')
     A            ROUTEBK        3          COLHDG('ROUTE#')
     A*
     A*************************************************************************
     A*           BCFS      -               BURINGTON COAT FACTORY STORE MASTER
     A*************************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R BCFSFM
     A            ACRECBI        1          COLHDG('ACTIVE' 'CODE')
     A            STOR#BI        6  0       COLHDG('STORE#')
     A            SNAMEBI       25          COLHDG('STORE' 'NAME')
     A            ADDR1BI       35          COLHDG('ADDRESS 1')
     A            ADDR2BI       35          COLHDG('ADDRESS 2')
     A            CITYSBI       20          COLHDG('CITY')
     A            STATEBI        2          COLHDG('STATE')
     A            ZIPCDBI        5  0       COLHDG('ZIP CODE')
     A            PHONEBI       10          COLHDG('PHONE #')
     A            EMAILBI       50          COLHDG('E-MAIL' 'ADDRESS')
     A            CLUSTBI        5  0       COLHDG('CLUSTER')
     A            STATSBI       10          COLHDG('STATUS')
     A            APSITBI       25          COLHDG('AWARDED POOL' 'SITE')
     A            ISDATBI         L         COLHDG('IMP. START' 'DATE')
     A                                      DFT('0001-01-01')
     A            GLDATBI         L         COLHDG('GO LIVE' 'DATE')
     A                                      DFT('0001-01-01')
     A            FWVARBI        5  2       COLHDG('FOUR WALLS' 'VARIABLE COST')
     A            FWFIXBI        5  2       COLHDG('FOUR WALLS' 'FIXED COST')
     A            LMILEBI        5  2       COLHDG('LAST MILE' 'DELIVERY COST')
     A            BASERBI        5  2       COLHDG('BASE' 'RATE')
     A            FUELIBI       10          COLHDG('REGIONAL' 'FUEL INDEX')
     A            ANSTCBI        7  0       COLHDG('ANNUAL' 'STORE CARTONS')
     A            FREQNBI        4  2       COLHDG('NON-PEAK' 'FREQUENCY')
     A            FREQPBI        4  2       COLHDG('PEAK' 'FREQUENCY')
     A            TIMEDBI         T         COLHDG('TARGET' 'DELIVERY TIME')
     A                                      DFT('00.00.00')
     A*
     A**********************************************************************
     A*           BCFT      -               BURINGTON COAT FACTORY TEXT FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00100
     A*         R BCFTFM
     A*
     A            ITRALBJ       12          COLHDG('INBOUND' 'TRAILER')
     A            TEXTFBJ       75          COLHDG('TEXT FILE' 'NAME')
     A            PROCFBJ        1          COLHDG('PROCESS' 'FLAG')
     A            LOADIBJ       10          COLHDG('LOAD ID' 'NUMBER')
     A*
     A**********************************************************************
     A*           BCFN      -               BURINGTON COAT FACTORY TOTALS CHK
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00100
     A*         R BCFNFM
     A*
     A            TEXTFBN       12          COLHDG('TEXT FILE' 'NAME')
     A            LOADIBN       10          COLHDG('LOAD ID' 'NUMBER')
     A            ITRALBN       12          COLHDG('INBOUND' 'TRAILER')
     A            TXQTYBN        7  0       COLHDG('TEXT FILE' 'QTY')
     A            TXWGTBN        7  0       COLHDG('TEXT FILE' 'WGT')
     A            BLQTYBN        7  0       COLHDG('BLHD FILE' 'QTY')
     A            BLWGTBN        7  0       COLHDG('BLHD FILE' 'WGT')
     A            DTQTYBN        7  0       COLHDG('BCFD FILE' 'QTY')
     A            DTWGTBN        7  0       COLHDG('BCFD FILE' 'WGT')
     A*
     A**********************************************************************
     A*           BCFL      -               BURINGTON COAT FACTORY 820 EXCEL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00100
     A*         R BCFLFM
     A*
     A            MAILBBL       10          COLHDG('FAUX MAILBOX ID')
     A            VEND#BL       10  0       COLHDG('VENDOR' 'NUMBER')
     A            PRO##BL        7  0       COLHDG('PRO#')
     A            PAYGPBL       10          COLHDG('PAY' 'GROUP')
     A            CDATEBL         L         COLHDG('CHECK' 'DATE')
     A                                      DFT('0001-01-01')
     A            DOCUNBL        7  0       COLHDG('DOCUMENT#')
     A            PAYMTBL       10          COLHDG('PAYMENT' 'METHOD')
     A            SUPPLBL        7  0       COLHDG('SUPPLIER#')
     A            SNAMEBL       25          COLHDG('SHIPPER' 'NAME')
     A            SSITEBL       25          COLHDG('SUPPLIER' 'SITE')
     A            PAYTOBL       25          COLHDG('PAYTO')
     A            IDATEBL         L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            INVO#BL       17          COLHDG('INVOICE#')
     A            GROSABL        9  2       COLHDG('GROSS' 'AMOUNT')
     A            DISCABL        9  2       COLHDG('DISCOUNT' 'AMOUNT')
     A            IAMNTBL        9  2       COLHDG('INVOICE' 'AMOUNT')
     A            PAYPRBL        5          COLHDG('PAYMENT' 'PRIORITY')
     A            TDATEBL         L         COLHDG('TRANSACTION' 'DATE')
     A                                      DFT('0001-01-01')
     A*
     A**********************************************************************
     A*           ILIN      -               INTERLINE INVOICE REGISTRY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00100
     A*         R ILINFM
     A*
     A            SCACII         4          COLHDG('CARRIER' 'SCAC')
     A            INV#II        17          COLHDG('INVOICE #')
     A            IDATII          L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            DDATII          L         COLHDG('DUE' 'DATE')
     A                                      DFT('0001-01-01')
     A            USERII        10          COLHDG('ENTRY' 'USER')
     A            DATEII          L         COLHDG('ENTRY' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIMEII         4  0       COLHDG('ENTRY' 'TIME')
     A*
