      *%METADATA                                                       *
      * %TEXT field reference CONPGM                                   *
      *%EMETADATA                                                      *
     A**********************************************************************
     A*           FLDREF  -  FIELD REFERENCE FILE FOR ALL CONS. FILES
     A**********************************************************************
     A*
     A*  ALL FILES IN ALPHABETICAL ORDER
     A*
     A*           ACAR    -    AC      CARRIERS FILE FOR APPOINTMENT
     A*           ACSX    -    AZ      ACADEMY SPORTS ACCOUNT CROSS REF
     A*           AACT    -    AT      ACCOUNT NAME
     A*           AACB    -    AB      ACCOUNT TO BUIDING FILE
     A*           ACTP    -    P       ACCOUNT PROGRAMS USED
     A*           ACPW    -    A1      ACADEMY SPORTS BILLING WORKFILE
     A*           ACPF    -    A2      ACADEMY SPORTS BILLING WORKFILE
     A*           ALCP    -    A$      PRO AMOUNT ALLOCATION FILE
     A*           ARMF    -    Y       AR MANIFEST CONS.INVOICE FILE
     A*           BRAN    -    B       BRANCH FILE
     A*           BRID    -    S       BRANCH ID FILE
     A*           CADR    -    Z       CONSIGNEE ADDRESS FILE
     A*           CAMA    -    FE      CAMERA SYS ZIP/PO SUFFIX REF         TUS
     A*           CAMD    -    FD      CAMERA DETAIL FILE
     A*           CAMH    -    FH      CAMERA HEADER FILE
     A*           CARR    -    A       CARRIER FILE
     A*           CBCK    -    #       CONTROLS CREATED AFTER WARDS
     A*           CCMT    -    K       CARRIER COMMENT FILE
     A*           CHCK    -    V       ADVANCE CHARGES CHECK FILE
     A*           CHMF    -    C1      CHICO'S MANIFEST FILE
     A*           CHOD    -    C2      CHICO'S ON-DOCK FILE
     A*           CHOL    -    C3      CHICO'S ON-DOCK FILE LOS ANGELES
     A*           CNPO    -    P       CANCELLED PO
     A*           CNTR    -    X       CONTROL FILE
     A*           COMP    -    O       WALSH COMPANY CODE FILE
     A*           COND    -    3       CONSOL. TOTALS FOR A DATE
     A*           CONG    -    U       CONSIGNEE FILE
     A*           CTRR    -    R       CONTROL RECORD SEQUENCE
     A*           CUST    -    C       CUSTOMER FILE
     A*           CVRF    -    VF      CVS BILLING SUMMARY RATE FILE
     A*           CVRT    -    VR      CVS BILLING RATE TABLE
     A*           CVSW    -    CL      CVS BILLING WORKFILE
     A*           CVSX    -    CZ      CVS DC/ ACCOUNT# CROSS REF
     A*           CWRK    -    E       CONS WORK FILE
     A*           CWRP    -    TM      CONS WORK FILE FOR 223 TARGET
     A*           DAMG    -    D       DAMAGE FILE FOR HOME DEPOT
     A*           DDPF    -    D1      DDP BILLING SUMMARY RATE FILE
     A*           DDPW    -    D3      DDP BILLING WORKFILE
     A*           DEPT    -    D       DEPT WORK FILE
     A*           DSWS    -    DW      DSW PALLET SCAN FILE.
     A*           DSWU    -    DU      DSW USER CODE FILE.
     A*           E#PM    -    9       PO FILE (EDI 210 DETAIL-MERVYN)
     A*           E#PT    -    9       PO FILE (EDI 214 DETAIL-TARGET)
     A*           EAH1    -    1       PO FILE (EDI 210 DETAIL-AMES)
     A*           EAP1    -    P1      PO FILE (EDI 210 DETAIL-AMES)
     A*           EAP2    -    P2      PO FILE (EDI 210 DETAIL-AMES)
     A*           EDIF    -    I       EDI FILE
     A*           EDIN    -    4       EDI FILE FOR CONSIGNEE INFO. FOR
     A*                                 N1 SEGMENT OF 214 DOCUMENT
     A*           EFCM    -    M       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH MANF. INFO. E STATUS
     A*           EFCP    -    F       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH PO INFO.    E STATUS
     A*           EFCR    -    H       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                FOR FEDERATED WITH RECEIPT INFO.E STATUS
     A*           EFOM    -    N       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH MANF. INFO. E STATUS
     A*                                 FOR DATA FROM OUTSIDE CARRIERS
     A*           EFOP    -    V       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH PO INFO.    E STATUS
     A*                                 FOR DATA FROM OUTSIDE CARRIERS
     A*           EFOR    -    U       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                FOR FEDERATED WITH RECEIPT INFO.E STATUS
     A*                                 FOR DATA FROM OUTSIDE CARRIERS
     A*           ELZC    -    P1      CTN FILE (EDI 211 HDR LIZ CLAIBORNE
     A*           ELZH    -    Z1      EDI 211 HDR LIZ CLAIBORNE
     A*           ELZP    -    P2      PO FILE (EDI 211 DETAIL-LIZ CLAIBORNE
     A*           EL4D    -    D4      EDI 214 DETAIL LIZ CLAIBORNE    BORNE
     A*           EL4H    -    H4      EDI 214 HDR LIZ CLAIBORNE
     A*           EMH3    -    3       PO FILE (EDI 210 DETAIL-MF)
     A*           EMF1    -    F1      PO FILE (EDI 210 DETAIL-MF)
     A*           EMF2    -    F2      PO FILE (EDI 210 DETAIL-MF)
     A*           EMF3    -    F3      PO FILE (EDI 210 DETAIL-MF)
     A*           EMPD    -    D       EMPLOYEE DETAIL FILE
     A*           EMPL    -    H       EMPLOYEE HEADER FILE
     A*           ETB0    -    TB      EDI 210 DTL TJMAX(MARMAX)
     A*           ETD0    -    TD      EDI 210 DTL TJMAX(MARMAX)
     A*           ETH0    -    TH      EDI 210 HDR TJMAX(MARMAX)
     A*           ETP0    -    TP      EDI 210 HDR TJMAX(MARMAX)
     A*           ETJD    -    D2      EDI 212 DTL TJMAX(MARMAX)
     A*           ETJH    -    H2      EDI 212 HDR TJMAX(MARMAX)
     A*           ETJG    -    G2      EDI 212 HDR TJMAX(MARMAX)
     A*           ETJP    -    P2      EDI 212 PO  TJMAX(MARMAX)
     A*           ETJQ    -    PQ      EDI 212 PO  TJMAX(MARMAX)
     A*           ETJR    -    R2      EDI 212 HDR TJMAX(MARMAX)
     A*           ETMF    -    M       WORK FILE FOR EDI 223 DOCUMENT  G CREATED
     A*                                 FOR TARGET/MERVYNS MANF. INFO. E STATUS
     A*           ETPO    -    P       PO FILE (EDI 223 DETAIL-TARGET
     A*                                 & MERVYNS)
     A*           ETRC    -    R       WORK FILE FOR EDI 223 DOCUMENT  G CREATED
     A*                                 FOR TARGET/MERVYNS RECEIPT INFOE STATUS
     A*           EWRK    -    5       WORK FILE FOR AF-AG SEGMENT BEING CREATED
     A*                                 FOR RECEIVING RECORDS AND CHANGE STATUS
     A*           FEDV    -    FV      FEDERATED VENDORS 820
     A*           GRUP    -    G       GROUP CODE FOR USER ID
     A*           HDBW    -    HB      THD BILLING WORKFILE
     A*           HDCM    -    HC      THD CARRIER FILE
     A*           HDCR    -    HR      THD CONTAINER BILLING RATE FILE
     A*           HDCW    -    HW      THD CONTAINER SUMMARY WORKFILE
     A*           HDDU    -    HV      THD REVERSE DIVERTED CONTAINERS
     A*           HDDV    -    HD      THD CONTAINER DIVERSTIONS FILE
     A*           HDSP    -    HS      THD CONTAINER BILLING SPLITS FILE
     A*           HDVO    -    VO      THD CONTAINER VOUCHER WORK FILE
     A*           HDXC    -    XC      THD CONTAINER BILLING EXCEL WORKFILE
     A*           HDXI    -    XI      THD CONTAINER SCANNING INBOUND EXCEL
     A*           HDXO    -    XO      THD CONTAINER SCANNING OUTBOUND EXCEL
     A*           HDXV    -    XV      THD CONTAINER MAERSK EXCEL WORKFILE
     A*           HDXW    -    XW      THD CONTAINER IMPORT FILE FOR 850 856
     A*           INTA    -    IA      INTERNAL DATA ACCOUNT TYPE
     A*           INTB    -    IB      INTERNAL DATA BUILDING
     A*           INTT    -    IT      INTERNAL DATA TYPE OF WORK
     A*           INTW    -    IW      INTERNAL DATA WORK TASK
     A*           LANE    -    LA      LIZ CLAIBORNE LANE FILE
     A*           LGPO    -    G       PURCHASE ORDER REPORT LOG
     A*           LZCT    -    LC      LIZ CLAIBORNE CTN FILE
     A*           LZHD    -    LH      LIZ CLAIBORNE HEADER FILE
     A*           LZMP    -    MP      LIZ CLAIBORNE MAPPING FILE
     A*           LZPO    -    LP      LIZ CLAIBORNE PO FILE
     A*           MAAK    -    MK      MACYS ASN AUDIT WORKFILE
     A*           MANF    -    M       MANIFEST SUMMARY
     A*           MAPO    -    MJ      MARSHALLS/ TJMAXX/ AJ PO# CROSS-REF
     A*           MCTL    -    N       MANIFEST CONTROL FILE
     A*           MDLW    -    MD      MEDLINE BILLING WORKFILE.
     A*           MLHT    -    ML      MACYS LEVEL OF SERVICE HISTORY
     A*           MLOG    -    LG      MANIFEST LOG FILE.
     A*           MLWK    -    MW      MACYS LEVEL OF SERVICE R.S.
     A*           NWRK    -    NW      NRT VS NRC BILLING WORKFILE
     A*           NRCW    -    NR      NRT VS NRC BILLING WORKFILE
     A*           OSFC    -    4       OUTSIDE CARRIERS FOR FEDERATED
     A*           OVER    -    G       OVERAGE/DOCK/SHIPMENTS
     A*           PCAR    -    Q       ADV CHG PROTECTED CARRIERS
     A*           PHON    -    I       ENTER BILLING CHGS. FOR TRAM.
     A*           PLOG    -    L       PURCHASE ORDER PROBLEM LOG
     A*           PRBD    -    2       PROBLEM WITH SHIPMENTS PO# DETAIL
     A*           PRBL    -    H       PROBLEM WITH SHIPMENTS PO# HEADER
     A*           PROD    -    R       PRODUCTIVE FILE                 R
     A*           PRTF    -    J       USER PRINTER FILE DEFINATION
     A*           RECC    -    R       RECEIPT COLOR SIZE
     A*           RECD    -    D       RECEIPT DETAIL FILE
     A*           RECH    -    H       RECEIPT HEADER
     A*           RECP    -    F       RECEIPT PO FILE
     A*           RECT    -    T       TEMPORARY RECEIPT HEADER
     A*           SCAC    -    S       SCAC CODE FILE
     A*           SCBL    -    S3      SCAN BUILDING LOC MASTER
     A*           SCOB    -    S1      SCAN O/B DOOR W/ TRAILER
     A*           SHDA    -    SA      SCAN THD RECEIPTS AUDIT
     A*           SCRC    -    S2      SCAN LOADED RECEIPT
     A*           SEQE    -    C       SEQUENCE CODE FILE
     A*           SIZE    -    S       SIZE ARRAY FOR COLOR/SIZE
     A*           SLAD    -    CD      STEINMART LA I/B 212 MANF. DLT
     A*           SLAE    -    CE      STEINMART EXCEPTION RECORDS.
     A*           SLAH    -    CH      STEINMART LA I/B 212 MANF. HDR
     A*           SLAV    -    CV      STEINMART EDI RH & RD DOWNLOAD
     A*           SLAW    -    CW      STEINMART PO EDIT CHECK FILE
     A*           STNC    -    SC      STEINMART SECURITY CODES
     A*           STND    -    SD      STEINMART RECEIPTS DETAIL
     A*           STNH    -    SH      STEINMART RECEIPTS HEADER
     A*           STNS    -    ST      STEINMART STORE MASTER
     A*           STNX    -    SX      STEINMART REMOVE BAR CODE SAVE
     A*           STNZ    -    SZ      STEINMART FREIGHT CHARGE BACK
     A*           SYID    -    SY      SYSTEM ID FILE
     A*           TABL    -    W       TABLE FILE FOR VARIOUS CODES
     A*           TASD    -    TD      TARGET BUILDING DOOR SCHEMA
GP   A*           TGED    -    TG      TARGET EDI 214 ADVANCE PU DATE
GP   A*                                  NLRT       (WEST COAST)
     A*           TJAC    -    TX      TJX ACCOUNTS
     A*           TJDW    -    DF      TJMAXX DWELL REPORT FILE
     A*           TJHD    -    TY      TJMAXX HOT PRIORITY DEPARTMENTS
     A*           TJPL    -    PF      TJMAXX PALLETS OH HAND REPORT FILE
     A*           TJPO    -    TJ      WEEKLY TJ MAXX PO FILE
     A*           TJRD    -    T7      TJMAXX READY CONTAINERS WORKFILE
     A*           TJRG    -    RG      TJMAXX ROUTING GUIDE
     A*           TJWK    -    WK      TJ MAX WORK FILE (USED IN TJ001R
     A*                                       AND E#12WA)
     A*           TJXW    -    TZ      TJ MAX PRIORITY DEPARTMENT WORK FILE
     A*           TKSF    -    T1      TRS BILLING SUMMARY RATE FILE
     A*           TKSR    -    T2      TRS BILLING RATE TABLE
     A*           TKSW    -    T3      TRS BILLING WORKFILE
     A*           TKSX    -    TK      TRACTOR SUPPLY DC/ CUST X-REF.
     A*           TMSC    -    TL      TJ MAX MARSHALLS SCAN FILE.
     A*           TMSD    -    TA      TJ MAX MARSHALLS DOOR LABEL MASTER.
     A*           TMSE    -    TE      TJ MAX MARSHALLS RUN# STORE# MASTER.
     A*           TMSF    -    TF      TJ MAX MARSHALLS DETAIL SCAN FILE.
     A*           TMSH    -    TH      TJ MAX MARSHALLS PLAN HEADER FILE.
     A*           TMSL    -    TG      TJ MAX MARSHALLS STAGING LOCATION MASTER.
     A*           TMSO    -    TO      TJ MAX MARSHALLS SCANNING ORIGIN MASTER
     A*           TMSP    -    TQ      TJ MAX MASTER    PALLET SCAN FILE.
     A*           TMSR    -    TR      TJ MAX MARSHALLS PLAN EXTRA RUN FILE
     A*           TMSS    -    TT      TJ MAX MARSHALLS STORE FILE VERS 2.
     A*           TMST    -    TS      TJ MAX MARSHALLS STORE FILE.
     A*           TMSU    -    TU      TJ MAX MARSHALLS USER FILE.
     A*           TMSW    -    TW      TJ MAX MARSHALLS PALLET SCAN FILE. V2.
     A*           TONG    -    G       PROJECTED TONNAGE BY ACCOUNT
     A*           TRNF    -    1       RECEIPT TRANSFER FILE
     A*           TRTM    -    2       TRAVEL TIME FOR FED A/C
     A*           UNVC    -    V3      VALUE CITY ON-DOCK & MANIFEST FI
     A*           USER    -    U       USER FILE TO OUTQ
     A*           VEND    -    8       VENDOR MASTER FILE
     A*           VALU    -    V1      VALUE CITY ON-DOCK & MANIFEST FI
     A*           VALS    -    V2      VALUE CITY LEVEL OF SERVICE FI
     A*           WINA    -    WI      WINNER'S ACCOUNT # FILE
     A*           WRKD    -    7       EDI FILE FOR 210  DETAIL FILE
     A*           WEBH    -    H7      WEB HEADER RECORD FILE
     A*           WEBD    -    D7      WEB DETAIL RECORD FILE
     A*           WKAR    -    WA      WORK FILE FOR TARGET A/R STMT
     A*           WKMT    -    WM      WORK FILE FOR MANIFEST REPORT GT
     A*           WKOB    -    W8      WORK FILE FOR O/B TRAILERS
     A*           WKRC    -    WR      WORK FILE FOR RECEIPT REPORT GT
     A*           WKMK    -    WQ      WORK FILE FOR MAERSK W/O BOL#
     A*           WRKE    -    6       EDI FILE FOR 210  HEADER FILE
     A*           WRKT    -    8       EDI FILE FOR TJMAX
     A*           WRM1    -    M       MARSHALLS WORK FILE FOR TRAMISSION
     A*           WRT1    -    6       TARGET EDI MANIFEST WORK FILE
     A*           WRT2    -    7       TARGET EDI RECEIPT  WORK FILE
     A*           ZIPC    -    Z       DEST. ZIP CODE CROSS REFERENCE
     A**********************************************************************
     A*
     A*  ALL FILES IN ORDER BY SUFFIX
     A*
     A*           CBCK    -    #       CONTROLS CREATED AFTER WARDS
     A*           AACB    -    AB      ACCOUNT TO BUIDING FILE
     A*           ACAR    -    AC      CARRIERS FILE FOR APPOINTMENT
     A*           AACT    -    AT      ACCOUNT NAME
     A*           ACSX    -    AZ      ACADEMY SPORTS ACCOUNT CROSS REF
     A*           CARR    -    A       CARRIER FILE
     A*           ALCP    -    A$      PRO AMOUNT ALLOCATION FILE
     A*           ACPW    -    A1      ACADEMY SPORTS BILLING WORKFILE
     A*           ACPF    -    A2      ACADEMY SPORTS BILLING WORKFILE
     A*           BRAN    -    B       BRANCH FILE
     A*           CUST    -    C       CUSTOMER FILE
     A*           SEQE    -    C       SEQUENCE CODE FILE
     A*           CHMF    -    C1      CHICO'S MANIFEST FILE
     A*           CHOD    -    C2      CHICO'S ON-DOCK FILE
     A*           CHOL    -    C3      CHICO'S ON-DOCK FILE LOS ANGELES
     A*           SLAD    -    CD      STEINMART LA I/B 212 MANF. DLT
     A*           SLAE    -    CE      STEINMART EXCEPTION RECORD.
     A*           SLAH    -    CH      STEINMART LA I/B 212 MANF. HDR
     A*           CVSW    -    CL      CVS BILLING WORKFILE
     A*           SLAV    -    CV      STEINMART EDI RH & RD DOWNLOAD
     A*           SLAW    -    CW      STEINMART PO EDIT CHECK FILE
     A*           CVSX    -    CZ      CVS DC/ ACCOUNT# CROSS REF
     A*           EMPD    -    D       EMPLOYEE DETAIL FILE
     A*           DEPT    -    D       DEPT WORK FILE
     A*           RECD    -    D       RECEIPT DETAIL FILE
     A*           DDPF    -    D1      DDP BILLING SUMMARY RATE FILE
     A*           DDPW    -    D3      DDP BILLING WORKFILE
     A*           TJDW    -    DF      TJMAXX DWELL REPORT FILE
     A*           DSWU    -    DU      DSW USER CODE FILE.
     A*           DSWS    -    DW      DSW PALLET SCAN FILE.
     A*           ETJD    -    D2      EDI 212 DTL TJMAX(MARMAX)
     A*           EL4D    -    D4      EDI 214 DETAIL LIZ CLAIBORNE    BORNE
     A*           CWRK    -    E       CONS WORK FILE
     A*           RECP    -    F       RECEIPT PO FILE
     A*           EFCP    -    F       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH PO INFO.    E STATUS
     A*           CAMD    -    FD      CAMERA DETAIL FILE
     A*           CAMA    -    FE      CAMERA SYS ZIP/PO SUFFIX REF         TUS
     A*           CAMH    -    FH      CAMERA HEADER FILE
     A*           FEDV    -    FV      FEDERATED VENDORS 820
     A*           EMF1    -    F1      PO FILE (EDI 210 DETAIL-MF)
     A*           EMF2    -    F2      PO FILE (EDI 210 DETAIL-MF)
     A*           EMF3    -    F3      PO FILE (EDI 210 DETAIL-MF)
     A*           LGPO    -    G       PURCHASE ORDER REPORT LOG
     A*           OVER    -    G       OVERAGE/DOCK/SHIPMENTS
     A*           GRUP    -    G       GROUP CODE FOR USER ID
     A*           TONG    -    G       PROJECTED TONNAGE BY ACCOUNT
     A*           EMPL    -    H       EMPLOYEE HEADER FILE
     A*           PRBL    -    H       PROBLEM WITH SHIPMENTS PO# HEADER
     A*           RECH    -    H       RECEIPT HEADER
     A*           EFCR    -    H       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                FOR FEDERATED WITH RECEIPT INFO.E STATUS
     A*           ETJH    -    H2      EDI 212 HDR TJMAX(MARMAX)
     A*           ETJG    -    G2      EDI 212 HDR TJMAX(MARMAX)
     A*           EL4H    -    H4      EDI 214 HDR LIZ CLAIBORNE
     A*           HDBW    -    HB      THD BILLING WORKFILE
     A*           HDCM    -    HC      THD CARRIER FILE
     A*           HDDV    -    HD      THD CONTAINER DIVERSTIONS FILE
     A*           HDCR    -    HR      THD CONTAINER BILLING RATE FILE
     A*           HDSP    -    HS      THD CONTAINER BILLING SPLITS FILE
     A*           HDDU    -    HV      THD REVERSE DIVERTED CONTAINERS
     A*           HDCW    -    HW      THD CONTAINER SUMMARY WORKFILE
     A*           EDIF    -    I       EDI FILE
     A*           PHON    -    I       ENTER BILLING CHGS. FOR TRAM.
     A*           INTA    -    IA      INTERNAL DATA ACCOUNT TYPE
     A*           INTB    -    IB      INTERNAL DATA BUILDING
     A*           INTT    -    IT      INTERNAL DATA TYPE OF WORK
     A*           INTW    -    IW      INTERNAL DATA WORK TASK
     A*           PRTF    -    J       USER PRINTER FILE DEFINATION
     A*           CCMT    -    K       CARRIER COMMENT FILE
     A*           PLOG    -    L       PURCHASE ORDER PROBLEM LOG
     A*           LANE    -    LA      LIZ CLAIBORNE LANE FILE
     A*           LZCT    -    LC      LIZ CLAIBORNE CTN FILE
     A*           MLOG    -    LG      MANIFEST LOG FILE.
     A*           LZHD    -    LH      LIZ CLAIBORNE HEADER FILE
     A*           LZPO    -    LP      LIZ CLAIBORNE PO FILE
     A*           MANF    -    M       MANIFEST SUMMARY
     A*           WRM1    -    M       MARSHALLS WORK FILE FOR TRAMISSION
     A*           EFCM    -    M       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH MANF. INFO. E STATUS
     A*           ETMF    -    M       WORK FILE FOR EDI 223 DOCUMENT  G CREATED
     A*                                 FOR TARGET/MERVYNS MANF. INFO. E STATUS
     A*           MDLW    -    MD      MEDLINE BILLING WORKFILE.
     A*           MAPO    -    MJ      MARSHALLS/ TJMAXX/ AJ PO# CROSS-REF
     A*           MAAK    -    MK      MACYS ASN AUDIT WORKFILE
     A*           MLHT    -    ML      MACYS LEVEL OF SERVICE HISTORY
     A*           LZMP    -    MP      LIZ CLAIBORNE MAPPING FILE
     A*           MLWK    -    MW      MACYS LEVEL OF SERVICE R.S.
     A*           MCTL    -    N       MANIFEST CONTROL FILE
     A*           EFOM    -    N       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH MANF. INFO. E STATUS
     A*                                 FOR DATA FROM OUTSIDE CARRIERS
     A*           NRCW    -    NR      NRT VS NRC BILLING WORKFILE
     A*           NWRK    -    NW      NRT VS NRC BILLING WORKFILE
     A*           COMP    -    O       WALSH COMPANY CODE FILE
     A*           ACTP    -    P       ACCOUNT PROGRAMS USED
     A*           CNPO    -    P       CANCELLED PO
     A*           ETPO    -    P       PO FILE (EDI 223 DETAIL-TARGET
     A*                                 & MERVYNS)
     A*           TJPL    -    PF      TJMAXX PALLETS OH HAND REPORT FILE
     A*           EAP1    -    P1      PO FILE (EDI 210 DETAIL-AMES)
     A*           ELZC    -    P1      CTN FILE (EDI 211 HDR LIZ CLAIBORNE
     A*           EAP2    -    P2      PO FILE (EDI 210 DETAIL-AMES)
     A*           ELZP    -    P2      PO FILE (EDI 211 DETAIL-LIZ CLAIBORNE
     A*           ETJP    -    P2      EDI 212 PO  TJMAX(MARMAX)
     A*           PCAR    -    Q       ADV CHG PROTECTED CARRIERS
     A*           CTRR    -    R       CONTROL RECORD SEQUENCE
     A*           PROD    -    R       PRODUCTIVE FILE                 R
     A*           RECC    -    R       RECEIPT COLOR SIZE
     A*           ETRC    -    R       WORK FILE FOR EDI 223 DOCUMENT  G CREATED
     A*                                 FOR TARGET/MERVYNS RECEIPT INFOE STATUS
     A*           ETJR    -    R2      EDI 212 HDR TJMAX(MARMAX)
     A*           BRID    -    S       BRANCH ID FILE
     A*           SIZE    -    S       SIZE ARRAY FOR COLOR/SIZE
     A*           SCAC    -    S       SCAC CODE FILE
     A*           SCOB    -    S1      SCAN O/B DOOR W/ TRAILER
     A*           SCRC    -    S2      SCAN LOADED RECEIPT
     A*           SCBL    -    S3      SCAN BUILDING LOC MASTER
     A*           SHDA    -    SA      SCAN THD RECEIPTS AUDIT
     A*           STNC    -    SC      STEINMART SECURITY CODES
     A*           STND    -    SD      STEINMART RECEIPTS DETAIL
     A*           STNH    -    SH      STEINMART RECEIPTS
     A*           STNS    -    ST      STEINMART STORE MASTER
     A*           STNX    -    SX      STEINMART REMOVE BAR CODE SAVE
     A*           SYID    -    SY      SYSTEM ID FILE
     A*           STNZ    -    SZ      STEINMART FREIGHT CHARGE BACK
     A*           RECT    -    T       TEMPORARY RECEIPT HEADER
GP   A*           TGED    -    T       TARGET EDI 214 ADVANCE AND LINEHAUL
GP   A*                                  NLRT< NRTV (WEST COAST)
     A*           TASD    -    TD      TARGET BUILDING DOOR SCHEMA
     A*           TKSF    -    T1      TRS BILLING SUMMARY RATE FILE
     A*           TKSR    -    T2      TRS BILLING RATE TABLE
     A*           TKSW    -    T3      TRS BILLING WORKFILE
     A*           TJRD    -    T7      TJMAXX READY CONTAINERS WORKFILE
     A*           TMSD    -    TA      TJ MAX MARSHALLS DOOR LABEL MASTER.
     A*           ETB0    -    TB      EDI 210 DTL TJMAX(MARMAX)
     A*           ETD0    -    TD      EDI 210 DTL TJMAX(MARMAX)
     A*           TMSE    -    TE      TJ MAX MARSHALLS RUN# STORE# MASTER.
     A*           TMSF    -    TF      TJ MAX MARSHALLS DETAIL SCAN FILE.
     A*           TMSL    -    TG      TJ MAX MARSHALLS STAGING LOCATION MASTER.
     A*           TMSH    -    TH      TJ MAX MARSHALLS PLAN HEADER MASTER.
     A*           ETH0    -    TH      EDI 210 HDR TJMAX(MARMAX)
     A*           TJPO    -    TJ      WEEKLY TJ MAXX PO FILE
     A*           TKSX    -    TK      TRACTOR SUPPLY DC/ CUST X-REF.
     A*           TMSC    -    TL      TJ MAX MARSHALLS SCAN FILE.
     A*           CWRP    -    TM      CONS WORK FILE FOR 223 TARGET
     A*           TMSO    -    TO      TJ MAX MARSHALLS SCANNING ORIGIN MASTER
     A*           ETP0    -    TP      EDI 210MASTER   X(MARMAX)
     A*           TMSP    -    TQ      TJ MAX MARSHALLS PALLET SCAN FILE.
     A*           TMSR    -    TR      TJ MAX MARSHALLS PLAN EXTRA RUN FILE
     A*           TMST    -    TS      TJ MAX MARSHALLS STORE FILE.
     A*           TMSS    -    TT      TJ MAX MARSHALLS STORE FILE VERS 2.
     A*           TMSU    -    TU      TJ MAX MARSHALLS USER FILE.
     A*           TMSW    -    TW      TJ MAX MARSHALLS PALLET SCAN FILE. V2.
     A*           TJAC    -    TX      TJX ACCOUNTS
     A*           TJHD    -    TY      TJMAXX HOT PRIORITY DEPARTMENTS
     A*           TJXW    -    TZ      TJ MAX PRIORITY DEPARTMENT WORK FILE
     A*           CONG    -    U       CONSIGNEE FILE
     A*           EFOR    -    U       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                FOR FEDERATED WITH RECEIPT INFO.E STATUS
     A*                                 FOR DATA FROM OUTSIDE CARRIERS
     A*           USER    -    U       USER FILE TO OUTQ
     A*           CHCK    -    V       ADVANCE CHARGES CHECK FILE
     A*           EFOP    -    V       WORK FILE FOR EDI 212 DOCUMENT  G CREATED
     A*                                 FOR FEDERATED WITH PO INFO.    E STATUS
     A*                                 FOR DATA FROM OUTSIDE CARRIERS
     A*           HDVO    -    VO      THD CONTAINER VOUCHER WORK FILE
     A*           CVRT    -    VR      CVS BILLING RATE TABLE
     A*           CVRF    -    VF      CVS BILLING SUMMARY RATE FILE
     A*           VALU    -    V1      VALUE CITY ON-DOCK & MANIFEST FI
     A*           VALS    -    V2      VALUE CITY LEVEL OF SERVICE FI
     A*           UNVC    -    V3      VALUE CITY ON-DOCK & MANIFEST FI
     A*           TABL    -    W       TABLE FILE FOR VARIOUS CODES
     A*           TJWK    -    WK      TJ MAX WORK FILE (USED IN TJ001R
     A*                                       AND E#12WA)
     A*           WKAR    -    WA      WORK FILE FOR TARGET A/R STMT
     A*           WKMT    -    WM      WORK FILE FOR MANIFEST REPORT GT
     A*           WKRC    -    WR      WORK FILE FOR RECEIPT REPORT GT
     A*           WKOB    -    W8      WORK FILE FOR O/B TRAILERS
     A*           WKMK    -    WQ      WORK FILE FOR MAERSK W/O BOL#
     A*           CNTR    -    X       CONTROL FILE
     A*           HDXC    -    XC      THD CONTAINER BILLING EXCEL WORKFILE
     A*           HDXI    -    XI      THD CONTAINER SCANNING INBOUND EXCEL
     A*           HDXO    -    XO      THD CONTAINER SCANNING OUTBOUND EXCEL
     A*           HDXV    -    XV      THD CONTAINER MAERSK EXCEL WORKFILE
     A*           HDXW    -    XW      THD CONTAINER IMPORT FILE FOR 850 856
     A*           ARMF    -    Y       AR MANIFEST CONS.INVOICE FILE
     A*           CADR    -    Z       CONSIGNEE ADDRESS FILE
     A*           ZIPC    -    Z       DEST. ZIP CODE CROSS REFERENCE
     A*           ELZH    -    Z1      PO FILE (EDI 211 HDR LIZ CLAIBORNE
     A*           TRNF    -    1       RECEIPT TRANSFER FILE
     A*           EAH1    -    1       PO FILE (EDI 210 DETAIL-AMES)
     A*           PRBD    -    2       PROBLEM WITH SHIPMENTS PO# DETAIL
     A*           TRTM    -    2       TRAVEL TIME FOR FED A/C
     A*           EMH3    -    3       PO FILE (EDI 210 DETAIL-MF)
     A*           COND    -    3       CONSOL. TOTALS FOR A DATE
     A*           EDIN    -    4       EDI FILE FOR CONSIGNEE INFO. FOR
     A*                                 N1 SEGMENT OF 214 DOCUMENT
     A*           OSFC    -    4       OUTSIDE CARRIERS FOR FEDERATED
     A*           EWRK    -    5       WORK FILE FOR AF-AG SEGMENT BEING CREATED
     A*                                 FOR RECEIVING RECORDS AND CHANGE STATUS
     A*           WRKE    -    6       EDI FILE FOR 210  HEADER
     A*           WRT1    -    6       TARGET EDI MANIFEST WORK FILE
     A*           WRKD    -    7       EDI FILE FOR 210  DETAIL
     A*           WRT2    -    7       TARGET EDI RECEIPT  WORK FILE
     A*           VEND    -    8       VENDOR MASTER FILE
     A*           WRKT    -    8       EDI FILE FOR TJMAX
     A*           E#PM    -    9       PO FILE (EDI 210 DETAIL-MERVYN)
     A*           E#PT    -    9       PO FILE (EDI 214 DETAIL-TARGET)
     A**********************************************************************
     A* MODIFICATONS:
     A*
GP01 A*   04/12/10            FIELD LENGTH CHANGED TO 14 FROM 12
GP02 A*   03/14/13            ADDED ACCT# FOR EDI OF 212 (N1 SEGMENT FOR SHIP-TO
     A**********************************************************************
     A          R FLDREFFM
     A*
     A**********************************************************************
     A*           ACAR      -            APPOINTMENT FILE CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R ACARFM
     A*
     A            CARCDAC        6          COLHDG('CARRIER CODE')
     A            CNAMEAC       20          COLHDG('CARRIER NAME')
     A            UNAMEAC       10          COLHDG('USER  NAME')
     A            PASSWAC       10          COLHDG('PASSWORD')
     A            FACILAC        3          COLHDG('FACILITY CODE')
     A            PHONEAC       10          COLHDG('PHONE NUMBER')
     A            CONTAAC       20          COLHDG('CONTACT NAME')
     A            EMAILAC       50          COLHDG('E-MAIL ADDRESS')
     A            EXTENAC        4          COLHDG('EXTENSION')
     A**********************************************************************
     A*           AACB      -            ACCOUNT TO BUILDING FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R AACBFM
     A*
     A            CARCDAB        6          COLHDG('ACCOUNT CODE')
     A            BUILDAB        9  0       COLHDG('BUILDING CODE')
     A            TYPECAB        1          COLHDG('TYPE' 'CODE')
     A*                                        C = CARTONS
     A*                                        G = GOH
     A*                                        B = BOTH
     A**********************************************************************
     A*           AACT      -            ACCOUNT NAME FOR APPOINTMENT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R AACTFM
     A*
     A            CARCDAT        6          COLHDG('ACCOUNT CODE')
     A            CNAMEAT       20          COLHDG('ACCOUNT NAME')
     A            FACILAT        3          COLHDG('FACILITY CODE')
     A**********************************************************************
     A*           ACTP      -            CUSTOMER PROGRAMS USED
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R ACTPFM
     A*
     A            STAT5P         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACC##P         5  0       COLHDG('CUSTOMER #')
     A            PROG#1        10          COLHDG('PROGRAM' 'USED')
     A            PROG#2        10          COLHDG('PROGRAM' 'USED')
     A            PROG#3        10          COLHDG('PROGRAM' 'USED')
     A            PROG#4        10          COLHDG('PROGRAM' 'USED')
     A            PROG#5        10          COLHDG('PROGRAM' 'USED')
     A            PROG#6        10          COLHDG('PROGRAM' 'USED')
     A            PROG#7        10          COLHDG('PROGRAM' 'USED')
     A**********************************************************************
     A*           ALCP      -            PRO AMOUNT ALLOCATION FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 005000 00010
     A*         R ALCPFM
     A*
     A            ACRECA$        1          COLHDG('ACTIVE' 'CODE')
     A*                                        * = CONSOL CHG TOTAL
     A            MANF#A$        7  0       COLHDG('MANIFEST #')
     A            ACCT#A$        5  0       COLHDG('ACCOUNT #')
     A            PRO##A$        7  0       COLHDG('PRO NUMBER')
     A            AMOUNA$        9  2       COLHDG('AMOUNT' 'ALLOC')
     A            MANDTA$        7  0       COLHDG('MANF' 'DATE')
     A*                                        NOTE: CYYMMDD
     A**********************************************************************
     A*           BRAN      -            CUSTOMER BRANCH FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 005000 00010
     A*         R BRANFM
     A*
     A            ACRECB         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCT#B         5  0       COLHDG('CUSTOMER #')
     A            ACTYPB         3          COLHDG('ACCOUNT' 'TYPE')
     A            ACTMSB         1          COLHDG('MASTER' 'CODE')
     A            BRNCHB         3  0       COLHDG('OLD' 'BRANCH' 'CODE')
     A            GRPCDB         3  0       COLHDG('GROUP' 'CODE')
     A            BRNAMB        20          COLHDG('BRANCH' 'NAME')
     A            BRAD1B        20          COLHDG('BRANCH' 'ADDR1')
     A            FLAG1B         1          COLHDG('FLAG1')
     A            STOREB         4  0       COLHDG('STORE' 'CODE')
     A**********************************************************************
     A*           BRID      -            BRANCH ID FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00010
     A*         R BRIDFM
     A*
     A            ACRECS         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCT#S         5  0       COLHDG('CUSTOMER #')
     A            SEQNOS         3  0       COLHDG('SEQUENCE''#')
     A            BRNAMS        20          COLHDG('BRANCH' 'NAME')
     A            BRADDS        25          COLHDG('BRANCH' 'ADDRESS')
     A            BRCITS        20          COLHDG('BRANCH' 'CITY')
     A            BRSTAS         2          COLHDG('BRANCH' 'STATE')
     A**********************************************************************
     A*           CADR      -                CONSIGNEE ADDRESS FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 000500 00010
     A*         R CADRFM
     A*
     A            ACCT#Z         5  0       COLHDG('ACCOUNT#')
     A            CADR1Z        25          COLHDG('ADDRESS')
     A            CADR2Z        25          COLHDG('ADDRESS')
     A            CCITYZ        15          COLHDG('CITY')
     A            CSTATZ         2          COLHDG('STATE')
     A            CZIPPZ         5  0       COLHDG('ZIP')
     A* CODE FOR SHIP-TO ADDRESS
     A            STADRZ         3  0       COLHDG('ADDRESS CODE')
     A            DCCODZ         5          COLHDG('DC CODE')
     A* ----------------------------------
     A* FOLLOWING 2 FLDS ADDED FOR TJMAX   added by GAURI
     A*  e.g. acct#z = 6551 TJMAX worcester
     A*                this destination id given by TJMAX is 08
     A*                in field DESTNZ;
     A*                 and location id (also given by TJ MAXX)
     A*                 from where goods for this acct are shipped
     A*                 is in SHFRMZ 06C1...
     A* ----------------------------------
     A            SHFRMZ        12          COLHDG('SHIP-FROM' 'ID')
     A            DESTNZ        12          COLHDG('DEST.' 'ID')
     A            DIVTNZ        12          COLHDG('DIVISION ID')
     A**********************************************************************
     A*           CAMA      -                CAMERA ZIP/PO REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 001000 00010
     A*         R CAMAFM
     A            POSFXFE        1          COLHDG('PO SUFFIX')
     A            ACCT#FE        5  0       COLHDG('ACCOUNT NUMBER')
     A            ZIPALFFE       5          COLHDG('Alpha Outbound Zip')
     A**********************************************************************
     A*           CAMD      -                CAMERA DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CAMDFM
     A            ACRECFD        1          COLHDG('RECORD' 'CODE')
     A            ACCT#FD        5  0       COLHDG('ACCOUNT #')
     A            CTNIDFD       20          COLHDG('CARTON ID')
     A            WREC#FD        7  0       COLHDG('INTERNAL' 'WALSH' +
                                                   'RECEIPT')
     A            IDOORFD        3  0       COLHDG('INBOUND' 'DOOR')
     A            ITRL#FD       11          COLHDG('INBOUND TRAILER')
     A            IDATEFD        8  0       COLHDG('INBOUND DATE')
     A            ITIMEFD        4  0       COLHDG('INBOUND' 'TIME')
     A            IPONOFD       10          COLHDG('INBOUND PO#')
     A            IBERRFD        1          COLHDG('I/B ERROR' 'CLEARED')
     A            CDATEFD        8  0       COLHDG('CAMERA DATE')
     A            CTIMEFD        4  0       COLHDG('CAMERA' 'TIME')
     A            CAMCTFD        2  0       COLHDG('CAMERA' 'COUNT')
     A            CPONOFD       10          COLHDG('CAMERA PO#')
     A***         ZIPCDFD        5  0       COLHDG('DEST. ZIP CODE')
     A            ZIPALFFD       5          COLHDG('Alpha Outbound Zip')
     A            ODATEFD        8  0       COLHDG('OUTBOUND DATE')
     A            OTIMEFD        4  0       COLHDG('OUTBOUND' 'TIME')
     A            OLANEFD        3  0       COLHDG('OUTBOUND' 'LANE')
     A            OBTRLFD        8          COLHDG('OUTBOUND' 'TRAILER')
     A            CONT#FD        3  0       COLHDG('Control Number')
     A            CNVEYFD        1          COLHDG('CONVEYABLE')
     A*                                      N=NOT CONVERYABLE
     A            SHPCTFD        1          COLHDG('SHIPPERS' 'COUNT')
     A            SHIP#FD        7  0       COLHDG('Shipper Number')
     A            STACDFD        1          COLHDG('STATUS' 'CODE')
     A*                                             M=MANIFESTED
     A            MANDDFD        2S 0       COLHDG('MANIFEST' 'DAY')
     A            MANMFD         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANYFD         2S 0       COLHDG('MANIFEST' 'YEAR')
     A**********************************************************************
     A*           CAMH      -                CAMERA HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CAMHFM
     A            ACRECFH        1          COLHDG('RECORD' 'CODE')
     A            ACCT#FH        5  0       COLHDG('ACCOUNT #')
     A            IPONOFH       10          COLHDG('INBOUND PO#')
     A            WREC#FH        7  0       COLHDG('INTERNAL' 'WALSH' +
                                                   'RECEIPT')
     A***         ZIPCDFH        5  0       COLHDG('OUTBOUND' 'ZIP CODE')
     A            ZIPALFFH       5          COLHDG('Alpha Outbound Zip')
     A            EXPCTFH        5  0       COLHDG('EXPECTED COUNT')
     A            ICSCTFH        5  0       COLHDG('ICS COUNT')
     A            CAMCTFH        5  0       COLHDG('CAMERA COUNT')
     A            OUTCTFH        5  0       COLHDG('OUTBOUND COUNT')
     A            STACDFH        1          COLHDG('STATUS CODE')
     A            SHIP#FH        7  0       COLHDG('Shipper Number')
     A            SHIPNFH       25          COLHDG('SHIPPER NAME')
     A            SHAD1FH       25          COLHDG('SHIPPER ADDRESS 1')
     A            SHAD2FH       25          COLHDG('SHIPPER ADDRESS 2')
     A            SHZIPFH        5  0       COLHDG('SHIPPER ZIPCD')
     A            SHSTAFH        2          COLHDG('SHIPPER STATE')
     A            PRO##FH        7  0       COLHDG('PRO NUMBER')
     A            SBL##FH       19          COLHDG('SHIPPERS B/L #')
     A            REC##FH        6  0       COLHDG('RECEIPT #')
     A            DEPTFH         4  0       COLHDG('DEPT #')
     A            RECMMFH        2  0       COLHDG('RECEIPT''MONTH')
     A            RECDDFH        2  0       COLHDG('RECEIPT' 'DAY')
     A            RECYYFH        2  0       COLHDG('RECEIPT' 'YEAR')
     A            CONT#FH        3  0       COLHDG('CONTROL' '#')
     A            VEND#FH        5  0       COLHDG('VENDOR' 'NUMBER')
     A            CRTDTFH        8  0       COLHDG('CREATION' 'DATE')
     A*                                             YYYYMMDD
     A            RECTMFH        4  0       COLHDG('Receipt Time')
     A            CLEARFH        1          COLHDG('Cleared Code')
     A            CLRBYFH        5          COLHDG('Cleared By')
     A            OVRDCFH        1          COLHDG('OVERRIDE Code')
     A*                                     'Y' - YES
     A*                                     ' ' - NO
     A            OVRIDFH        5          COLHDG('OVERRIDE ID')
     A            ACTRCFH        5  0       COLHDG('Actual Received')
     A            PO#11FH       11          COLHDG('PO NUMBER')
     A**********************************************************************
     A*           CARR      -                CARRIER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0015000 005000 00010
     A*         R CARRFM
     A*
     A            ACRECA         1          COLHDG('ACTIVE' 'CODE')
     A            ICAR#A         5  0       COLHDG('CARRIER' 'CODE')
     A            CARRIA        20          COLHDG('CARRIER')
     A            SCACCA         4          COLHDG('SCAC CODE')
     A            TJSIDA        15          COLHDG('TJX SVC ID')
     A            TJACTA         1          COLHDG('TJX' 'ACTIVE')
     A*                                       ' ' = ACTIVE
     A*                                       'N' = NOT ACTIVE
     A**********************************************************************
     A*           CCMT      -                CARRIER COMMENT FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00010
     A*         R CCMTFM
     A*
     A            ICAR#K         5  0       COLHDG('CARRIER' 'CODE')
     A            ACCT#K         5  0       COLHDG('ACCOUNT' 'NUMBER')
     A            COMNTK        30          COLHDG('COMMENT')
     A**********************************************************************
     A*           CHCK      -                CHECK FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R CHCKFM
     A*
     A            ACRECV         1          COLHDG('ACTIVE' 'CODE')
     A*                                           = VALID CHECK
     A*                                         V = VOID CHECK
     A            CHKNOV         6  0       COLHDG('CHECK #')
     A            CONT#V         3  0       COLHDG('CONTROL' '#')
     A            CKAMTV         7  2       COLHDG('CHECK AMOUNT')
     A            CHKYYV         2S 0       COLHDG('CHECK' 'YEAR')
     A            CHKMMV         2S 0       COLHDG('CHECK' 'MONTH')
     A            CHKDDV         2S 0       COLHDG('CHECK' 'DAY')
     A            ICAR#V         5  0       COLHDG('CARRIER' 'CODE')
     A            CARRIV        20          COLHDG('CARRIER')
     A            VOIYYV         2  0       COLHDG('VOID YEAR')
     A            VOIMMV         2  0       COLHDG('VOID MONTH')
     A            VOIDDV         2  0       COLHDG('VOID DAY')
     A            REASNV        25          COLHDG('REASON')
     A*                                                                *****
     A**********************************************************************
     A*           CHMF      -                CHICO'S MANIFEST FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 010000 00010
     A*         R CHMFFM
     A*
     A            ACCTC1         5S 0       COLHDG('ACCOUNT #')
     A            CO01C1         1          COLHDG('COMMA')
     A            MANFC1         7S 0       COLHDG('MANIFEST #')
     A            CO02C1         1          COLHDG('COMMA')
     A            TRLRC1         8          COLHDG('TRAILER #')
     A            CO03C1         1          COLHDG('COMMA')
     A            OCARC1        15          COLHDG('OUTBOUND' 'CARRIER')
     A            CO04C1         1          COLHDG('COMMA')
     A            SEALC1         8          COLHDG('SEAL #')
     A            CO05C1         1          COLHDG('COMMA')
     A            TIMEC1         5          COLHDG('TIME')
     A            CO06C1         1          COLHDG('COMMA')
     A            MANDC1         8          COLHDG('MANIFEST' 'DATE')
     A            CO07C1         1          COLHDG('COMMA')
     A            REC#C1         6S 0       COLHDG('RECEIPT #')
     A            CO08C1         1          COLHDG('COMMA')
     A            SHIPC1        25          COLHDG('SHIPPER' 'NAME')
     A            CO09C1         1          COLHDG('COMMA')
     A            STATC1         2          COLHDG('STATE')
     A            CO10C1         1          COLHDG('COMMA')
     A            CTNQC1         5S 0       COLHDG('CARTON' 'QTY')
     A            CO11C1         1          COLHDG('COMMA')
     A            WGHTC1         5S 0       COLHDG('WEIGHT')
     A            CO12C1         1          COLHDG('COMMA')
     A            ICARC1         8          COLHDG('INBOUND' 'CARRIER')
     A            CO13C1         1          COLHDG('COMMA')
     A            PRO#C1         8S 0       COLHDG('INBOUND' 'PRO#')
     A            CO14C1         1          COLHDG('COMMA')
     A            ADV$C1         8          COLHDG('ADVANCE' 'CHARGE')
     A            CO15C1         1          COLHDG('COMMA')
     A            LIN$C1         8          COLHDG('LINE-HAUL' 'CHARGE')
     A            CO16C1         1          COLHDG('COMMA')
     A            CON$C1         8          COLHDG('CONSOLIDATION' 'CHARGE')
     A            CO17C1         1          COLHDG('COMMA')
     A            TOT$C1         8          COLHDG('TOTAL' 'CHARGE')
     A            CO18C1         1          COLHDG('COMMA')
     A            PONUC1        10          COLHDG('P.O.#')
     A            CO19C1         1          COLHDG('COMMA')
     A            FUE$C1         8          COLHDG('FUEL' 'SURCHARGE')
     A*                                                                *****
     A**********************************************************************
     A*           CHOD      -                CHICO'S ON-DOCK FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 010000 00010
     A*         R CHODFM
     A*
     A            ACCTC2         5S 0       COLHDG('ACCOUNT #')
     A            CO01C2         1          COLHDG('COMMA')
     A            RECPC2         6S 0       COLHDG('RECEIPT #')
     A            CO02C2         1          COLHDG('COMMA')
     A            SHPNC2        25          COLHDG('SHIPPERS' 'NAME')
     A            CO03C2         1          COLHDG('COMMA')
     A            RECDC2         8          COLHDG('RECEIPT' 'DATE')
     A            CO04C2         1          COLHDG('COMMA')
     A            TIMEC2         5          COLHDG('TIME')
     A            CO05C2         1          COLHDG('COMMA')
     A            PONUC2        10          COLHDG('P.O. #')
     A            CO06C2         1          COLHDG('COMMA')
     A            CRTNC2         5S 0       COLHDG('CARTON' 'COUNT')
     A            CO07C2         1          COLHDG('COMMA')
     A            WGHTC2         5S 0       COLHDG('WEIGHT')
     A            CO08C2         1          COLHDG('COMMA')
     A            ICARC2         8          COLHDG('INBOUND' 'CARRIER')
     A            CO09C2         1          COLHDG('COMMA')
     A            ADV$C2         8          COLHDG('ADVANCE' 'CHARGE')
     A*                                                                *****
     A**********************************************************************
     A*           CHOL      -                CHICO'S ON-DOCK FILE  LA
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 010000 00010
     A*         R CHOLFM
     A*
     A            ACCTC3         5S 0       COLHDG('ACCOUNT #')
     A            CO01C3         1          COLHDG('COMMA')
     A            RECPC3         6S 0       COLHDG('RECEIPT #')
     A            CO02C3         1          COLHDG('COMMA')
     A            SHPNC3        25          COLHDG('SHIPPERS' 'NAME')
     A            CO03C3         1          COLHDG('COMMA')
     A            RECDC3         8          COLHDG('RECEIPT' 'DATE')
     A            CO04C3         1          COLHDG('COMMA')
     A            TIMEC3         5          COLHDG('TIME')
     A            CO05C3         1          COLHDG('COMMA')
     A            PONUC3        10          COLHDG('P.O. #')
     A            CO06C3         1          COLHDG('COMMA')
     A            CRTNC3         5S 0       COLHDG('CARTON' 'COUNT')
     A            CO07C3         1          COLHDG('COMMA')
     A            WGHTC3         5S 0       COLHDG('WEIGHT')
     A            CO08C3         1          COLHDG('COMMA')
     A            ICARC3         8          COLHDG('INBOUND' 'CARRIER')
     A            CO09C3         1          COLHDG('COMMA')
     A            ADV$C3         8          COLHDG('ADVANCE' 'CHARGE')
     A*                                                                *****
     A**********************************************************************
     A*           CNPO      -                CANCELLED PO FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 010000 00010
     A*         R CNPOFM
     A*
     A            ACRECP         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       C = CANCELLED
     A*                                       T = TELEPHONE
     A*
     A            ACCT#P         5  0       COLHDG('ACCOUNT' '#')
     A            PONUMP        10          COLHDG('PO#')
     A            DEPT#P         4          COLHDG('DEPT#')
     A            VNAMEP        20          COLHDG('VENDOR' 'NAME')
     A            VCITYP        25          COLHDG('VENDOR' 'CITY')
     A            STRYYP         2S 0       COLHDG('START' 'YEAR')
     A            STRMMP         2S 0       COLHDG('START' 'MONTH')
     A            STRDDP         2S 0       COLHDG('START' 'DAY')
     A            ENDYYP         2S 0       COLHDG('END' 'YEAR')
     A            ENDMMP         2S 0       COLHDG('END' 'MONTH')
     A            ENDDDP         2S 0       COLHDG('END' 'DAY')
     A            ITEM#P         3  0       COLHDG('ITEM' 'NUMBER')
     A            STYLEP         4  0       COLHDG('STYLE' 'NUMBER')
     A            UNIT$P         5  2       COLHDG('UNIT' 'PRICE')
     A            TUNITP         7  0       COLHDG('TOTAL' 'UNITS')
     A            TRETLP        10  2       COLHDG('TOTAL' 'RETAIL')
     A            CNLYYP         2S 0       COLHDG('CANCEL' 'YEAR')
     A            CNLMMP         2S 0       COLHDG('CANCEL' 'MONTH')
     A            CNLDDP         2S 0       COLHDG('CANCEL' 'DAY')
     A            ADDYYP         2S 0       COLHDG('ADD' 'YEAR')
     A            ADDMMP         2S 0       COLHDG('ADD' 'MONTH')
     A            ADDDDP         2S 0       COLHDG('ADD' 'DAY')
     A            UPDYYP         2S 0       COLHDG('UPDATE' 'YEAR')
     A            UPDMMP         2S 0       COLHDG('UPDATE' 'MONTH')
     A            UPDDDP         2S 0       COLHDG('UPDATE' 'DAY')
     A            PO#11P        11          COLHDG('PO' 'NUMBER')
     A**********************************************************************
     A*           CNTR      -                CONTROL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0300000 020000 00010
     A*         R CNTRFM
     A*
     A            ACRECX         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            CONT#X         3  0       COLHDG('CONTROL' '#')
     A            JULIAX         5  0       COLHDG('PROC.DATE..JULIAN')
     A            CTIMEX         4  0       COLHDG('ENTRY''TIME')
     A            BLDG1X         1          COLHDG('BUILDING' '1')
     A            BLDG2X         1          COLHDG('BUILDING' '2')
     A            ICAR#X         5  0       COLHDG('CARRIER' 'CODE')
     A            CARRIX         8          COLHDG('CARRIER')
     A            DRIVEX        10          COLHDG('DRIVER')
     A            VEHICX         6          COLHDG('VEHICLE #')
     A            REMKSX        15          COLHDG('REMARKS')
     A            SPPRTX         1          COLHDG('OVERRIDE' 'PRINT')
     A*
     A*  TOTALS FOR BLDG A ACTIVITY
     A            GOH#AX         5  0       COLHDG('GOH' '#')
     A            CTNSAX         5  0       COLHDG('CARTONS')
     A            BILLAX         3  0       COLHDG('# OF' 'BILLS')
     A            TIMEAX         4  0       COLHDG('TIME' 'UNLOADED')
     A            CHEKAX        12          COLHDG('CHECKED' 'BY')
     A*
     A*  TOTALS FOR BLDG B ACTIVITY
     A            GOH#BX         5  0       COLHDG('GOH' '#')
     A            CTNSBX         5  0       COLHDG('CARTONS')
     A            BILLBX         3  0       COLHDG('# OF' 'BILLS')
     A            TIMEBX         4  0       COLHDG('TIME' 'UNLOADED')
     A            CHEKBX        12          COLHDG('CHECKED' 'BY')
     A*
     A*  RECEIPT STATUS
     A            RECPEX         1          COLHDG('RECEIPTS' 'ENTERED')
     A            RECPPX         1          COLHDG('RECEIPTS' 'PRINTED')
     A            RTIMEX         4  0       COLHDG('TIME' 'PRINTED')
     A            SPECPX         1          COLHDG('SPECIAL' 'CODE')
     A            ADVCKX         1          COLHDG('ADVANCE' 'CHECK PAID')
     A*                                          P = PAID
     A            BLDG3X         1          COLHDG('MIXED FREIGHT')
     A*                                     'Y' MIXED FREIGHT
     A            BLDG4X         1          COLHDG('NOT USED')
     A            BLDG5X         1          COLHDG('CONTAINER CODE')
     A*                                     'I' IMPORT
     A*                                     ' ' DOMESTIC
     A*                                     'P' PORT OF ENTRY
     A*
     A* THIS CODE IS FOR WHAT BUILDING IT CAME FROM.
     A            BLDCDX         2          COLHDG('FROM' 'TERMINAL')
     A*
     A            UPDYYX         2S 0       COLHDG('UNLOAD' 'YEAR')
     A            UPDMMX         2S 0       COLHDG('UNLOAD' 'MONTH')
     A            UPDDDX         2S 0       COLHDG('UNLOAD' 'DAY')
     A            UPDCNX         1S 0       COLHDG('CENTURY CODE')
     A            VEHIDX        15          COLHDG('VEHICLE ID')
     A            SEAL#X         7  0       COLHDG('SEAL #')
     A            SUBHLX        10          COLHDG('SUB-HAULERS')
     A            TOTQTX         5  0       COLHDG('TRAILER QTY')
     A            PROCTX         3  0       COLHDG('PRO COUNT')
     A            UNLD#X         7  0       COLHDG('UNLOADING #')
     A            TOTGHX         5  0       COLHDG('GOH TOTAL')
     A            SLOT#X         5  0       COLHDG('SLOT #')
     A            ARRDTX         7  0       COLHDG('ARRIVED DATE')
     A            EMPTTX         7  0       COLHDG('EMPTY DATE')
     A            BAGRTX         1          COLHDG('BAG RETURNED')
     A*                                     Y = BAG RETURNED
     A*                                       = NOT RETURNED YET
     A            PAPDTX         7  0       COLHDG('PAPER DATE')
     A            LN944X         1          COLHDG('LOG NET CODE')
     A**********************************************************************
     A*           COMP      -                WALSH COMPANY MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000050 00010
     A*         R COMPFM
     A*
     A            ACRECO         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            COCODO         3  0       COLHDG('N.R.C. CODE')
     A            CONAMO        25          COLHDG('COMPANY' 'NAME')
     A            ADDR1O        25          COLHDG('ADDRESS' 'LINE 1')
     A            ADDR2O        25          COLHDG('ADDRESS' 'LINE 2')
     A            ADDR3O        25          COLHDG('ADDRESS' 'LINE 3')
     A            AREACO         3  0       COLHDG('AREA CODE')
     A            EXCHGO         3  0       COLHDG('EXCHANGE')
     A            PHONEO         4  0       COLHDG('PHONE')
     A            THEIRO        12          COLHDG('THEIR' 'ID')
     A**********************************************************************
     A*           COND      -              CONSOL. TOTALS DAILY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0020000 010000 00010
     A*         R CONDFM
     A*
     A            SYSID3         1          COLHDG('SYSTEM ID')
     A            ACCT#3         5  0       COLHDG('ACCOUNT #')
     A            YEAR#3         4S 0       COLHDG('YEAR')
     A            MONTH3         2S 0       COLHDG('MONTH')
     A            DAYYY3         2S 0       COLHDG('DAY')
     A            CRTNO3         7  0       COLHDG('CARTONS OUTSIDE')
     A            WGHTO3         7  0       COLHDG('WEIGHT OUTSIDE')
     A            GOHHO3         7  0       COLHDG('GARMENTS OUTSIDE')
     A            CRTNL3         7  0       COLHDG('NRC CARTONS')
     A            WGHTL3         7  0       COLHDG('NRC WEIGHT')
     A            GOHHL3         7  0       COLHDG('NRC GARMENTS')
     A            CRTNT3         7  0       COLHDG('NRT CRTNS' ' OUTSIDE AREA')
     A            WGHTT3         7  0       COLHDG('NRT WEIGHT' 'OUTSIDE AREA')
     A            GOHHT3         7  0       COLHDG('NRT GARMENT' 'OUTSIDE AREA')
     A            CRTNN3         7  0       COLHDG('NRT CARTONS')
     A            WGHTN3         7  0       COLHDG('NRT WEIGHT')
     A            GOHHN3         7  0       COLHDG('NRT GARMENTS')
     A            CRTNH3         7  0       COLHDG('HOUSE CARTONS')
     A            WGHTH3         7  0       COLHDG('WEIGHT HOUSE')
     A            GOHHH3         7  0       COLHDG('GARMENTS HOUSE')
     A**********************************************************************
     A*           CONG      -                ACCOUNT MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001500 000500 00010
     A*         R CONGFM
     A*
     A            ACRECU         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCT#U         5  0       COLHDG('ACCOUNT' '#')
     A            GRPCDU         3          COLHDG('GROUP' 'ACCOUNT' 'CODE')
     A            MASTRU         1          COLHDG('MASTER' 'ACCT' 'CODE')
     A            COCODU         3  0       COLHDG('WALSH' 'COMPANY CODE')
     A            ACNAMU        25          COLHDG('ACCOUNT' 'NAME')
     A            ADDR1U        25          COLHDG('ADDRESS' 'LINE 1')
     A            ADDR2U        25          COLHDG('ADDRESS' 'LINE 2')
     A            ADDR3U        25          COLHDG('ADDRESS' 'LINE 3')
     A            STATEU         2          COLHDG('STATE')
     A            ZIPCDU         5  0       COLHDG('ZIP' 'CODE')
     A            BILLTU         5  0       COLHDG('BILL TO' 'ACCT#')
     A            BRNCDU         1          COLHDG('MULTIPLE' 'BRANCHES')
     A*                                      Y = MULTIPLE BRANCHES
     A            SADR1U        25          COLHDG('SHIP ADDRESS' 'LINE 1')
     A            SADR2U        25          COLHDG('SHIP ADDRESS' 'LINE 2')
     A            SADR3U        25          COLHDG('SHIP ADDRESS' 'LINE 3')
     A* CONTROL # S & RECEIPT CONTROL
     A            REC##U         6  0       COLHDG('START' 'RECEIPT #')
     A            KEYREU         6  0       COLHDG('START' 'KEYREC')
     A            SMNF#U         7  0       COLHDG('START' 'MANFIEST')
     A            CHECKU         1          COLHDG('TYPE OF' 'CK DIGIT')
     A*
     A            CTNABU         1          COLHDG('CARTONS' 'A/B')
     A            GOHABU         1          COLHDG('GOH' 'A/B')
     A            HANGCU         1          COLHDG('HANG CARDS' 'REQ.')
     A*                                            Y = HANG CARDS PRINT
     A*
     A* MANIFEST CODES & CHARGES
     A            WSSCNU         1          COLHDG('WSS INB.' 'NO CONSOL')
     A*                                      N = NO CONSOL CHG IF WSS
     A            WSSLHU         1          COLHDG('WSS INB' 'NO LINE H')
     A*                                      N = NO L-HAUL CHG IF WSS
     A            WPUCNU         1          COLHDG('WPU INB.' 'NO CONSOL')
     A*                                      N = NO CONSOL CHG IF CARGO
     A            WPULHU         1          COLHDG('WPU INB' 'NO LINE H')
     A*                                      N = NO L-HAUL CHG IF CARGO
     A            ALLOCU         1          COLHDG('BILL' 'L-HAUL')
     A*                                      N = DO NOT BILL L-HAUL
     A            NOADVU         1          COLHDG('BILL ADV' 'CHGS')
     A*                                      N = DO NOT BILL ADV CHG
     A*                                      T = LOOK IN FILE "PCAR" PROTECT IF
     A            RATCDU         1          COLHDG('RATE CODE')
     A*                                        = FLAT RATE
     A*                                      A = CTNS BY WT RANGE,GOH BY TYPE
     A*                                      B = CTNS BY WT RANGE,GOH BY QTY
     A*                                      C = FLAT RATE 40',45' 1/2 DRIVERS
     A*                                      D = FLAT RATE 40',45' 1/2 PUPPS
     A*                                      E = PER CTN QTY, BY TYPE FOR GOH
     A*                                      F = FLAT RATE BY DESTINATION
     A*                                      G = FLAT RATE BY TRAIL/CARR
     A*                                      H = CALCULATE STOP OFF CHG.
     A*                                      J = CTN BY WGT GOH BY WGT RANGE
     A*                                      K = BASE ON WEIGHT FOR MULT ACCOUNT
     A*                                      L = FLAT 45/ PUPS 1-2/ PUPS 1-2 2DR
     A            COMMUU         1          COLHDG('COMMUNICATION' 'CODE')
     A*                                      1 = TELE 80  PRINT FORMAT
     A*                                      2 = TELE 82  PRINT FORMAT
     A*                                      3 = TELE 128 PRINT FORMAT
     A*                                      4 = TELE ?   RECORD FORMAT
     A            SYSIDU         1          COLHDG('ACCOUNT' 'TYPE')
     A*                                         1 = WALSH
     A*                                         2 = FEDERATED A
     A*                                         3 = FEDERATED B
     A*                                         4 = LERNER
     A*                                         5 = TRI STATE
     A*                                         6 = J W MAYS
     A*                                         7 = WEST COAST
     A*                                         8 = MARSHALLS COL
     A*                                         9 = MARSHALLS AVON
     A*                                         G = GLOC. FILENES
     A*                                         P = MARSHALLS PENN
     A*                                         Z = GREENSBORO
     A            SUR$$U         4  3       COLHDG('% SURCHARGE')
     A*----------------------------------------------------------------
     A* CONSOLIDATION RATES
     A*     ADDITIONAL CHARGES AT END OF FILE
     A*----------------------------------------------------------------
     A*
     A* GENERAL RATES
     A            GOHINU         1          COLHDG('GOH' 'INCENTIVE')
     A*                                       I = USE GOH INSENTIVE TABLE
     A            GOHRTU         5  4       COLHDG('GOH' 'RATE')
     A            GOHRSU         5  4       COLHDG('SPECIAL' 'RATE')
     A            CTNUNU         5  4       COLHDG('CTN UNIT' 'RATE')
     A            CTNWGU         5  5       COLHDG('CTN WGT' 'RATE/1LB')
     A            CTNSPU         5  5       COLHDG('SPECIAL' 'CTN RATE')
     A*
     A* CQ ARRAY - CONSOLIDATION GARMENT QTY RANGES
     A            COQT1U         5  0       COLHDG('GOH QTY' 'RANGE1')
     A            COQT2U         5  0       COLHDG('GOH QTY' 'RANGE2')
     A            COQT3U         5  0       COLHDG('GOH QTY' 'RANGE3')
     A            COQT4U         5  0       COLHDG('GOH QTY' 'RANGE4')
     A            COQT5U         5  0       COLHDG('GOH QTY' 'RANGE5')
     A            COQT6U         5  0       COLHDG('GOH QTY' 'RANGE6')
     A*
     A* CR ARRAY - CONSOLIDATION GARMENT RATES
     A            COHG1U         5  4       COLHDG('GOH' 'RATE 1')
     A            COHG2U         5  4       COLHDG('GOH' 'RATE 2')
     A            COHG3U         5  4       COLHDG('GOH' 'RATE 3')
     A            COHG4U         5  4       COLHDG('GOH' 'RATE 4')
     A            COHG5U         5  4       COLHDG('GOH' 'RATE 5')
     A            COHG6U         5  4       COLHDG('GOH' 'RATE 6')
     A*----------------------------------------------------------------
     A* LINE HAUL RATES - CARTONS & WEIGHT
     A*----------------------------------------------------------------
     A*
     A* MIN & MAX LINE HAUL FLAT FEES & CARTON COUNT RATE
     A            LHMINU         7  2       COLHDG('MINIMUM' 'LINE HAUL')
     A            LHMAXU         7  2       COLHDG('MAXIMUM' 'LINE HAUL')
     A            LH1CTU         5  4       COLHDG('RATE PER 1 CARTON')
     A*
     A* TF ARRAY - LINE HAUL FLAT FEE PER TRAILER
     A            LH1TFU         7  2       COLHDG('LINE HAUL' 'RATE 1')
     A            LH2TFU         7  2       COLHDG('LINE HAUL' 'RATE 2')
     A            LH3TFU         7  2       COLHDG('LINE HAUL' 'RATE 3')
     A            LH4TFU         7  2       COLHDG('LINE HAUL' 'RATE 4')
     A            LH5TFU         7  2       COLHDG('LINE HAUL' 'RATE 5')
     A            LH6TFU         7  2       COLHDG('LINE HAUL' 'RATE 6')
     A*
     A* W# ARRAY - LINE HAUL RATE PER POUND OF WEIGHT
     A            LH1W#U         7  4       COLHDG('LINE HAUL' 'RATE 1')
     A            LH2W#U         7  4       COLHDG('LINE HAUL' 'RATE 2')
     A            LH3W#U         7  4       COLHDG('LINE HAUL' 'RATE 3')
     A            LH4W#U         7  4       COLHDG('LINE HAUL' 'RATE 4')
     A            LH5W#U         7  4       COLHDG('LINE HAUL' 'RATE 5')
     A            LH6W#U         7  4       COLHDG('LINE HAUL' 'RATE 6')
     A*
     A* WT ARRAY - WEIGHT RANGES
     A            WT1CGU         7  0       COLHDG('WEIGHT' 'RANGE1')
     A            WT2CGU         7  0       COLHDG('WEIGHT' 'RANGE2')
     A            WT3CGU         7  0       COLHDG('WEIGHT' 'RANGE3')
     A            WT4CGU         7  0       COLHDG('WEIGHT' 'RANGE4')
     A            WT5CGU         7  0       COLHDG('WEIGHT' 'RANGE5')
     A            WT6CGU         7  0       COLHDG('WEIGHT' 'RANGE6')
     A*
     A* DE ARRAY - DESTINATIONS
     A            DES01U         3          COLHDG('DESTINATION')
     A            DES02U         3          COLHDG('DESTINATION')
     A            DES03U         3          COLHDG('DESTINATION')
     A            DES04U         3          COLHDG('DESTINATION')
     A            DES05U         3          COLHDG('DESTINATION')
     A            DES06U         3          COLHDG('DESTINATION')
     A*----------------------------------------------------------------
     A* LINE HAUL RATES - GARMENTS
     A*----------------------------------------------------------------
     A*
     A* MIN & MAX LINE HAUL FEES
     A            GHMINU         7  2       COLHDG('GOH MINIMUM')
     A            GHMAXU         7  2       COLHDG('GOH MAXIMUM')
     A*
     A* QT ARRAY - GARMENT QTY RANGES
     A            GHQT1U         5  0       COLHDG('GOH QTY' 'RANGE1')
     A            GHQT2U         5  0       COLHDG('GOH QTY' 'RANGE2')
     A            GHQT3U         5  0       COLHDG('GOH QTY' 'RANGE3')
     A            GHQT4U         5  0       COLHDG('GOH QTY' 'RANGE4')
     A            GHQT5U         5  0       COLHDG('GOH QTY' 'RANGE5')
     A            GHQT6U         5  0       COLHDG('GOH QTY' 'RANGE6')
     A*
     A* HG ARRAY - GARMENT RATES
     A            GHHG1U         5  4       COLHDG('GOH' 'RATE 1')
     A            GHHG2U         5  4       COLHDG('GOH' 'RATE 2')
     A            GHHG3U         5  4       COLHDG('GOH' 'RATE 3')
     A            GHHG4U         5  4       COLHDG('GOH' 'RATE 4')
     A            GHHG5U         5  4       COLHDG('GOH' 'RATE 5')
     A            GHHG6U         5  4       COLHDG('GOH' 'RATE 6')
     A*
     A* T0 ARRAY - GARMENT TYPES
     A            GHT01U         3  0       COLHDG('GARMENT TYPE')
     A            GHT02U         3  0       COLHDG('GARMENT TYPE')
     A            GHT03U         3  0       COLHDG('GARMENT TYPE')
     A            GHT04U         3  0       COLHDG('GARMENT TYPE')
     A            GHT05U         3  0       COLHDG('GARMENT TYPE')
     A            GHT06U         3  0       COLHDG('GARMENT TYPE')
     A            GHT07U         3  0       COLHDG('GARMENT TYPE')
     A            GHT08U         3  0       COLHDG('GARMENT TYPE')
     A            GHT09U         3  0       COLHDG('GARMENT TYPE')
     A            GHT10U         3  0       COLHDG('GARMENT TYPE')
     A*
     A* TR ARRAY - GARMENT TYPE RATES
     A            GHR01U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR02U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR03U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR04U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR05U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR06U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR07U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR08U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR09U         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR10U         7  4       COLHDG('GARMENT TYPE RATE')
     A*
     A* CT ARRAY - CARTON TO HANG RATES
     A            CTHG1U         5  3       COLHDG('CTN/GOH' 'RATE 1')
     A            CTHG2U         5  3       COLHDG('CTN/GOH' 'RATE 2')
     A            CTHG3U         5  3       COLHDG('CTN/GOH' 'RATE 3')
     A            CTHG4U         5  3       COLHDG('CTN/GOH' 'RATE 4')
     A            CTHG5U         5  3       COLHDG('CTN/GOH' 'RATE 5')
     A            CTHG6U         5  3       COLHDG('CTN/GOH' 'RATE 6')
     A            CTHG7U         5  3       COLHDG('CTN/GOH' 'RATE 7')
     A            CTHG8U         5  3       COLHDG('CTN/GOH' 'RATE 8')
     A*----------------------------------------------------------------
     A* WALSH PICK-UP RATES & CHARGES
     A*----------------------------------------------------------------
     A*
     A* RANGES & MAX AMTS
     A            FWGTRU         7  0       COLHDG('FROM WGT' 'RANGE')
     A            TWGTRU         7  0       COLHDG('TO WGT' 'RANGE')
     A            MINAMU         7  2       COLHDG('MINIMUM' 'AMT')
     A            MAXAMU         7  2       COLHDG('MAXIMUM' 'AMOUNT')
     A*
     A* GARMENT PICK UP CODES
     A            GHCL1U         2  0       COLHDG('GOH' 'PU CLASS 1')
     A            GHCL2U         2  0       COLHDG('GOH' 'PU CLASS 2')
     A            GHCL3U         2  0       COLHDG('GOH' 'PU CLASS 3')
     A            GHCL4U         2  0       COLHDG('GOH' 'PU CLASS 4')
     A            GHCL5U         2  0       COLHDG('GOH' 'PU CLASS 5')
     A            GHCL6U         2  0       COLHDG('GOH' 'PU CLASS 6')
     A            GHCL7U         2  0       COLHDG('GOH' 'PU CLASS 7')
     A            GHCL8U         2  0       COLHDG('GOH' 'PU CLASS 8')
     A            GHCL9U         2  0       COLHDG('GOH' 'PU CLASS 9')
     A            GHCL0U         2  0       COLHDG('GOH' 'PU CLASS 10')
     A*
     A* GARMENT P/U CLASSS
     A            GHRT1U         5  4       COLHDG('GOH' 'PU RATE 1')
     A            GHRT2U         5  4       COLHDG('GOH' 'PU RATE 2')
     A            GHRT3U         5  4       COLHDG('GOH' 'PU RATE 3')
     A            GHRT4U         5  4       COLHDG('GOH' 'PU RATE 4')
     A            GHRT5U         5  4       COLHDG('GOH' 'PU RATE 5')
     A            GHRT6U         5  4       COLHDG('GOH' 'PU RATE 6')
     A            GHRT7U         5  4       COLHDG('GOH' 'PU RATE 7')
     A            GHRT8U         5  4       COLHDG('GOH' 'PU RATE 8')
     A            GHRT9U         5  4       COLHDG('GOH' 'PU RATE 9')
     A            GHRT0U         5  4       COLHDG('GOH' 'PU RATE 10')
     A*
     A* CARTON WEIGHT CLASS
     A            CTCL1U         5  0       COLHDG('CTN/WGT' 'CLASS 1')
     A            CTCL2U         5  0       COLHDG('CTN/WGT' 'CLASS 2')
     A            CTCL3U         5  0       COLHDG('CTN/WGT' 'CLASS 3')
     A            CTCL4U         5  0       COLHDG('CTN/WGT' 'CLASS 4')
     A            CTCL5U         5  0       COLHDG('CTN/WGT' 'CLASS 5')
     A            CTCL6U         5  0       COLHDG('CTN/WGT' 'CLASS 6')
     A*
     A* CARTON CLASS/RATES
     A            CTRT1U         5  2       COLHDG('CTN/CLS' 'RATE 1')
     A            CTRT2U         5  2       COLHDG('CTN/CLS' 'RATE 2')
     A            CTRT3U         5  2       COLHDG('CTN/CLS' 'RATE 3')
     A            CTRT4U         5  2       COLHDG('CTN/CLS' 'RATE 4')
     A            CTRT5U         5  2       COLHDG('CTN/CLS' 'RATE 5')
     A            CTRT6U         5  2       COLHDG('CTN/CLS' 'RATE 6')
     A*
     A* P/U MIN AMTS
     A            MINCTU         7  2       COLHDG('CTN MIN' 'AMT')
     A            MINGHU         7  2       COLHDG('GOH MIN' 'AMOUNT')
     A*----------------------------------------------------------------
     A* OTHER CHARGES
     A*----------------------------------------------------------------
     A            MANF$U         5  2       COLHDG('MANIFEST' 'CHARGE')
     A            APRN$U         5  2       COLHDG('APRON ' 'CHARGE')
     A            TRNM$U         5  2       COLHDG('TRANSMISSION' 'CHARGE')
     A            LTLF$U         3  3       COLHDG('LTL FUEL' 'SURCHARGE')
     A            TLFL$U         3  3       COLHDG('TL FUEL' 'SURCHARGE')
     A            LINE$U         4  3       COLHDG('LINE ITEM' 'CHARGE')
     A*----------------------------------------------------------------
     A* CANCELLED PO TREATMENT
     A*----------------------------------------------------------------
     A            NONPOU         1          COLHDG('NO PO ON FILE')
     A            CNLPOU         1          COLHDG('CANCEL PO')
     A            DATPOU         1          COLHDG('OUT OF DATE PO')
     A*                                        FOR ALL 3 FIELDS ABOVE:
     A*                                          = DISREGARD
     A*                                        L = ACCEPT & LOG
     A*                                        R = REJECT & LOG
     A*                                        N = REJECT & NO LOG
     A            MINMFU         7  2       COLHDG('MIN TOT CG PER MANIF')
     A*
     A*----------------------------------------------------------------
     A* MISCELLANEOUS CODES
     A*----------------------------------------------------------------
     A            PRINVU         1          COLHDG('PRINT WALSH INV')
     A*                                          = YES
     A*                                        N = BYPASS PRINT
     A*
     A*----------------------------------------------------------------
     A* ADDITIONAL CONSOLIDATION CHARGES - FLAT FEE
     A*----------------------------------------------------------------
     A            FLCCHU         7  2       COLHDG('FLAT CHG PER TRAILER')
     A*               THE ABOVE TO BE PRO-RATED THRU-OUT ALL RECEIPTS
     A*               IN THE CONS. CHG. THIS FIELD IS THE POS/SEC. CHARGE
     A*               THAT WILL ONLY BE DONE IF THE OUTBOUND CARRIER IS NOT
     A*               NRT THIS CALC. WILL BE DONE IN RATE2 PROGRAM AND THE
     A*               PRINTOUT OF THE MANIFEST. THIS CHANGE WAS DONE ON
     A*               6/21/85 BY FRANK/JIM.
     A*
     A*----------------------------------------------------------------
     A* ADDITIONAL CONSOLIDATION FLAGS FOR COLOR AND SIZE
     A*----------------------------------------------------------------
     A            CLRCTU         1          COLHDG('X=CLR/SZE CARTON')
     A*                            X=COLOR/SIZE TO BE DONE FOR CARTONS
     A*                        BLANK=COLOR/SIZE NOT TO BE DONE FOR CARTONS
     A*
     A            CLRGHU         1          COLHDG('X=CLR/SZE GARMNT')
     A*                            X=COLOR/SIZE TO BE DONE FOR GARMENTS
     A*                        BLANK=COLOR/SIZE NOT TO BE DONE FOR GARMENTS
     A*
     A            POSCHU         7  2       COLHDG('POS./SECURITY CHARGE')
     A*
     A*
     A            APRSQU         5  0       COLHDG('APRON SEQ#')
     A*                         THIS # IS ASSIGN DURING APRON PROGRAM FOR
     A*                         EITHER RECEIPT OR IF THERE IS MULT.
     A*                         PO# EACH PO# WILL HAVE ITS ON APRSQC #.
     A* THIS IS THE AMOUNT WE REBATE IF TRAILER IS UNLOADED BY CUSTOMER
     A            STRPDU         5  2       COLHDG('STRIP DEDUCTION')
     A*----------------------------------------------------------------
     A* AMOUNT TO BE ADDED TO CONSL. IN WHICH EACH RECEIPT WOULD BE
     A* PRO RATED.
     A            ADCONU         7  2       COLHDG('ADD TO CONSL')
     A*
     A* LINE HAUL TO BE ADDED TO RECEIPT BUT NOT TO DEPT OF ALLOCATION
     A            NOALLU         1          COLHDG('DEPT. OF ALLOC')
     A*                                     ' ' = YES
     A*                                     'N' = NO
     A*
     A* FOR DEPT FILE COLOR/SIZE OR LOAD CODE ON RECIPT
     A            DEPTFU         1          COLHDG('DEPT. FILE')
     A*                                     ' ' = YES
     A*                                     'N' = NO
     A*
     A* FOR DEPT FILE COLOR/SIZE OR LOAD CODE ON RECIPT
     A            NOWPUU         1          COLHDG('NO WPU FOR ACT')
     A*                                     ' ' = YES
     A*                                     'N' = NO
     A*
     A* QT ARRAY - GARMENT WEIGHT FOR LINE HAUL CHARGES
     A* THIS GOES WITH LINES AREA OF 390 IN FLDREF
     A*
     A            GHWT1U         5  0       COLHDG('GOH WGH' 'RANGE1')
     A            GHWT2U         5  0       COLHDG('GOH WGH' 'RANGE2')
     A            GHWT3U         5  0       COLHDG('GOH WGH' 'RANGE3')
     A            GHWT4U         5  0       COLHDG('GOH WGH' 'RANGE4')
     A            GHWT5U         5  0       COLHDG('GOH WGH' 'RANGE5')
     A            GHWT6U         5  0       COLHDG('GOH WGH' 'RANGE6')
     A*
     A* FLAT CHARGE PRO RATED ON NUMBER OF STOPS ON TRAILER
     A            FLTCHU         1          COLHDG('FLAT CHARGE')
     A*                                     'Y' = YES
     A            FL1TFU         7  2       COLHDG('FLAT CHG' '1 STOPS')
     A            FL2TFU         7  2       COLHDG('FLAT CHG' '2 STOPS')
     A            FL3TFU         7  2       COLHDG('FLAT CHG' '3 STOPS')
     A            FL4TFU         7  2       COLHDG('FLAT CHG' '4 STOPS')
     A            FL5TFU         7  2       COLHDG('FLAT CHG' '5 STOPS')
     A            FL6TFU         7  2       COLHDG('FLAT CHG' '6 STOPS')
     A*
     A**********************************************************************
     A*           CTRR      -                CONTROL RECORD SEQUENCE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000500 00010
     A*         R CTRRFM
     A*
     A            SCONTR         3  0       COLHDG('START CONTROL' '#')
     A            ECONTR         3  0       COLHDG('END CONTROL' '#')
     A            SYSCDR         1          COLHDG('SYSTEM' 'CODE')
     A            LOCATR        25          COLHDG('LOCATION')
     A            USERPR        10          COLHDG('USER PROFILE')
     A            BLDMGR         1          COLHDG('BUILDING' 'CODE')
     A            TER##R         2  0       COLHDG('TERM CODE')
     A*
     A**********************************************************************
     A*           CUST      -                ACCOUNT MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001500 000500 00010
     A*         R CUSTFM
     A*
     A            ACRECC         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCT#C         5  0       COLHDG('ACCOUNT' '#')
     A            GRPCDC         3          COLHDG('GROUP' 'ACCOUNT' 'CODE')
     A            MASTRC         1          COLHDG('MASTER' 'ACCT' 'CODE')
     A            COCODC         3  0       COLHDG('WALSH' 'COMPANY CODE')
     A            ACNAMC        25          COLHDG('ACCOUNT' 'NAME')
     A            ADDR1C        25          COLHDG('ADDRESS' 'LINE 1')
     A            ADDR2C        25          COLHDG('ADDRESS' 'LINE 2')
     A            ADDR3C        25          COLHDG('ADDRESS' 'LINE 3')
     A            STATEC         2          COLHDG('STATE')
     A            ZIPCDC         5  0       COLHDG('ZIP' 'CODE')
     A            BILLTC         5  0       COLHDG('BILL TO' 'ACCT#')
     A            BRNCDC         1          COLHDG('MULTIPLE' 'BRANCHES')
     A*                                      Y = MULTIPLE BRANCHES
     A            SADR1C        25          COLHDG('SHIP ADDRESS' 'LINE 1')
     A            SADR2C        25          COLHDG('SHIP ADDRESS' 'LINE 2')
     A            SADR3C        25          COLHDG('SHIP ADDRESS' 'LINE 3')
     A* CONTROL # S & RECEIPT CONTROL
     A            REC##C         6  0       COLHDG('START' 'RECEIPT #')
     A            KEYREC         6  0       COLHDG('START' 'KEYREC')
     A            SMNF#C         7  0       COLHDG('START' 'MANFIEST')
     A            CHECKC         1          COLHDG('TYPE OF' 'CK DIGIT')
     A*
     A            CTNABC         1          COLHDG('CARTONS' 'A/B')
     A            GOHABC         1          COLHDG('GOH' 'A/B')
     A            HANGCC         1          COLHDG('HANG CARDS' 'REQ.')
     A*                                            Y = HANG CARDS PRINT
     A*
     A* MANIFEST CODES & CHARGES
     A            WSSCNC         1          COLHDG('WSS INB.' 'NO CONSOL')
     A*                                      N = NO CONSOL CHG IF WSS
     A            WSSLHC         1          COLHDG('WSS INB' 'NO LINE H')
     A*                                      N = NO L-HAUL CHG IF WSS
     A            WPUCNC         1          COLHDG('WPU INB.' 'NO CONSOL')
     A*                                      N = NO CONSOL CHG IF CARGO
     A            WPULHC         1          COLHDG('WPU INB' 'NO LINE H')
     A*                                      N = NO L-HAUL CHG IF CARGO
     A            ALLOCC         1          COLHDG('BILL' 'L-HAUL')
     A*                                      N = DO NOT BILL L-HAUL
     A            NOADVC         1          COLHDG('BILL ADV' 'CHGS')
     A*                                      N = DO NOT BILL ADV CHG
     A*                                      T = LOOK IN FILE "PCAR" PROTECT IF
     A            RATCDC         1          COLHDG('RATE CODE')
     A*                                        = FLAT RATE
     A*                                      A = CTNS BY WT RANGE,GOH BY TYPE
     A*                                      B = CTNS BY WT RANGE,GOH BY QTY
     A*                                      C = FLAT RATE 40',45' 1/2 DRIVERS
     A*                                      D = FLAT RATE 40',45' 1/2 PUPPS
     A*                                      E = PER CTN QTY, BY TYPE FOR GOH
     A*                                      F = FLAT RATE BY DESTINATION
     A*                                      G = FLAT RATE BY TRAIL/CARR
     A*                                      H = CALCULATE STOP OFF CHG.
     A*                                      I = CALCULATE WERE TRAILER IS GOING
     A*                                      J = CTN BY WGT GOH BY WGT RANGE
     A*                                      K = BASE ON WEIGHT FOR MULT ACCOUNT
     A*                                      L = FLAT 45/ PUPS 1-2/ PUPS 1-2 2DR
     A            COMMUC         1          COLHDG('COMMUNICATION' 'CODE')
     A*                                      1 = TELE 80  PRINT FORMAT
     A*                                      2 = TELE 82  PRINT FORMAT
     A*                                      3 = TELE 128 PRINT FORMAT
     A*                                      4 = TELE ?   RECORD FORMAT
     A            SYSIDC         1          COLHDG('ACCOUNT' 'TYPE')
     A*                                         1 = FEDERATED A
     A*                                         2 = BUIDLING  A
     A*                                         3 = BUILDING  A
     A*                                         4 = NOT USED
     A*                                         5 = NOT USED
     A*                                         6 = DAYTON GROUP
     A*                                         7 = WEST COAST
     A*                                         9 = AVON OPERATION
     A*                                         G = CIMM.
     A*                                         O = BUILDING C
     A*                                         P = MARSHALLS PENN
     A*                                         F = FLORIDA
     A*                                         T = BUILDING B
     A*                                         Z = ATLANTA
     A            SUR$$C         4  3       COLHDG('% SURCHARGE')
     A*----------------------------------------------------------------
     A* CONSOLIDATION RATES
     A*     ADDITIONAL CHARGES AT END OF FILE
     A*----------------------------------------------------------------
     A*
     A* GENERAL RATES
     A            GOHINC         1          COLHDG('GOH' 'INCENTIVE')
     A*                                       I = USE GOH INSENTIVE TABLE
     A            GOHRTC         5  4       COLHDG('GOH' 'RATE')
     A            GOHRSC         5  4       COLHDG('SPECIAL' 'RATE')
     A            CTNUNC         5  4       COLHDG('CTN UNIT' 'RATE')
     A            CTNWGC         5  5       COLHDG('CTN WGT' 'RATE/1LB')
     A            CTNSPC         5  5       COLHDG('SPECIAL' 'CTN RATE')
     A*
     A* CQ ARRAY - CONSOLIDATION GARMENT QTY RANGES
     A            COQT1C         5  0       COLHDG('GOH QTY' 'RANGE1')
     A            COQT2C         5  0       COLHDG('GOH QTY' 'RANGE2')
     A            COQT3C         5  0       COLHDG('GOH QTY' 'RANGE3')
     A            COQT4C         5  0       COLHDG('GOH QTY' 'RANGE4')
     A            COQT5C         5  0       COLHDG('GOH QTY' 'RANGE5')
     A            COQT6C         5  0       COLHDG('GOH QTY' 'RANGE6')
     A*
     A* CR ARRAY - CONSOLIDATION GARMENT RATES
     A            COHG1C         5  4       COLHDG('GOH' 'RATE 1')
     A            COHG2C         5  4       COLHDG('GOH' 'RATE 2')
     A            COHG3C         5  4       COLHDG('GOH' 'RATE 3')
     A            COHG4C         5  4       COLHDG('GOH' 'RATE 4')
     A            COHG5C         5  4       COLHDG('GOH' 'RATE 5')
     A            COHG6C         5  4       COLHDG('GOH' 'RATE 6')
     A*----------------------------------------------------------------
     A* LINE HAUL RATES - CARTONS & WEIGHT
     A*----------------------------------------------------------------
     A*
     A* MIN & MAX LINE HAUL FLAT FEES & CARTON COUNT RATE
     A            LHMINC         7  2       COLHDG('MINIMUM' 'LINE HAUL')
     A            LHMAXC         7  2       COLHDG('MAXIMUM' 'LINE HAUL')
     A            LH1CTC         5  4       COLHDG('RATE PER 1 CARTON')
     A*
     A* TF ARRAY - LINE HAUL FLAT FEE PER TRAILER
     A            LH1TFC         7  2       COLHDG('LINE HAUL' 'RATE 1')
     A            LH2TFC         7  2       COLHDG('LINE HAUL' 'RATE 2')
     A            LH3TFC         7  2       COLHDG('LINE HAUL' 'RATE 3')
     A            LH4TFC         7  2       COLHDG('LINE HAUL' 'RATE 4')
     A            LH5TFC         7  2       COLHDG('LINE HAUL' 'RATE 5')
     A            LH6TFC         7  2       COLHDG('LINE HAUL' 'RATE 6')
     A*
     A* W# ARRAY - LINE HAUL RATE PER POUND OF WEIGHT
     A            LH1W#C         7  4       COLHDG('LINE HAUL' 'RATE 1')
     A            LH2W#C         7  4       COLHDG('LINE HAUL' 'RATE 2')
     A            LH3W#C         7  4       COLHDG('LINE HAUL' 'RATE 3')
     A            LH4W#C         7  4       COLHDG('LINE HAUL' 'RATE 4')
     A            LH5W#C         7  4       COLHDG('LINE HAUL' 'RATE 5')
     A            LH6W#C         7  4       COLHDG('LINE HAUL' 'RATE 6')
     A*
     A* WT ARRAY - WEIGHT RANGES
     A            WT1CGC         7  0       COLHDG('WEIGHT' 'RANGE1')
     A            WT2CGC         7  0       COLHDG('WEIGHT' 'RANGE2')
     A            WT3CGC         7  0       COLHDG('WEIGHT' 'RANGE3')
     A            WT4CGC         7  0       COLHDG('WEIGHT' 'RANGE4')
     A            WT5CGC         7  0       COLHDG('WEIGHT' 'RANGE5')
     A            WT6CGC         7  0       COLHDG('WEIGHT' 'RANGE6')
     A*
     A* DE ARRAY - DESTINATIONS
     A            DES01C         3          COLHDG('DESTINATION')
     A            DES02C         3          COLHDG('DESTINATION')
     A            DES03C         3          COLHDG('DESTINATION')
     A            DES04C         3          COLHDG('DESTINATION')
     A            DES05C         3          COLHDG('DESTINATION')
     A            DES06C         3          COLHDG('DESTINATION')
     A*----------------------------------------------------------------
     A* LINE HAUL RATES - GARMENTS
     A*----------------------------------------------------------------
     A*
     A* MIN & MAX LINE HAUL FEES
     A            GHMINC         7  2       COLHDG('GOH MINIMUM')
     A            GHMAXC         7  2       COLHDG('GOH MAXIMUM')
     A*
     A* QT ARRAY - GARMENT QTY RANGES
     A            GHQT1C         5  0       COLHDG('GOH QTY' 'RANGE1')
     A            GHQT2C         5  0       COLHDG('GOH QTY' 'RANGE2')
     A            GHQT3C         5  0       COLHDG('GOH QTY' 'RANGE3')
     A            GHQT4C         5  0       COLHDG('GOH QTY' 'RANGE4')
     A            GHQT5C         5  0       COLHDG('GOH QTY' 'RANGE5')
     A            GHQT6C         5  0       COLHDG('GOH QTY' 'RANGE6')
     A*
     A* HG ARRAY - GARMENT RATES
     A            GHHG1C         5  4       COLHDG('GOH' 'RATE 1')
     A            GHHG2C         5  4       COLHDG('GOH' 'RATE 2')
     A            GHHG3C         5  4       COLHDG('GOH' 'RATE 3')
     A            GHHG4C         5  4       COLHDG('GOH' 'RATE 4')
     A            GHHG5C         5  4       COLHDG('GOH' 'RATE 5')
     A            GHHG6C         5  4       COLHDG('GOH' 'RATE 6')
     A*
     A* T0 ARRAY - GARMENT TYPES
     A            GHT01C         3  0       COLHDG('GARMENT TYPE')
     A            GHT02C         3  0       COLHDG('GARMENT TYPE')
     A            GHT03C         3  0       COLHDG('GARMENT TYPE')
     A            GHT04C         3  0       COLHDG('GARMENT TYPE')
     A            GHT05C         3  0       COLHDG('GARMENT TYPE')
     A            GHT06C         3  0       COLHDG('GARMENT TYPE')
     A            GHT07C         3  0       COLHDG('GARMENT TYPE')
     A            GHT08C         3  0       COLHDG('GARMENT TYPE')
     A            GHT09C         3  0       COLHDG('GARMENT TYPE')
     A            GHT10C         3  0       COLHDG('GARMENT TYPE')
     A*
     A* TR ARRAY - GARMENT TYPE RATES
     A            GHR01C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR02C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR03C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR04C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR05C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR06C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR07C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR08C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR09C         7  4       COLHDG('GARMENT TYPE RATE')
     A            GHR10C         7  4       COLHDG('GARMENT TYPE RATE')
     A*
     A* CT ARRAY - CARTON TO HANG RATES
     A            CTHG1C         5  3       COLHDG('CTN/GOH' 'RATE 1')
     A            CTHG2C         5  3       COLHDG('CTN/GOH' 'RATE 2')
     A            CTHG3C         5  3       COLHDG('CTN/GOH' 'RATE 3')
     A            CTHG4C         5  3       COLHDG('CTN/GOH' 'RATE 4')
     A            CTHG5C         5  3       COLHDG('CTN/GOH' 'RATE 5')
     A            CTHG6C         5  3       COLHDG('CTN/GOH' 'RATE 6')
     A            CTHG7C         5  3       COLHDG('CTN/GOH' 'RATE 7')
     A            CTHG8C         5  3       COLHDG('CTN/GOH' 'RATE 8')
     A*----------------------------------------------------------------
     A* WALSH PICK-UP RATES & CHARGES
     A*----------------------------------------------------------------
     A*
     A* RANGES & MAX AMTS
     A            FWGTRC         7  0       COLHDG('FROM WGT' 'RANGE')
     A            TWGTRC         7  0       COLHDG('TO WGT' 'RANGE')
     A            MINAMC         7  2       COLHDG('MINIMUM' 'AMT')
     A            MAXAMC         7  2       COLHDG('MAXIMUM' 'AMOUNT')
     A*
     A* GARMENT PICK UP CODES
     A            GHCL1C         2  0       COLHDG('GOH' 'PU CLASS 1')
     A            GHCL2C         2  0       COLHDG('GOH' 'PU CLASS 2')
     A            GHCL3C         2  0       COLHDG('GOH' 'PU CLASS 3')
     A            GHCL4C         2  0       COLHDG('GOH' 'PU CLASS 4')
     A            GHCL5C         2  0       COLHDG('GOH' 'PU CLASS 5')
     A            GHCL6C         2  0       COLHDG('GOH' 'PU CLASS 6')
     A            GHCL7C         2  0       COLHDG('GOH' 'PU CLASS 7')
     A            GHCL8C         2  0       COLHDG('GOH' 'PU CLASS 8')
     A            GHCL9C         2  0       COLHDG('GOH' 'PU CLASS 9')
     A            GHCL0C         2  0       COLHDG('GOH' 'PU CLASS 10')
     A*
     A* GARMENT P/U CLASSS
     A            GHRT1C         5  4       COLHDG('GOH' 'PU RATE 1')
     A            GHRT2C         5  4       COLHDG('GOH' 'PU RATE 2')
     A            GHRT3C         5  4       COLHDG('GOH' 'PU RATE 3')
     A            GHRT4C         5  4       COLHDG('GOH' 'PU RATE 4')
     A            GHRT5C         5  4       COLHDG('GOH' 'PU RATE 5')
     A            GHRT6C         5  4       COLHDG('GOH' 'PU RATE 6')
     A            GHRT7C         5  4       COLHDG('GOH' 'PU RATE 7')
     A            GHRT8C         5  4       COLHDG('GOH' 'PU RATE 8')
     A            GHRT9C         5  4       COLHDG('GOH' 'PU RATE 9')
     A            GHRT0C         5  4       COLHDG('GOH' 'PU RATE 10')
     A*
     A* CARTON WEIGHT CLASS
     A            CTCL1C         5  0       COLHDG('CTN/WGT' 'CLASS 1')
     A            CTCL2C         5  0       COLHDG('CTN/WGT' 'CLASS 2')
     A            CTCL3C         5  0       COLHDG('CTN/WGT' 'CLASS 3')
     A            CTCL4C         5  0       COLHDG('CTN/WGT' 'CLASS 4')
     A            CTCL5C         5  0       COLHDG('CTN/WGT' 'CLASS 5')
     A            CTCL6C         5  0       COLHDG('CTN/WGT' 'CLASS 6')
     A*
     A* CARTON CLASS/RATES
     A            CTRT1C         5  2       COLHDG('CTN/CLS' 'RATE 1')
     A            CTRT2C         5  2       COLHDG('CTN/CLS' 'RATE 2')
     A            CTRT3C         5  2       COLHDG('CTN/CLS' 'RATE 3')
     A            CTRT4C         5  2       COLHDG('CTN/CLS' 'RATE 4')
     A            CTRT5C         5  2       COLHDG('CTN/CLS' 'RATE 5')
     A            CTRT6C         5  2       COLHDG('CTN/CLS' 'RATE 6')
     A*
     A* P/U MIN AMTS
     A            MINCTC         7  2       COLHDG('CTN MIN' 'AMT')
     A            MINGHC         7  2       COLHDG('GOH MIN' 'AMOUNT')
     A*----------------------------------------------------------------
     A* OTHER CHARGES
     A*----------------------------------------------------------------
     A            MANF$C         5  2       COLHDG('MANIFEST' 'CHARGE')
     A            APRN$C         5  2       COLHDG('APRON ' 'CHARGE')
     A            TRNM$C         5  2       COLHDG('TRANSMISSION' 'CHARGE')
     A            LTLF$C         3  3       COLHDG('LTL FUEL' 'SURCHARGE')
     A            TLFL$C         3  3       COLHDG('TL FUEL' 'SURCHARGE')
     A            LINE$C         4  3       COLHDG('LINE ITEM' 'CHARGE')
     A*----------------------------------------------------------------
     A* CANCELLED PO TREATMENT
     A*----------------------------------------------------------------
     A            NONPOC         1          COLHDG('NO PO ON FILE')
     A            CNLPOC         1          COLHDG('CANCEL PO')
     A            DATPOC         1          COLHDG('OUT OF DATE PO')
     A*                                        FOR ALL 3 FIELDS ABOVE:
     A*                                          = DISREGARD
     A*                                        L = ACCEPT & LOG
     A*                                        R = REJECT & LOG
     A*                                        N = REJECT & NO LOG
     A            MINMFC         7  2       COLHDG('MIN TOT CG PER MANIF')
     A*
     A*----------------------------------------------------------------
     A* MISCELLANEOUS CODES
     A*----------------------------------------------------------------
     A            PRINVC         1          COLHDG('PRINT WALSH INV')
     A*                                          = YES
     A*                                        N = BYPASS PRINT
     A*
     A*----------------------------------------------------------------
     A* ADDITIONAL CONSOLIDATION CHARGES - FLAT FEE
     A*----------------------------------------------------------------
     A            FLTCHG         7  2       COLHDG('FLAT CHG PER TRAILER')
     A*               THE ABOVE TO BE PRO-RATED THRU-OUT ALL RECEIPTS
     A*               IN THE CONS. CHG. THIS FIELD IS THE POS/SEC. CHARGE
     A*               THAT WILL ONLY BE DONE IF THE OUTBOUND CARRIER IS NOT
     A*               NRT THIS CALC. WILL BE DONE IN RATE2 PROGRAM AND THE
     A*               PRINTOUT OF THE MANIFEST. THIS CHANGE WAS DONE ON
     A*               6/21/85 BY FRANK/JIM.
     A*
     A*----------------------------------------------------------------
     A* ADDITIONAL CONSOLIDATION FLAGS FOR COLOR AND SIZE
     A*----------------------------------------------------------------
     A            CLRCTC         1          COLHDG('X=CLR/SZE CARTON')
     A*                            X=COLOR/SIZE TO BE DONE FOR CARTONS
     A*                        BLANK=COLOR/SIZE NOT TO BE DONE FOR CARTONS
     A*
     A            CLRCTG         1          COLHDG('X=CLR/SZE GARMNT')
     A*                            X=COLOR/SIZE TO BE DONE FOR GARMENTS
     A*                        BLANK=COLOR/SIZE NOT TO BE DONE FOR GARMENTS
     A*
     A            POSCHC         7  2       COLHDG('POS./SECURITY CHARGE')
     A*
     A*
     A            APRSQC         5  0       COLHDG('APRON SEQ#')
     A*                         THIS # IS ASSIGN DURING APRON PROGRAM FOR
     A*                         EITHER RECEIPT OR IF THERE IS MULT.
     A*                         PO# EACH PO# WILL HAVE ITS ON APRSQC #.
     A*
     A*--------------------------------------------------------------
     A* THIS IS THE VARIANCE AREA FOR WEST COAST CONS. MANIFEST
     A* FOR PICK-UP ONLY----ADDED 8/85
     A*--------------------------------------------------------------
     A* CARTON WEIGHT CLASS
     A            VCTW1C         5  0       COLHDG('CTN/WGT' 'CLASS 1')
     A            VCTW2C         5  0       COLHDG('CTN/WGT' 'CLASS 2')
     A            VCTW3C         5  0       COLHDG('CTN/WGT' 'CLASS 3')
     A            VCTW4C         5  0       COLHDG('CTN/WGT' 'CLASS 4')
     A            VCTW5C         5  0       COLHDG('CTN/WGT' 'CLASS 5')
     A            VCTW6C         5  0       COLHDG('CTN/WGT' 'CLASS 6')
     A*
     A* CARTON CLASS/RATES
     A            VCTN1C         5  2       COLHDG('CTN/CLS' 'RATE 1')
     A            VCTN2C         5  2       COLHDG('CTN/CLS' 'RATE 2')
     A            VCTN3C         5  2       COLHDG('CTN/CLS' 'RATE 3')
     A            VCTN4C         5  2       COLHDG('CTN/CLS' 'RATE 4')
     A            VCTN5C         5  2       COLHDG('CTN/CLS' 'RATE 5')
     A            VCTN6C         5  2       COLHDG('CTN/CLS' 'RATE 6')
     A*
     A* P/U MIN AMTS
     A            VMINTC         7  2       COLHDG('CTN MIN' 'AMT')
     A* P/U FOR GOH
     A            VGOHTC         5  4       COLHDG('GOH    ' 'AMT')
     A*--------------------------------------------------------------
     A* THIS IS THE VARIANCE AREA FOR WEST COAST MANIFEST
     A* FOR CONS. RATES ON GOH AND CARTONS
     A*--------------------------------------------------------------
     A* CARTON WEIGHT CLASS
     A            VGOHCC         5  4       COLHDG('GOH/CONS. RATE   ')
     A            VCTNCC         5  5       COLHDG('CTN/CONS. RATE   ')
     A*
     A* THIS IS THE AMOUNT WE REBATE IF TRAILER IS UNLOADED BY CUSTOMER
     A            STRPDC         5  2       COLHDG('STRIP DEDUCTION')
     A*----------------------------------------------------------------
     A* THIS AREA WILL BE USED FOR KEEPING TRACK OF THE NUMBER OF
     A* RECEIPTS CREATED FOR EITHER REGULAR OR WPU RECEIPTS. ITS ALSO
     A* GOING TO BE ABLE TO SET A UNTIL ON THE NUMBER OF RECEIPTS WITH
     A* A WEIGHT FACTOR INTO ACCOUNT. THERE WILL BE A STARTING AND
     A* ENDING DATE IN THE JULIAN SET UP.
     A* THESE FIELDS WILL GIVE YOU THE CAPABLE OF HAVING NO CONSL. OR
     A* LINE HAUL ON THESE RECEIPTS.
     A* THE JULIAN DATE WILL BE UPDATED BY THE SYSTEM A YEARS END FOR
     A* ANY ACCOUNT THAT USES THIS SET UP ALSO IT WILL ZERO OUT THE
     A* COUNTER FIELD IN THE PROGRAM THAT PRINTS OUT THE RECEIPTS.
     A*----------------------------------------------------------------
     A            CONT#C         5  0       COLHDG('COUNTER ON RECEIPT')
     A            CONTUC         5  0       COLHDG('COUNTER UNTIL')
     A            WLBS#C         5  0       COLHDG('WEIGTH ON RECEIPT')
     A            SJUL#C         5  0       COLHDG('STARTING JULIAN DATE')
     A            EJUL#C         5  0       COLHDG('ENDING JULIAN DATE')
     A*
     A            SDATEC         6  0       COLHDG('START DATE FOR ACCT')
     A            EDATEC         6  0       COLHDG('ENDING DATE')
     A*
     A* AMOUNT TO BE ADDED TO CONSL. IN WHICH EACH RECEIPT WOULD BE
     A* PRO RATED.
     A            ADCONC         7  2       COLHDG('ADD TO CONSL')
     A*
     A* LINE HAUL TO BE ADDED TO RECEIPT BUT NOT TO DEPT OF ALLOCATION
     A            NOALLC         1          COLHDG('DEPT. OF ALLOC')
     A*                                     ' ' = YES
     A*                                     'N' = NO
     A*
     A* FOR DEPT FILE COLOR/SIZE OR LOAD CODE ON RECIPT
     A            DEPTFC         1          COLHDG('DEPT. FILE')
     A*                                     ' ' = YES
     A*                                     'N' = NO
     A*
     A* FOR DEPT FILE COLOR/SIZE OR LOAD CODE ON RECIPT
     A            NOWPUC         1          COLHDG('NO WPU FOR ACT')
     A*                                     ' ' = YES
     A*                                     'N' = NO
     A*
     A* QT ARRAY - GARMENT WEIGHT FOR LINE HAUL CHARGES
     A* THIS GOES WITH LINES AREA OF 390 IN FLDREF
     A*
     A            GHWT1C         5  0       COLHDG('GOH WGH' 'RANGE1')
     A            GHWT2C         5  0       COLHDG('GOH WGH' 'RANGE2')
     A            GHWT3C         5  0       COLHDG('GOH WGH' 'RANGE3')
     A            GHWT4C         5  0       COLHDG('GOH WGH' 'RANGE4')
     A            GHWT5C         5  0       COLHDG('GOH WGH' 'RANGE5')
     A            GHWT6C         5  0       COLHDG('GOH WGH' 'RANGE6')
     A*
     A* FLAT CHARGE PRO RATED ON NUMBER OF STOPS ON TRAILER
     A            FLTCHC         1          COLHDG('FLAT CHARGE')
     A*                                     'Y' = YES
     A            FL1TFC         7  2       COLHDG('FLAT CHG' '1 STOPS')
     A            FL2TFC         7  2       COLHDG('FLAT CHG' '2 STOPS')
     A            FL3TFC         7  2       COLHDG('FLAT CHG' '3 STOPS')
     A            FL4TFC         7  2       COLHDG('FLAT CHG' '4 STOPS')
     A            FL5TFC         7  2       COLHDG('FLAT CHG' '5 STOPS')
     A            FL6TFC         7  2       COLHDG('FLAT CHG' '6 STOPS')
     A*
     A* P.O. NUMBER REQUIRED
     A            REQPOC         1          COLHDG('P.O. REQUIRED')
     A            TCN##C         4  0       COLHDG('TCN# SEQ#')
     A            NRTDLC         1          COLHDG('NRT INB ' 'WITH DOLLARS')
     A*                                      N = NO CONSOL CHG IF NRT + DOLLARS
     A            NRTZPC         1          COLHDG('NRT INB' 'WITH DOLLARS ZIP')
     A*                                      N = NO CONS CHG IF NRT
     A*                                      + DOLLARS AND CERTAIN ZIP CODES
     A            CTPR1C         5  4       COLHDG('CTN PRICE' 'RATE')
     A*                                     CARTON TYPE = F
     A*                                     IF COMM CODE = 5
     A            CTPR2C         5  4       COLHDG('CTN PRICE' 'RATE')
     A*                                     CARTON TYPE = P
     A*                                     IF COMM CODE = 5
     A            CONMIC         4  2       COLHDG('CONSOL. MIN CHG')
     A            CONCDC         1          COLHDG('CONSOL. MIN CODE')
     A            CBWUNC         5  3       COLHDG('CBW' 'RATE')
     A            ARBILC         5  0       COLHDG('AR ACCT TO BILL')
     A            ARFLGC         1          COLHDG('AR FLAG')
     A            FAMGRC         2          COLHDG('FAMILY CODE')
     A            FAMSGC         4          COLHDG('FAMILY SUB GROUP')
     A* RELEASE FLAG FOR AUTO RELEASE ADDED ON SEP 2006 BY A.D.
     A            RELSFC         1          COLHDG('RELEASE' 'FLAG')
     A*                                     'Y' - AUTO RELEASE
     A*                                     'N' - MANUAL RELEASE ONLY
     A            RECPRC         1          COLHDG('RECEIPT PRINT FLAG')
     A            BARCDC         1          COLHDG('RECEIPT BAR CODE')
     A* TJX CHAIN ID
     A            TJDIVC         2          COLHDG('TJX' 'CHAIN')
     A**********************************************************************
     A*           CWRK      -                RECEIPT DETAIL MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002000 002000 00010
     A*         R CWRKFM
     A*--------------------
     A* MANIFEST LEVEL DATA
     A*--------------------
     A            ACCT#E         5  0       COLHDG('CUSTOMER #')
     A            MANF#E         7  0       COLHDG('MANIFEST #')
     A            MANFLE         3  0       COLHDG('LOADING SEQUENCE')
     A            BLNUME         9  0       COLHDG('B/L #')
     A            OCAR#E         5  0       COLHDG('CARRIER' 'CODE')
     A            OCARRE         8          COLHDG('OUTBOUND CARRIER')
     A            TRLR1E         8          COLHDG('TRAILER 1')
     A            SEAL1E         8          COLHDG('SEAL #1')
     A            TRLR2E         8          COLHDG('TRAILER 2')
     A            SEAL2E         8          COLHDG('SEAL # 2')
     A            MANDTE         6S 0       COLHDG('MANIFEST' 'DATE')
     A            TOSPLE         7  2       COLHDG('SPECIAL' 'CHARGES')
     A*--------------------------
     A* RECEIPT HEADER LEVEL DATA
     A*--------------------------
     A            REC##E         6  0       COLHDG('RECEIPT #')
     A            RECDTE         6S 0       COLHDG('RECEIPT' 'DATE')
     A            CONT#E         3  0       COLHDG('CONTROL #')
     A            STAT1E         1          COLHDG('RECEIPT' 'STATUS')
     A*
     A* SHIPPER DATA
     A            SHIPNE        25          COLHDG('SHIPPER NAME')
     A            SHAD1E        25          COLHDG('SHIPPER ADD1')
     A            SHAD2E        25          COLHDG('SHIPPER ADD2')
     A            SHZIPE         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHCODE         5  0       COLHDG('SHIPPER' 'CODE')
     A            SHSTAE         2          COLHDG('SHIPPER' 'STATE')
     A*
     A*  SHIPMENT DATA
     A            DSCODE         3  0       COLHDG('GARMENT TYPE')
     A            EXCPTE        10          COLHDG('EXCEPTION' 'CODE')
     A*                                            ARRAY 10 X 1 CHAR
     A*
     A            ICAR#E         5  0       COLHDG('CARRIER' 'CODE')
     A            CARRIE         8          COLHDG('CARRIER' 'NAME')
     A            DRIVEE        10          COLHDG('DRIVER')
     A            VEHICE         6          COLHDG('VEHICLE #')
     A            AMCCDE         8          COLHDG('IMPORT' 'DOMESTIC')
     A            CTNGHE         1          COLHDG('CTN OR' 'GOH')
     A*                                        C = CTN
     A*                                        G = GOH
     A            INVNOE         9          COLHDG('INVOICE' '#')
     A            STYLEE        12          COLHDG('STYLE #')
     A            PONUME        10          COLHDG('P.O.#')
     A            INVDTE         6S 0       COLHDG('INVOICE' 'DATE')
     A            OPENHE         1          COLHDG('OPEN' 'TO HANG')
     A            NOCHGE         1          COLHDG('NO' 'CHARGE')
     A*                                      N = NO CHARGE
     A            INPROE         8  0       COLHDG('INBOUND' 'PRO#')
     A            CKDGTE         1  0       COLHDG('CHECK' 'DIGIT')
     A            KEYREE         8  0       COLHDG('KEYREC #')
     A            DEPT#E         4  0       COLHDG('DEPARTMENT' '#')
     A            ITEM#E         3  0       COLHDG('ITEM #')
     A*                                        CURRENTLY NOT USED
     A            SYSIDE         1          COLHDG('ACCOUNT' 'TYPE')
     A*                                         1 = WALSH
     A*                                         2 = FEDERATED A
     A*                                         3 = FEDERATED B
     A*                                         4 = LERNER
     A*                                         5 = TRI STATE
     A*                                         6 = J W MAYS
     A*                                         7 = WEST COAST
     A*                                         Z = GREENSBORO
     A            WPUSHE         1          COLHDG('IF WPU' 'NO P/U CHGHG')
     A*                                         N = DONT CALC WALSH P/U CHG
     A            FREEAE         1          COLHDG('FREE' 'ASTRAY')
     A*                                       F = FREE ASTRAY
     A            SHORTE         1          COLHDG('SHORT' 'CODE')
     A            BREAKE         1          COLHDG('NEEDS' 'BREAKDOWN')
     A*                                         = NO BREAKDOWN
     A*                                       Y = NEED BREAKDOWN
     A            REFNOE         7  0       COLHDG('REF NO')
     A            BLDGPE         1          COLHDG('PRINT' 'CODE')
     A            HANGCE         1          COLHDG('PRINT' 'HANG CARDS')
     A            SEQNOE         3  0       COLHDG('SEQUENCE' '#')
     A*                                       LEVEL BREAK ON THIS CODE
     A*
     A*  RECEIPT QUANTITYS & CHARGES
     A            TOINVE         7  0       COLHDG('TOTAL' 'QTY' 'INV')
     A            TOQTYE         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWGTE         5  0       COLHDG('TOTAL' 'WGT')
     A            TOWPUE         7  2       COLHDG('TOTAL' 'WPU')
     A            TONPUE         7  2       COLHDG('TOTAL' 'NPU')
     A            TOADVE         7  2       COLHDG('TOTAL' 'ADVANCE')
     A            TODELE         7  2       COLHDG('TOTAL' 'DELIVERY$')
     A            TOCONE         7  2       COLHDG('TOTAL' 'CONSOLI')
     A            APRN$E         7  2       COLHDG('APRON' 'CHG')
     A            LINE$E         4  3       COLHDG('LINE ITEM' 'CHARGE')
     A            TOSURE         7  2       COLHDG('TOTAL' 'SURCHARGE')
     A            TOMNFE         7  2       COLHDG('TOTAL' 'MANIF CHG')
     A            ALLOCE         7  2       COLHDG('AMT' 'ALLOC' 'N/B')
     A            INVAME         7  2       COLHDG('INVOICE' 'AMOUNT')
     A            TOCOLE         7  2       COLHDG('TOTAL' 'COLLECT$')
     A            NBILLE         1          COLHDG('NOBILL' 'LINE HAUL')
     A*--------------------------
     A*  BRANCH DETAIL LEVEL DATA
     A*--------------------------
     A*  ADVANCE CHARGES DATA
     A            CHKNOE         5  0       COLHDG('ADVANCE' 'CKNO')
     A            ADVAME         7  2       COLHDG('ADVANCE' 'AMOUNT')
     A*
     A            BRNCHE         3  0       COLHDG('BRANCH #')
     A            GRPCDE         3  0       COLHDG('GROUP' 'CODE')
     A*
     A* QUANTITIES & CHARGES
     A            INQTYE         5  0       COLHDG('QTY' 'INVOICED')
     A            REQTYE         5  0       COLHDG('QTY' 'RECD')
     A            WEIGHE         5  0       COLHDG('TOTAL' 'WGT')
     A            WPU$$E         7  2       COLHDG('TOTAL' 'WPU')
     A            NPU$$E         7  2       COLHDG('TOTAL' 'NPU')
     A            ADV$$E         7  2       COLHDG('TOTAL' 'ADVANCE')
     A            DEL$$E         7  2       COLHDG('TOTAL' 'DELIVERY$')
     A            COL$$E         7  2       COLHDG('TOTAL' 'COLLECT$')
     A            CON$$E         7  2       COLHDG('TOTAL' 'CONSOLI')
     A            WANUME         6  0       COLHDG('WALSH' '#')
     A*------------------
     A* PO & STYLE ARRAYS
     A*------------------
     A            POARRE       130          COLHDG('POS')
     A*                                        13 X 10
     A            STARRE       156          COLHDG('STYLE')
     A*                                        13 X 12
     A            INARRE       117          COLHDG('INV#')
     A*                                        13 X 9
     A            QTARRE        39          COLHDG('QTY')
     A*                                        13 X 5.0 PACKED
     A            WREC#E         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A* CODE FOR SHIP-TO ADDRESS
     A            STADRE         3  0       COLHDG('ADDRESS CODE')
     A            LOADCE         2  0       COLHDG('LOAD CODE')
     A            SID##E         6  0       COLHDG('MARSHALLS SID#')
     A            PICDTE         6S 0       COLHDG('PICK-UP' 'DATE')
     A            SBL##E        12          COLHDG('SHIPPERS B/L #')
     A            ISA##E         9  0       COLHDG('EDI CONTOL #')
     A            KEYR#E        10          COLHDG('KEY REC #')
     A            TYPCTE         1          COLHDG('TYPE OF CARTON')
     A            TYPGHE         1          COLHDG('TYPE OF GOH')
     A            CCPPTE         2          COLHDG('PRE-PAID OR COLLECT')
     A            TDATEE         6  0       COLHDG('TODAYS DATE' )
     A*                                     YYMMDD
     A            TTIMEE         4  0       COLHDG('TODAYS TIME')
     A*                                     HHMM
     A            STOREE         4  0       COLHDG('STORE #')
     A            SBL#2E        20          COLHDG('SHIPPERS B/L #')
     A            PO#11E        11          COLHDG('P.O.' 'NUMBER')
     A            POA11E       143          COLHDG('PO# ARRAY')
     A*                                        13 X 11
     A**********************************************************************
     A*           DAMG      -                DAMAGE WORK FILE          CT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R DAMGFM
     A*
     A            STATDD         1          COLHDG('STATUS CODE ')
     A            DAMCDD         1          COLHDG('DAMAGE CODE')
     A****                                   S = DAMAGED BUT SHIPPED
     A****                                   = DAMAGED NOT SHIPPED SENT 947
     A            ACT#DD         5  0       COLHDG('ACCOUNT' 'NUMBER')
     A            REC#DD         6  0       COLHDG('RECEIPT NUMBER')
     A            QTY#DD         5  0       COLHDG('DAMAGE QTY')
     A            IRECDD         7  0       COLHDG('INTERNAL RECIPTS')
     A            EDATDD         2S 0       COLHDG('FROM DAY')
     A            EDATMD         2S 0       COLHDG('FROM MONTH')
     A            EDATYD         2S 0       COLHDG('FROM YEAR')
     A            OPERID         5          COLHDG('OPERATORS' 'INITS')
     A            TIM#DD         4  0       COLHDG('TIME ENTERED')
     A            FLAGDD         1          COLHDG('FOR VINCE')
     A**********************************************************************
     A*           DEPT      -                DEPT WORK FILE            CT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R DEPTFM
     A*
     A            STAT#D         1          COLHDG('STATUS CODE ')
     A            ACT##D         5  0       COLHDG('ACCOUNT' 'NUMBER')
     A            DEP##D         4  0       COLHDG('DEPT NUMBER')
     A            LOAD#D         2  0       COLHDG('LOAD CODE')
     A**********************************************************************
     A*           EDIF      -                EDI FILE                  CT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EDIFFM
     A*
     A            EDI##I         9  0       COLHDG('EDI #')
     A            ACCT#I         5  0       COLHDG('ACCOUNT NUMBER')
     A            MANF#I         7  0       COLHDG('MANIFEST #')
     A            MANFCI         7  0       COLHDG('MANF CONTROL#')
     A            FRMDDI         2S 0       COLHDG('FROM DAY')
     A            FRMMMI         2S 0       COLHDG('FROM MONTH')
     A            FRMYYI         2S 0       COLHDG('FROM YEAR')
     A            TODDDI         2S 0       COLHDG('TO DAY')
     A            TODMMI         2S 0       COLHDG('TO MONTH')
     A            TODYYI         2S 0       COLHDG('TO YEAR')
     A            RUNDDI         2S 0       COLHDG('RUN DAY')
     A            RUNDMI         2S 0       COLHDG('RUN MONTH')
     A            RUNYYI         2S 0       COLHDG('RUN YEAR')
     A            CONS$I         9  2       COLHDG('CONSOL. DOLLARS')
     A            ADV$$I         9  2       COLHDG('ADVANCE DOLLARS')
     A            LHAULI         9  2       COLHDG('LINE HAUL $$$')
     A            MISC$I         9  2       COLHDG('MISC. CHARGES')
     A            JULDDI         5  0       COLHDG('JULIAN DATE')
     A            STAT3I         1          COLHDG('STATUS CODE ')
     A*                                     A= ADVANCE   M= MANIFEST
     A**********************************************************************
     A*           EMPL      -                EMPLOYEE HEADER FILE      CT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R EMPLFM
     A*
     A            STAT3H         1          COLHDG('STATUS CODE ')
     A            EMPL#H        10          COLHDG('EMPLOYEE NUMBER')
     A            FIRSTH        15          COLHDG('FIRST NAME')
     A            LASTNH        20          COLHDG('LAST NAME')
     A            MIDDLH         1          COLHDG('MIDDLE INITAL')
     A            ADDREH        25          COLHDG('STREET ADDRESS')
     A            POBOXH        20          COLHDG('POST OFFICE BOX')
     A            CITYAH        20          COLHDG('CITY')
     A            STATEH         2          COLHDG('STATE')
     A            ZIPCDH         5  0       COLHDG('ZIP CODE')
     A            AREACH         3  0       COLHDG('AREA CODE')
     A            PHONEH         7  0       COLHDG('PHONE NUMBER')
     A            SOCILH         9  0       COLHDG('SOCIAL SERURITY')
     A            EPHONH        10  0       COLHDG('EMERGENCY PHONE')
     A            EMERPH        25  0       COLHDG('PERSON TO CONTACT')
     A***********
     A            STRDDH         2S 0       COLHDG('STARTING DAY')
     A            STRMMH         2S 0       COLHDG('STARTING MONTH')
     A            STRYYH         2S 0       COLHDG('STARTING YEAR')
     A***********
     A            ENDDDH         2S 0       COLHDG('ENDING DAY')
     A            ENDMMH         2S 0       COLHDG('ENDING MONTH')
     A            ENDYYH         2S 0       COLHDG('ENDING YEAR')
     A            COMMTH        40          COLHDG('COMMENTS')
     A***********
     A            ENTDDH         2S 0       COLHDG('ENTRY DAY')
     A            ENTMMH         2S 0       COLHDG('ENTRY MONTH')
     A            ENTYYH         2S 0       COLHDG('ENTRY YEAR')
     A            PENTRH        30          COLHDG('PERSON WHO ENTRY')
     A***********
     A            LOCATH         3          COLHDG('LOCATION')
     A            BUILDH         2          COLHDG('BUILDING CODE')
     A            DEPTDH        10          COLHDG('DEPT')
     A            SHIFTH         1          COLHDG('SHIFT CODE')
     A            TVACTH         2S 0       COLHDG('VACATION DAYS TAKEN')
     A            TSICKH         2S 0       COLHDG('SICK DAYS TAKEN')
     A            AVACTH         2S 0       COLHDG('VACTION DAYS ALLOWED')
     A            ASICKH         2S 0       COLHDG('SICK DAYS ALLOWED')
     A            APERSH         2S 0       COLHDG('OTHER DAYS ALLOWED')
     A            TPERSH         2S 0       COLHDG('OTHER DAYS TAKEN')
     A**********************************************************************
     A*           GRUP      -                GROUP CODE FOR USER ID    CT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R GRUPFM
     A            USERIG        10          COLHDG('USER ID GROUP')
     A            ACCOUG         5  0       COLHDG('ACCOUNT NUMBER')
     A            GRUPCG         3  0       COLHDG('GROUP CODE')
     A**********************************************************************
     A*           LGPO      -                DATA FOR REPORT ON PO FILEICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R LGPOFM
     A            STATLG         1          COLHDG('STATUS FOR REPORT')
     A*                                       R= CANCEL PO NUMBER
     A*                                       L= PO NOT IN FILE
     A            ACCTLG         5  0       COLHDG('ACCOUNT #')
     A            SHIPLG        20          COLHDG('SHIPPER' 'NAME')
     A            SADDLG        25          COLHDG('SHIPPER' 'ADDRESS')
     A            INV#LG         9          COLHDG('INVOICE #')
     A            CARRLG         8          COLHDG('INBOUND CARRIER')
     A            DEPTLG         4          COLHDG('DEPT#')
     A            PON#LG        10          COLHDG('PURCHASE ORDER #')
     A            TYPELG         1          COLHDG('CTN OR GOH')
     A            TRAMLG         1          COLHDG('TRAMMISSION CODE')
     A            TQTYLG         5  0       COLHDG('TOTAL QTY')
     A            TWGTLG         5  0       COLHDG('TOTAL WEIGHT')
     A            STYLLG        12          COLHDG('STYLE#')
     A            RTYYLG         2S 0       COLHDG('ENT RECP DATE YR')
     A            RTMMLG         2S 0       COLHDG('ENT RECP DATE MON')
     A            RTDDLG         2S 0       COLHDG('ENT RECP DATE DAY')
     A            STYYLG         2S 0       COLHDG('START DATE FOR PO')
     A            STMMLG         2S 0       COLHDG('START DATE FOR PO')
     A            STDDLG         2S 0       COLHDG('START DATE FOR PO')
     A            ENYYLG         2S 0       COLHDG('END DATE FOR PO')
     A            ENMMLG         2S 0       COLHDG('END DATE FOR PO')
     A            ENDDLG         2S 0       COLHDG('END DATE FOR PO')
     A            RJULLG         5  0       COLHDG('RECIPT JULIAN DATE')
     A            BRANLG         3  0       COLHDG('BRANCH NUMBER')
     A            OVRRLG         1          COLHDG('MANUAL OVERRIDE CODE')
     A            PO11LG        11          COLHDG('PURCHASE ORDER #')
     A**********************************************************************
     A*           MANF      -                MANIFEST SUMMARY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0070000 010000 00010
     A*         R MANFFM
     A*
     A            ACRECM         1          COLHDG('ACTIVE' 'CODE')
     A*                                              = ACTIVE
     A*                                            V = VOIDED
     A            WMANFM         7  0       COLHDG('WALSH MANIFEST #')
     A            ACCT#M         5  0       COLHDG('CUSTOMER #')
     A            MANF#M         7  0       COLHDG('CUSTOMER MANIFEST#')
     A            MANDDM         2S 0       COLHDG('MANIFEST' 'DAY')
     A            MANMMM         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANYYM         2S 0       COLHDG('MANIFEST' 'YEAR')
     A            SHJULM         5  0       COLHDG('SHIP DATE..JULIAN')
     A            SYSIDM         1          COLHDG('SYSTEM ' 'ID')
     A*                                         1 = WALSH
     A*                                         2 = FEDERATED A
     A*                                         3 = FEDERATED B
     A*                                         4 = LERNER
     A*                                         5 = TRI STATE
     A*                                         6 = J W MAYS
     A*                                         7 = WEST COAST
     A            COCODM         3  0       COLHDG('SUBSYSTEM' 'ID')
     A*
     A* WEIGHTS
     A            ACTWTM         5  0       COLHDG('ACTUAL CTN WGT')
     A            AGOWTM         5  0       COLHDG('ACTUAL GOH WGT')
     A            ATOWTM         5  0       COLHDG('ACTUAL TOT WGT')
     A            BCTWTM         5  0       COLHDG('LHAUL CTN WGT')
     A            BGOWTM         5  0       COLHDG('LHAUL GOH WGT')
     A            BTOWTM         5  0       COLHDG('LHAUL TOT WGT')
     A            CCTWTM         5  0       COLHDG('CONS  CTN WGT')
     A            CGOWTM         5  0       COLHDG('CONS  GOH WGT')
     A            CTOWTM         5  0       COLHDG('CONS  TOT WGT')
     A* QTYS
     A            ACTQTM         5  0       COLHDG('ACTUAL CTN QTY')
     A            AGOQTM         5  0       COLHDG('ACTUAL GOH QTY')
     A            ATOQTM         5  0       COLHDG('ACTUAL TOT QTY')
     A            BCTQTM         5  0       COLHDG('LHAUL CTN QTY')
     A            BGOQTM         5  0       COLHDG('LHAUL GOH QTY')
     A            BTOQTM         5  0       COLHDG('LHAUL TOT QTY')
     A            CCTQTM         5  0       COLHDG('CONS  CTN QTY')
     A            CGOQTM         5  0       COLHDG('CONS  GOH QTY')
     A            CTOQTM         5  0       COLHDG('CONS  TOT QTY')
     A* CHARGES
     A            CTLHLM         7  2       COLHDG('CTN LINE HAUL')
     A            GOLHLM         7  2       COLHDG('GOH LINE HAUL')
     A            TOLHLM         7  2       COLHDG('TOTAL LINE HAUL$')
     A*
     A            CTCONM         7  2       COLHDG('CTN CONS CHG')
     A            GOCONM         7  2       COLHDG('GOH CONS CHG')
     A            TOCONM         7  2       COLHDG('TOTAL CONS CHG')
     A*
     A            TOWPUM         7  2       COLHDG('TOTAL WPU')
     A            TONPUM         7  2       COLHDG('TOTAL NPU')
     A            ADVY$M         7  2       COLHDG('PROTECT ADVANCES')
     A            ADVN$M         7  2       COLHDG('UNPROTECT ADVANCES')
     A            TOMNFM         7  2       COLHDG('TOTAL' 'MANIFEST CHG')
     A            TOTMCM         7  2       COLHDG('TOTAL' 'TRANS. CHG')
     A            TOLINM         7  2       COLHDG('TOTAL' 'LINE ITEM CHG')
     A            TOSPLM         7  2       COLHDG('SPECIAL' 'CHARGES')
     A            TOAPRM         7  2       COLHDG('TOTAL' 'APRON')
     A            TOSURM         7  2       COLHDG('TOTAL' 'SURCHARGE')
     A*
     A* INVOICE DATA:
     A            WINV#M         7  0       COLHDG('WALSH' 'INV#')
     A            ALLOCM         7  2       COLHDG('AMT' 'ALLOC' 'N/B')
     A            INVAMM         7  2       COLHDG('INVOICE' 'AMT')
     A            TOT$$M         7  2       COLHDG('TOTAL' 'ALLOCATED CHG')
     A            PFLAGM         1          COLHDG('INVOICE' 'PRINTED')
     A            NOBILM         1          COLHDG('BILL' 'LINE')
     A* MISC
     A            PPCOLM         1          COLHDG('PREPAID' 'COLLECT')
     A            GRPCDM         3  0       COLHDG('GROUP' 'CODE')
     A            COMNTM        60          COLHDG('COMMENTS')
     A* OUTBOUND DATA
     A            BLNUMM         9  0       COLHDG('B/L #')
     A            OCARRM        15          COLHDG('OUTBOUND CARRIER')
     A            OCAR#M         5  0       COLHDG('CARRIER' 'CODE')
     A            TRLR1M         8          COLHDG('TRAILER 1')
     A*                                     COULD BE AIR/FREIGHT BILL
     A            SEAL1M         8          COLHDG('SEAL #1')
     A            TRLR2M         8          COLHDG('TRAILER 2')
     A            SEAL2M         8          COLHDG('SEAL # 2')
     A            DRIV1M        10          COLHDG('DRIVER #1')
     A            DRIV2M        10          COLHDG('DRIVER #2')
     A            RATE1M         5  2       COLHDG('DRIVER' 'RATE 1')
     A            RATE2M         5  2       COLHDG('DRIVER' 'RATE 2')
     A            DESTNM         3          COLHDG('DESTINATION')
     A            T4548M         2  0       COLHDG('45 OR 48 FOOTER')
     A            TPUPSM         1  0       COLHDG('# OF PUPS')
     A*
     A            STAT1M         1          COLHDG('STATUS - PRINTED')
     A* APRONS                                 P = PRINTED
     A            APRDDM         2S 0       COLHDG('APRON' 'DAY')
     A            APRMMM         2S 0       COLHDG('APRON' 'MONTH')
     A            APRYYM         2S 0       COLHDG('APRON' 'YEAR')
     A*
     A            EDITSM         1          COLHDG('EDITING STATUS')
     A*                                          = NEEDS EDITING
     A*                                        1 = EDITED-ERRORS FOUND
     A*                                        2 = EDITED-NO ERRORS
     A            STOPOM         2S 0       COLHDG('# OF STOP OFFS')
     A*             ENTERED AT MANIFEST TIME
     A*             PRO-RATED BY RATE2
     A*          +  SHOWN SEPARATLY ON BOTTOM OF DEPT OF ALLOCATION -
     A*          +   INCLUDED IN DLVRY CARRIER CHARGE, TOTAL ALLOCATION
     A*          +   CHARGE (LINE HAUL)
     A*
     A            POSCHM         7  2       COLHDG('POS./SECURITY CHARGE')
     A*
     A*-------------------------------------------------------------
     A* THIS AREA IS SET UP FOR THE VARIANCE DIFFERENCE ON THE
     A* CHARGES FROM WEST COAST CONS. MANIFEST TO THE CHARGS
     A* THAT ARE SENT TO THE CUSTOMER ON PICK-UPS AND CONS. RATES
     A*-------------------------------------------------------------
     A            VTOTGM         7  2       COLHDG('VAR. GOH CONS.')
     A            VTOTCM         7  2       COLHDG('VAR. CTN CONS.')
     A            VTOTPM         7  2       COLHDG('VAR. PICK-UPS.')
     A            VTOTTM         7  2       COLHDG('VAR. GRAND TOT')
     A*
     A* STRIPPING AMOUNT REBATED FOR THIS MANIFEST
     A            STRPDM         5  2       COLHDG('STRIP REBATE AMT.')
     A*
     A* CODE FOR SHIP-TO ADDRESS
     A            STADRM         3  0       COLHDG('ADDRESS CODE')
     A*
     A* FOR PERSON WHO KEYED IN MANIFEST
     A            ENAMEM         5          COLHDG('PERSON NAME ')
     A            BASWTM         5  0       COLHDG('BASE ON TRL WGT')
     A            BASLHM         7  2       COLHDG('BASE  LINE HAUL$')
     A            BASMFM         7  0       COLHDG('BASE ON WGT' 'MANIFEST #')
     A            BASCDM         1          COLHDG('BASE ON WGT' 'CODE')
     A            ISA##M         9  0       COLHDG('EDI CONTROL#')
     A            PREFXM         4          COLHDG('PREFIX ID')
     A            TYPEQM         2          COLHDG('TYPE OF EQUIPMENT')
     A            MBL##M        12          COLHDG('MANIFEST B/L#')
     A            OBPR#M        10          COLHDG('OUTBOUND PRO#')
     A            SCACCM         4          COLHDG('SCAC OUTBOUND')
     A            MANTMM         4  0       COLHDG('MANIFEST TIME')
     A            PRELWM         5  0       COLHDG('PRELOADED WGT')
     A            PRELCM         5  0       COLHDG('PRELOADED CTN')
     A            PRELGM         5  0       COLHDG('PRELOADED GOH')
     A            EMAILM         1          COLHDG('ADDED TO AR')
     A*                                     Y = YES
     A*                                       = NO
     A            DELRCM         1          COLHDG('DELIVERY RECEIPT')
     A            OBPR2M        13          COLHDG('OUTBOUND PRO#')
     A* RELEASE INFO
     A            RELS#M         7  0       COLHDG('RELEASE NUMBER')
     A            RELFGM         1          COLHDG('RELEASE FLAG')
     A*                                         Y = AUTO RELEASE
     A*                                         N = MANUAL RELEASE
     A            ABAGM          1  0       COLHDG('AIR BAG')
     A            LBARM          1  0       COLHDG('LOAD BAR')
     A
     A**********************************************************************
     A*           MCTL      -                MANIFEST CONTROL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 030000 00010
     A*         R MCTLFM
     A*
     A            ACRECN         1          COLHDG('ACTIVE' 'CODE')
     A* MANIFEST
     A            WMANFN         7  0       COLHDG('WALSH MANIFEST #')
     A            ACCT#N         5  0       COLHDG('CUSTOMER #')
     A            TRLR1N         8          COLHDG('TRAILER 1')
     A            MANDDN         2S 0       COLHDG('MANIFEST' 'DAY')
     A            MANMMN         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANTMN         4  0       COLHDG('MANIFEST' 'TIME')
     A* TRANSMISSION
     A            TRANFN         8          COLHDG('TRANS FILE NAME')
     A            TRAMMN         2S 0       COLHDG('TRANS' 'MONTH')
     A            TRADDN         2S 0       COLHDG('TRANS' 'DAY')
     A            TRATMN         4  0       COLHDG('TRANS' 'TIME')
     A            TRACDN         1          COLHDG('PROCESSED=P')
     A            FDESCN        10          COLHDG('FILE DESCRIPTION')
     A*
     A**********************************************************************
     A*           OVR#      -                OVERAGE REC #
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R OVR#FM
     A*
     A            INUSE          1
     A            RC##           5S 0
     A*
     A**********************************************************************
     A*           OVER      -                OVERAGE/DOCK/SHIPMENTS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R OVERFM
     A*
     A            SLOT#G         5  0       COLHDG('SLOT NUMBER')
     A            VENDNG        25          COLHDG('VENDOR' 'NAME')
     A            CONSGG        25          COLHDG('CONSIGNEE' 'NAME')
     A            DESCPG        35          COLHDG('GARMENT' 'DESC')
     A            STYLEG        12          COLHDG('STYLE NUMBER')
     A            QTY##G         5  0       COLHDG('QTY')
     A            ACCT#G         5  0       COLHDG('ACCOUNT NUMBER')
     A            MANIFG         7  0       COLHDG('MANIFEST NUMBER')
     A            CTNGHG         1          COLHDG('CTN OR' 'GOH')
     A            ENTMMG         2S 0       COLHDG('ENTRY' 'MONTH')
     A            ENTDDG         2S 0       COLHDG('ENTRY' 'DAY')
     A            ENTYYG         2S 0       COLHDG('ENTRY' 'YEAR')
     A            RECNTG         5  0       TEXT('RECORD #')
     A            PO#11G        11          COLHDG('PO' 'NUMBER')
     A**********************************************************************
     A*           PCAR      -                ADV CHG PROTECTED CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000050 00010
     A*         R PCARFM
     A*
     A            ACCT#Q         5  0       COLHDG('ACCOUNT' 'CODE')
     A            ICAR#Q         5  0       COLHDG('CARRIER' 'CODE')
     A            CARRIQ        20          COLHDG('CARRIER')
     A*
     A**********************************************************************
     A*           PHON      -           ENTER BILLING CHGS. FOR TRAM
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 000500 00010
     A*         R PHONFM
     A*
     A            ACDE#I         3  0       COLHDG('AREA' 'CODE')
     A            FDIG#I         3  0       COLHDG('FIRST 3' 'DIGIT')
     A            LDIG#I         4  0       COLHDG('LAST 4' 'DIGIT')
     A            CALYYI         2S 0       COLHDG('CALL DATE' 'YEAR')
     A            CALMMI         2S 0       COLHDG('CALL DATE' 'MONTH')
     A            CALDDI         2S 0       COLHDG('CALL DATE' 'DAY')
     A            MINT#I         3  0       COLHDG('MINUTES' 'ON')
     A            AMOT#I         7  2       COLHDG('AMOUNT OF BILL')
     A            TIME#I         6          COLHDG('TIME OF CALL')
     A**********************************************************************
     A*           PLOG      -                PURCHASE ORDER PROB. LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R PLOGFM
     A*
     A            ACRECL         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A            ACCT#L         5  0       COLHDG('ACCOUNT' 'NUMBER')
     A            PONUML        10          COLHDG('P.O.' '#')
     A**********************************************************************
     A*           PRBD      -                PROBLEM WITH SHIPMENTS OF ONDETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00010
     A*         R PRBDFM
     A*
     A            HOLD#2         5  0       COLHDG('HOLD #')
     A            ACCT#2         5  0       COLHDG('ACCOUNT #')
     A            RJDTE2         5  0       COLHDG('RESOLVE JULIAN DATE')
     A            RSLY#2         2S 0       COLHDG('RESOLVE DATE YEAR')
     A            RSLM#2         2S 0       COLHDG('RESOLVE DATE MONTH')
     A            RSLD#2         2S 0       COLHDG('RESOLVE DATE DAY')
     A            PO###2        10          COLHDG('PURCHASE ORDER')
     A            TYPE#2         1          COLHDG('TYPE C G')
     A            RECPR2         7  0       COLHDG('RECEIPT/PRO#')
     A            QTYD#2         5  0       COLHDG('QTY')
     A            STAT#2         1          COLHDG('STATUS')
     A*                                     R= RETURN TO VENDOR
     A*                                     S= SENT TO ACCOUNT
     A*                                     O= OPEN
     A*                                     I= IN SALAVAGE
     A            WEIGH2         5  0       COLHDG('WEIGHT')
     A            PRO##2         7  0       COLHDG('PRO NUMBER')
     A            PORSN2        15          COLHDG('REASON FOR P.O.')
     A            PO#112        11          COLHDG('PURCHASE ORDER' 'NUMBER')
     A**********************************************************************
     A*           PRBL      -                PROBLEM WITH SHIPMENTS OF ON
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00010
     A*         R PRBLFM
     A*
     A            STATSH         1          COLHDG('STATUS')
     A            CNTR#H         3  0       COLHDG('CONTROL#')
     A            EJDTEH         5  0       COLHDG('ENTER JULIAN DATE')
     A            ENTY#H         2S 0       COLHDG('EDATE YEAR')
     A            ENTM#H         2S 0       COLHDG('EDATE MONTH')
     A            ENTD#H         2S 0       COLHDG('EDATE DAY')
     A            VEND#H        25          COLHDG('VENDOR NAME')
     A            HQTY#H         5  0       COLHDG('HOLD QTY')
     A            RQTY#H         5  0       COLHDG('RESOLVE QTY')
     A            REMRKH        25          COLHDG('REMARKS')
     A            PERSOH        25          COLHDG('AS PER PERSON')
     A            DAYSAH         2S 0       COLHDG('DAYS ACTIVE')
     A            EMPNMH         2          COLHDG('EMPLOYEE NAME')
     A            HOLD#H         5  0       COLHDG('HOLD#')
     A            UNIT#H        10          COLHDG('UNIT #')
     A            BAQTYH         5  0       COLHDG('BASE QTY')
     A            BAWGHH         5  0       COLHDG('BASE WGHT')
     A            BA$$$H         7  2       COLHDG('BASE $$$')
     A            BAPROH         7  0       COLHDG('BASE PRO#')
     A            WEIGHH         5  0       COLHDG('WEIGHT')
     A            REMR2H        40          COLHDG('REMARKS #2')
     A            CTRY#H         2S 0       COLHDG('CONTROL YEAR')
     A            CTRM#H         2S 0       COLHDG('CONTROL MONTH')
     A            CTRD#H         2S 0       COLHDG('CONTROL DAY')
     A            PERIDH         5          COLHDG('PERSON ENTERING')
     A            TYPE#H         1          COLHDG('TYPE CARTON GOH')
     A            CTRLJH         5  0       COLHDG('CONTROL DATE JUL ')
     A            UNLD#H         7  0       COLHDG('UNLOADING #')
     A            TERMNH         2          COLHDG('TERMINAL')
     A**********************************************************************
     A*           PROD      -                PRODUCTIVE FILE           ON
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 020000 00010
     A*         R PRODFM
     A*
     A            ACRERR         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            STATRR         1          COLHDG('STATUS CODE')
     A            JTYPRR         2          COLHDG('JOB TYPE')
     A*                                       UN = UNLOAD
     A*                                       SO = SORT
     A*                                       LA = LABEL
     A            CHEKRR         5  0       COLHDG('CHECK ID')
     A            TERMRR         2  0       COLHDG('TERMINAL #')
     A            UNLDRR         7  0       COLHDG('UNLOADING #')
     A            DOORRR         3  0       COLHDG('DOOR #')
     A            CARRRR         8          COLHDG('CARRIER')
     A            VEHIRR        15          COLHDG('VEHICLE ID')
     A            STDTRR          L         COLHDG('START' 'DATE')
     A                                      DFT('0001-01-01')
     A            STTMRR         4  0       COLHDG('START' 'TIME')
     A                                      DFT(0)
     A            EDDTRR          L         COLHDG('END' 'DATE')
     A                                      DFT('0001-01-01')
     A            EDTMRR         4  0       COLHDG('END' 'TIME')
     A                                      DFT(0)
     A            CNTRRR         5  0       COLHDG('CONTROL' 'CARTONS')
     A            GOHRRR         5  0       COLHDG('CONTROL' 'GOH')
      * JOB TYPE UNLOADING
GF   A*           PECTRR         5  0       COLHDG('PEOPLE' 'UNLOADING')
GF   A            PECTRR         4  2       COLHDG('PEOPLE' 'UNLOADING')
     A            UCTNRR         5  0       COLHDG('CARTONS' 'UNLOADED')
     A            UGOHRR         5  0       COLHDG('GOH' 'UNLOADED')
      * JOB TYPE SORTING
GF   A*           SRT#RR         2  0       COLHDG('PEOPLE' 'SORTING')
GF   A            SRT#RR         4  2       COLHDG('PEOPLE' 'SORTING')
     A            QSRTRR         5  0       COLHDG('CARTONS' 'SORTED')
      * JOB TYPE LABELING
GF   A*           LAB#RR         2  0       COLHDG('PEOPLE' 'LABELING')
GF   A            LAB#RR         4  2       COLHDG('PEOPLE' 'LABELING')
     A            QLABRR         5  0       COLHDG('CARTONS' 'LABELED')
      *
GF   A*           FORKRR         5  0       COLHDG('FORK LIFT HOURS')
GF   A            FORKRR         4  0       COLHDG('FORK LIFT HOURS')
     A                                      DFT(0)
      * JOB TYPE SCANNING
GF   A            SCN#RR         4  2       COLHDG('PEOPLE' 'SCANNING')
GF   A            QSCNRR         5  0       COLHDG('CARTONS' 'SCANNED')
      *
     A            SHFTRR         1          COLHDG('SHIFT')
      * JOB TIPE TICKETING
GF   A            TIC#RR         4  2       COLHDG('PEOPLE' 'TICKETING')
GF   A            QTICRR         5  0       COLHDG('CARTONS' 'TICKETED')
GF   A            UTICRR         5  0       COLHDG('UNITS' 'TICKETED')
      * JOB TYPE SHIPPING
GF   A            SHI#RR         4  2       COLHDG('PEOPLE' 'SHIPPING')
GF   A            QSHIRR         5  0       COLHDG('CARTONS' 'SHIPPED')
      * JOB TYPE QNA
GF   A            QNA#RR         4  2       COLHDG('PEOPLE' 'QNA')
GF   A            QNAIRR         5  0       COLHDG('TOT CRTN' 'QNA')
GF   A            TNAIRR         4  0       COLHDG('TOT TIME CRTN' 'QNA')
     A                                      DFT(0)
GF   A            QNAASN         5  0       COLHDG('TOT ASN CRTN')
GF   A            TNAASN         4  0       COLHDG('TOT TIME ASN CRTN')
     A                                      DFT(0)
GF   A            QNANASN        5  0       COLHDG('TOT NON ASN CRTN')
GF   A            TNANASN        4  0       COLHDG('TOT TIME NON ASN')
     A                                      DFT(0)
GF   A            QNAEXSS        5  0       COLHDG('TOT EXPSS CRTN')
GF   A            TNAEXSS        4  0       COLHDG('TOT TIME EXPSS' 'CRTN')
     A                                      DFT(0)
     A**********************************************************************
     A*           PRTF      -                USER PRINTER FILE DEFINITION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R PRTFFM
     A*
     A            WORKSJ        10          COLHDG('WORKSTATION' 'ID')
     A            PRTD#J        10          COLHDG('PRINT DEVICE' 'NAME')
     A            SPOQ#J        10          COLHDG('SPOOL' 'OUTPOUT' 'QUE')
     A            MESQ#J        10          COLHDG('MESSAGE' 'QUENE')
     A            AUTO#J         4          COLHDG('AUTO' 'TERM-WTR')
     A            DESC#J        40          COLHDG('DESCRIPTION' 'LINE')
     A**********************************************************************
     A*           RECC      -                RECEIPT COLOR SIZE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 030000 00010
     A*         R RECCFM
     A*
     A            ACRECR         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCT#R         5  0       COLHDG('CUSTOMER #')
     A            WREC#R         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            BRNCHR         3  0       COLHDG('BRANCH #')
     A            SEQNOR         5  0       COLHDG('SEQUENCE #')
     A            STYLER        12          COLHDG('STYLE')
     A            COLORR         7          COLHDG('COLOR')
     A            SIZESR         3          COLHDG('SIZE')
     A            QTY##R         5  0       COLHDG('QUANTITY')
     A            INVNOR         9          COLHDG('INVOICE #')
     A            ERROVR         1          COLHDG('OVERRIDE ERROR?')
     A            STORER         4  0       COLHDG('STORE #')
     A**********************************************************************
     A*           RECD      -                RECEIPT DETAIL MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0999999 032767 00010
     A*         R RECDFM
     A*
     A            ACRECD         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCT#D         5  0       COLHDG('CUSTOMER #')
     A            WREC#D         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            BRNCHD         3  0       COLHDG('BRANCH #')
     A            GRPCDD         3  0       COLHDG('GROUP' 'CODE')
     A*
     A* QUANTITIES & CHARGES
     A            TOINVD         5  0       COLHDG('QTY' 'INVOICED')
     A            TORECD         5  0       COLHDG('QTY' 'RECD')
     A            TOWGTD         5  0       COLHDG('TOTAL' 'WGT')
     A            TOWPUD         7  2       COLHDG('TOTAL' 'WPU')
     A            TONPUD         7  2       COLHDG('TOTAL' 'NPU')
     A            TOVADD         7  2       COLHDG('TOTAL' 'ADVANCE')
     A            TODELD         7  2       COLHDG('TOTAL' 'DELIVERY$')
     A            TOCOLD         7  2       COLHDG('TOTAL' 'COLLECT$')
     A            TOCOND         7  2       COLHDG('TOTAL' 'CONSOLI')
     A*
     A* ASSOCIATED PO&STYLE RECORDS:
     A            NUMPOD         3  0       COLHDG('# OF PO.S')
     A            STORED         4  0       COLHDG('STORE #')
     A**********************************************************************
     A*           RECH      -                RECEIPT HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 020000 00010
     A*         R RECHFM
     A*
     A            ACRECH         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*
     A            ACCT#H         5  0       COLHDG('CUSTOMER #')
     A            REC##H         6  0       COLHDG('RECEIPT #')
     A            WREC#H         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            RECDDH         2S 0       COLHDG('RECEIPT' 'DAY')
     A            RECMMH         2S 0       COLHDG('RECEIPT' 'MONTH')
     A            RECYYH         2S 0       COLHDG('RECEIPT' 'YEAR')
     A            REJULH         5  0       COLHDG('PROC.DATE..JULIAN')
     A            CONT#H         3  0       COLHDG('CONTROL #')
     A            STAT1H         1          COLHDG('RECEIPT' 'STATUS')
     A*                                         =  KEYED
     A*                                      P  =  PRINTED
     A*                                      R  =  RECEIVED/UPDATED
     A*                                      M  =  MANIFESTED
     A*                                      V  =  VOIDED
     A*                                      1  =  SELECTED FOR PRINTING
     A*                                      T  =  TRANSFER            G
     A*                                      L  =  LOADED
     A*
     A* SHIPPER DATA
     A            SHIPNH        25          COLHDG('SHIPPER NAME')
     A            SHAD1H        25          COLHDG('SHIPPER ADD1')
     A            SHAD2H        25          COLHDG('SHIPPER ADD2')
     A            SHZIPH         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHCODH         5  0       COLHDG('SHIPPER' 'CODE')
     A            SHSTAH         2          COLHDG('SHIPPER' 'STATE')
     A*
     A*  CARRIER & DRIVER
     A            ICAR#H         5  0       COLHDG('CARRIER' 'CODE')
     A            CARRIH         8          COLHDG('CARRIER' 'NAME')
     A            DRIVEH        10          COLHDG('DRIVER')
     A            VEHICH         6          COLHDG('VEHICLE #')
     A*  INVOICE
     A            INPROH         8  0       COLHDG('INBOUND' 'PRO#')
     A            INVNOH         9          COLHDG('INVOICE' '#')
     A            INVDDH         2S 0       COLHDG('INVOICE' 'DAY')
     A            INVMMH         2S 0       COLHDG('INVOICE' 'MONTH')
     A            INVYYH         2S 0       COLHDG('INVOICE' 'YEAR')
     A*
     A*  SHIPMENT DATA
     A            CTNGHH         1          COLHDG('CTN OR' 'GOH')
     A*                                        C = CARTONS
     A*                                        G = GARMENTS
     A            DSCODH         3  0       COLHDG('TYPE OF' 'GARMENT')
     A            OPENHH         1          COLHDG('OPEN' 'TO HANG')
     A            NOCHGH         1          COLHDG('NO' 'CHARGE')
     A            DEPT#H         4  0       COLHDG('DEPARTMENT' '#')
     A            ITEM#H         3  0       COLHDG('ITEM #')
     A*                                        CURRENTLY NOT USED
     A            SYSIDH         1          COLHDG('ACCOUNT' 'TYPE')
     A*                                         1 = WALSH
     A*                                         2 = FEDERATED A
     A*                                         3 = FEDERATED B
     A*                                         4 = LERNER
     A*                                         5 = TRI STATE
     A*                                         6 = J W MAYS
     A*                                         7 = WEST COAST
     A*                                         8 = COLUM. OHIO
     A*                                         9 = AVON MASS.
     A*                                         F = FLORIDA
     A*                                         G = GLOC. N.J.
     A*                                         P = PENN.
     A*                                         T = TARGET
     A*                                         Z = GREENSBORO
     A            WPUSHH         1          COLHDG('IFWPU' 'NO P/U CHG')
     A*                                         N = DONT CALC WALSH P/U CHG
     A            FREEAH         1          COLHDG('FREE' 'ASTRAY')
     A*                                         F = FREE ASTRAY
     A            PRADVH         1          COLHDG('PROTECT' 'CHARGES')
     A*                                           = ADVANCES PROTECTED
     A*                                        N  = ADVANCES UNPROTECTE
     A            BREAKH         1          COLHDG('NEEDS' 'BREAKDOWN')
     A*                                            = NO BREAKDOWN
     A*                                          Y = NEED BREAKDOWN
GP   A* FOR TARGET                               E = 210 ADV HANDLING EDID
GP   A*                                               (ORIGINAL) FOR OUR PU
GP   A* FOR TARGET                               O = 210 ADV HANDLING EDID
GP   A*                                               (ORIGINAL) FOR OUTSIDE
GP   A*                                                    PU
GP   A* FOR TARGET                               B = 210 ADV HANDLING EDID
GP   A*                                               (BAL DUE)
     A            REFNOH         7  0       COLHDG('REF NO')
     A            BLDGPH         1          COLHDG('PRINT' 'CODE')
     A            HANGCH         1          COLHDG('PRINT' 'HANG CARDS')
     A*                                         Y = PRINT HANG CARDS
     A            SEQNOH         3  0       COLHDG('SEQUENCE' '#')
     A            DAYS#H         3  0       COLHDG('# OF DAYS' 'ON DOCK')
     A            AMCCDH         1          COLHDG('MARKED AS FORCE OUT')
     A            EXCPTH        10          COLHDG('EXCEPTION' 'CODE')
     A*                                            ARRAY 10 X 1 CHAR
     A            BRNCDH         1          COLHDG('BRANCH PRINT')
     A*                                           = PRINT BRANCH & QTY
     A*                                         Y = PRINT ONLY BRANCHES
     A*
     A*  RECEIPT QUANTITYS & CHARGES
     A            BASQTH         5  0       COLHDG('BASED ON' 'QTY')
     A            BASWGH         5  0       COLHDG('BASED ON' 'WEIGHT')
     A            BAS$$H         7  2       COLHDG('BASED ON' 'ADV$')
     A            PURATH         5  2       COLHDG('PICK' 'UP' 'RATE')
     A            TOINVH         5  0       COLHDG('TOTAL' 'QTY' 'INV')
     A            TOQTYH         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWGTH         5  0       COLHDG('TOTAL' 'WGT')
     A            TOWPUH         7  2       COLHDG('TOTAL' 'WPU')
     A            TONPUH         7  2       COLHDG('TOTAL' 'NPU')
     A            TOADVH         7  2       COLHDG('TOTAL' 'ADVANCE')
     A            LHAULH         7  2       COLHDG('LINE HAUL')
     A            TOCONH         7  2       COLHDG('CONSOLIDATION')
     A            APRN$H         7  2       COLHDG('APRON' 'CHG')
     A            LINE$H         4  3       COLHDG('LINE ITEM' 'CHARGE')
     A            TOSURH         7  2       COLHDG('TOTAL' 'SURCHARGE')
     A            TOMNFH         7  2       COLHDG('TOTAL' 'MANIF CHG')
     A            INVAMH         7  2       COLHDG('TOTAL' 'BILLED AMT')
     A            ALLOCH         7  2       COLHDG('AMT' 'ALLOC' 'N/B')
     A            TOCOLH         7  2       COLHDG('TOTAL' 'COLLECT$')
     A            WANUMH         6  0       COLHDG('WALSH' 'INV#')
     A*
     A*  OUTBOUND DATA
     A            WMANFH         7  0       COLHDG('WALSH MANIFEST #')
     A            MANF#H         7  0       COLHDG('CUSTOMER MANIFEST#')
     A            MANDDH         2S 0       COLHDG('MANIFEST' 'DAY')
     A            MANMMH         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANYYH         2S 0       COLHDG('MANIFEST''YEAR')
     A            SHJULH         5  0       COLHDG('SHIP DATE..JULIAN')
     A            MANFLH         3  0       COLHDG('LOADING SEQUENCE')
     A            BLNUMH         9  0       COLHDG('B/L #')
     A            KEYREH         6  0       COLHDG('KEYREC #')
     A            CKDIGH         1          COLHDG('CHECK' 'DIGIT')
     A            TRLR1H         8          COLHDG('TRAILER 1')
     A            SEAL1H         8          COLHDG('SEAL #1')
     A*
     A*  ADVANCE CHARGES DATA
     A*  REFERENCE FIELD CHKN##H FOR CHECK NUMBER
     A            CHKNOH         5  0       COLHDG('D.C. NUMBER   ')
     A            ADVAMH         7  2       COLHDG('ADVANCE' 'AMOUNT')
     A            ADBILH         7  2       COLHDG('ADVANCE' 'BILLED')
     A*
     A*  SYSTEM FLAGS
     A            FLAG1H         1          COLHDG('PROCESS' 'FLAG')
     A*                                           = NOT PROCESSED BY DAILY
     A*                                       1   = PROCESSED BY DAILY
     A*                                       2   = PROCESSED BY WEEKLY
     A*                                       3   = PROCESSED BY MONTHLY
     A*                                       4   = PROCESSED BY HALF YEAR
     A            NOLHLH         1          COLHDG('NO LINE HAUL')
     A*                                        N = NO L-HAUL THIS RECPT
     A            NOCONH         1          COLHDG('NO CONSOLIDATION')
     A*                                        N = NO CONSOL THIS RECPT
     A            OPERIH         5          COLHDG('OPERATORS' 'INITS')
     A            SHORTH         1          COLHDG('SHORT?')
     A*
     A            BRCNTH         3  0       COLHDG('NUMBER OF BRANCHES')
     A            TERM#H         2          COLHDG('TERMINAL #')
     A            LOADCH         2  0       COLHDG('LOADING CODE')
     A*
     A*  ADVANCE CHARGES DATA
     A            CHK##H         6  0       COLHDG('ADVANCE' 'CKNO')
     A*
     A*  COLOR/SIZE HEADING TYPE
     A            HDTYPH         3  0       COLHDG('HEADING' 'TYPE')
     A*
     A*  PO REFUSAL AUTHORIZATION CODE
     A*  IS BEING USED FOR NEWTON INVOICE NUMBER ON DAILY BILLING.
     A            POAUTH         7  0       COLHDG('AUTHORIZATION' 'CODE')
     A*
     A*  RECEIPT UPDATE OPERID
     A            OPRUPH         5          COLHDG('UPDATE' 'ID')
     A*
     A*  FROM TERMINAL CODE
     A            BLDCDH         2          COLHDG('TERMINAL' 'CODE')
     A*
     A*  IMPORT CODE
     A            IPORTH         1          COLHDG('IMPORT' 'CODE')
     A*                                     I= IMPORT ITEM
     A*                                     A= AIR FREIGHT
     A*                                     D= DIRECT IMPORT
     A*  USED TO CAPTURE OLD QTY
     A            CTNHGH         5  0       COLHDG('CARTON CT' 'TO HANGING')
     A            SID##H         6  0       COLHDG('MARSHALLS SID#')
     A            PICDDH         2S 0       COLHDG('PICK-UP' 'DAY')
     A            PICMMH         2S 0       COLHDG('PICK-UP' 'MONTH')
     A            PICYYH         2S 0       COLHDG('PICK-UP' 'YEAR')
     A            SBL##H        12          COLHDG('OUTSID')
     A*                                     Contains Outbound Trailer +
     A*                                     for LNT Compton
     A            ISA##H         9  0       COLHDG('EDI CONTOL #')
     A            KEYR#H        10          COLHDG('KEY REC #')
     A            TYPCTH         1          COLHDG('TYPE OF CARTON')
     A*                                     F = FLAT
     A*                                     P = PICK
     A*                                     S = SLC
     A*                                     P = STC
     A            TYPGHH         1          COLHDG('TYPE OF GOH')
     A*                                     A = TOPS,BLOUSE ETC.
     A*                                     B = DRESS ETC.
     A*                                     C = COATS SUITS ETC.
     A            EDISTH         1          COLHDG('EDI STATUS CODE')
     A* NOW                                 'Y' MEANS EDI SENT
     A* NOW                                     (USED FOR TJMAX)
     A* BEFORE                              ' ' MEANS BEEN SENT BEFORE
     A* BEFORE                              'Y' MEANS TO BE SENT BEFORE
     A            EDICDH         2          COLHDG('EDI CODE')
     A*                                     '00' NEEDS TO BE SENT
     A*                                     '01' FOR VOID
     A*                                     '05' FOR REPLACEMENT
     A*                                     'SU' STATUS UPDATE
GP   A*                                      FOR TARGET 214:
GP   A*                                        A4 == ADVANCE 214 SENT
GP   A*                                        C4 = CROSSDOCK/LINEHAUL
GP   A*                                               214 SENT
GP   A*                                        AC = ADVANCE & CROSSDOCK 214
     A            SBL2#H        20          COLHDG('SHIPPERS B/L #')
     A            LODDDH         2S 0       COLHDG('LOADED' 'DAY')
     A            LODMMH         2S 0       COLHDG('LOADED' 'MONTH')
     A            LODYYH         2S 0       COLHDG('LOADED' 'YEAR')
     A            LDTMEH         4  0       COLHDG('LOADED' 'TIME')
     A            LDURPH         5          COLHDG('LOADED' 'BY')
     A            PRFLGH         1          COLHDG('PROBLEM FLAG')
     A*
     A* ADDED 7/2016 FOR TJX RECEIPTS - LADDER PLAN DATE AND FLAG
     A            CFFLGH         1          COLHDG('LADDER' 'FLAG')
     A*                                          = NO LADDER PLAN
     A*                                        C = CURRENT MONTH
     A*                                        F = 1 MONTH FUTURE
     A*                                        + = FUTURE > 1 MONTH
     A            LDRDTH         7  0       COLHDG('LADDER DATE')
     A*                                             CYYMMDD FORMAT
     A**********************************************************************
     A*           RECP      -                RECEIPT PO & STYLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   9999999 030000 00010
     A*         R RECPFM
     A*
     A            ACRECF         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCT#F         5  0       COLHDG('CUSTOMER #')
     A            WREC#F         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            BRNCHF         3  0       COLHDG('BRANCH #')
     A            PONUMF        10          COLHDG('PO #')
     A            QTY##F         5  0       COLHDG('QUANTITY')
     A            STYLEF        12          COLHDG('STYLE')
     A            APRSQF         5  0       COLHDG('WEIGHT PER P.O.')
     A            STOREF         4  0       COLHDG('STORE #')
     A            DEPT#F         4  0       COLHDG('DEPARTMENT')
     A            CBM##F         5  3       COLHDG('CUBIC MEASURMENT')
     A            PO#11F        11          COLHDG('PO NUMBER')
     A**********************************************************************
     A*           RECT      -                RECEIPT HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 030000 00010
     A*         R RECTFM
     A*
     A            ACRECT         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*
     A            ACCT#T         5  0       COLHDG('CUSTOMER #')
     A            REC##T         6  0       COLHDG('RECEIPT #')
     A            WREC#T         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            RECDDT         2S 0       COLHDG('RECEIPT' 'DAY')
     A            RECMMT         2S 0       COLHDG('RECEIPT' 'MONTH')
     A            RECYYT         2S 0       COLHDG('RECEIPT' 'YEAR')
     A            REJULT         5  0       COLHDG('PROC.DATE..JULIAN')
     A            CONT#T         3  0       COLHDG('CONTROL #')
     A            STAT1T         1          COLHDG('RECEIPT' 'STATUS')
     A*                                         =  KEYED
     A*                                      P  =  PRINTED
     A*                                      R  =  RECEIVED/UPDATED
     A*                                      M  =  MANIFESTED
     A*                                      V  =  VOIDED
     A*                                      1  =  SELECTED FOR PRINTIN
     A*
     A* SHIPPER DATA
     A            SHIPNT        25          COLHDG('SHIPPER NAME')
     A            SHAD1T        25          COLHDG('SHIPPER ADD1')
     A            SHAD2T        25          COLHDG('SHIPPER ADD2')
     A            SHZIPT         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHCODT         5  0       COLHDG('SHIPPER' 'CODE')
     A            SHSTAT         2          COLHDG('SHIPPER' 'STATE')
     A*
     A*  CARRIER & DRIVER
     A            ICAR#T         5  0       COLHDG('CARRIER' 'CODE')
     A            CARRIT         8          COLHDG('CARRIER' 'NAME')
     A            DRIVET        10          COLHDG('DRIVER')
     A            VEHICT         6          COLHDG('VEHICLE #')
     A*  INVOICE
     A            INPROT         8  0       COLHDG('INBOUND' 'PRO#')
     A            INVNOT         9          COLHDG('INVOICE' '#')
     A            INVDDT         2S 0       COLHDG('INVOICE' 'DAY')
     A            INVMMT         2S 0       COLHDG('INVOICE' 'MONTH')
     A            INVYYT         2S 0       COLHDG('INVOICE' 'YEAR')
     A*
     A*  SHIPMENT DATA
     A            CTNGHT         1          COLHDG('CTN OR' 'GOH')
     A*                                        C = CARTONS
     A*                                        G = GARMENTS
     A            DSCODT         3  0       COLHDG('TYPE OF' 'GARMENT')
     A            OPENHT         1          COLHDG('OPEN' 'TO HANG')
     A            NOCHGT         1          COLHDG('NO' 'CHARGE')
     A            DEPT#T         4  0       COLHDG('DEPARTMENT' '#')
     A            ITEM#T         3  0       COLHDG('ITEM #')
     A*                                        CURRENTLY NOT USED
     A            SYSIDT         1          COLHDG('ACCOUNT' 'TYPE')
     A*                                         1 = WALSH
     A*                                         2 = FEDERATED A
     A*                                         3 = FEDERATED B
     A*                                         4 = LERNER
     A*                                         5 = TRI STATE
     A*                                         6 = J W MAYS
     A*                                         7 = WEST COAST
     A            WPUSHT         1          COLHDG('IFWPU' 'NO P/U CHG')
     A*                                         N = DONT CALC WALSH P/U CHG
     A            FREEAT         1          COLHDG('FREE' 'ASTRAY')
     A*                                         F = FREE ASTRAY
     A            PRADVT         1          COLHDG('PROTECT' 'CHARGES')
     A*                                           = ADVANCES PROTECTED
     A*                                        N  = ADVANCES UNPROTECTE
     A            BREAKT         1          COLHDG('NEEDS' 'BREAKDOWN')
     A*                                            = NO BREAKDOWN
     A*                                          Y = NEED BREAKDOWN
     A            REFNOT         7  0       COLHDG('REF NO')
     A            BLDGPT         1          COLHDG('PRINT' 'CODE')
     A            HANGCT         1          COLHDG('PRINT' 'HANG CARDS')
     A*                                         Y = PRINT HANG CARDS
     A            SEQNOT         3  0       COLHDG('SEQUENCE' '#')
     A            DAYS#T         3  0       COLHDG('# OF DAYS' 'ON DOCK')
     A            AMCCDT         1          COLHDG('IMPORT' 'DOMESTIC')
     A            EXCPTT        10          COLHDG('EXCEPTION' 'CODE')
     A*                                            ARRAY 10 X 1 CHAR
     A            BRNCDT         1          COLHDG('BRANCH PRINT')
     A*                                           = PRINT BRANCH & QTY
     A*                                         Y = PRINT ONLY BRANCHES
     A*
     A*  RECEIPT QUANTITYS & CHARGES
     A            BASQTT         5  0       COLHDG('BASED ON' 'QTY')
     A            BASWGT         5  0       COLHDG('BASED ON' 'WEIGHT')
     A            BAS$$T         7  2       COLHDG('BASED ON' 'ADV$')
     A            PURATT         5  2       COLHDG('PICK' 'UP' 'RATE')
     A            TOINVT         5  0       COLHDG('TOTAL' 'QTY' 'INV')
     A            TOQTYT         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWGTT         5  0       COLHDG('TOTAL' 'WGT')
     A            TOWPUT         7  2       COLHDG('TOTAL' 'WPU')
     A            TONPUT         7  2       COLHDG('TOTAL' 'NPU')
     A            TOADVT         7  2       COLHDG('TOTAL' 'ADVANCE')
     A            LHAULT         7  2       COLHDG('LINE HAUL')
     A            TOCONT         7  2       COLHDG('CONSOLIDATION')
     A            APRN$T         7  2       COLHDG('APRON' 'CHG')
     A            LINE$T         4  3       COLHDG('LINE ITEM' 'CHARGE')
     A            TOSURT         7  2       COLHDG('TOTAL' 'SURCHARGE')
     A            TOMNFT         7  2       COLHDG('TOTAL' 'MANIF CHG')
     A            INVAMT         7  2       COLHDG('TOTAL' 'BILLED AMT')
     A            ALLOCT         7  2       COLHDG('AMT' 'ALLOC' 'N/B')
     A            TOCOLT         7  2       COLHDG('TOTAL' 'COLLECT$')
     A            WANUMT         6  0       COLHDG('WALSH' 'INV#')
     A*
     A*  OUTBOUND DATA
     A            WMANFT         7  0       COLHDG('WALSH MANIFEST #')
     A            MANF#T         7  0       COLHDG('CUSTOMER MANIFEST#')
     A            MANDDT         2S 0       COLHDG('MANIFEST' 'DAY')
     A            MANMMT         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANYYT         2S 0       COLHDG('MANIFEST''YEAR')
     A            SHJULT         5  0       COLHDG('SHIP DATE..JULIAN')
     A            MANFLT         3  0       COLHDG('LOADING SEQUENCE')
     A            BLNUMT         9  0       COLHDG('B/L #')
     A            KEYRET         6  0       COLHDG('KEYREC #')
     A            CKDIGT         1          COLHDG('CHECK' 'DIGIT')
     A            TRLR1T         8          COLHDG('TRAILER 1')
     A            SEAL1T         8          COLHDG('SEAL #1')
     A*
     A*  ADVANCE CHARGES DATA
     A            CHKNOT         5  0       COLHDG('ADVANCE' 'CKNO')
     A            ADVAMT         7  2       COLHDG('ADVANCE' 'AMOUNT')
     A            ADBILT         7  2       COLHDG('ADVANCE' 'BILLED')
     A*
     A*  SYSTEM FLAGS
     A            FLAG1T         1          COLHDG('PROCESS' 'FLAG')
     A*                                           = NOT PROCESSED BY DAILY
     A*                                       1   = PROCESSED BY DAILY
     A*                                       2   = PROCESSED BY WEEKLY
     A*                                       3   = PROCESSED BY MONTHLY
     A*                                       4   = PROCESSED BY HALF YEAR
     A            NOLHLT         1          COLHDG('NO LINE HAUL')
     A*                                        N = NO L-HAUL THIS RECPT
     A            NOCONT         1          COLHDG('NO CONSOLIDATION')
     A*                                        N = NO CONSOL THIS RECPT
     A            OPERIT         5          COLHDG('OPERATORS' 'INITS')
     A            SHORTT         1          COLHDG('SHORT?')
     A*
     A            BRCNTT         3  0       COLHDG('NUMBER OF BRANCHES')
     A            TERM#T         2          COLHDG('TERMINAL #        ')
     A            LOADCT         2  0       COLHDG('LOADING CODE      ')
     A*
     A*  ADVANCE CHARGES DATA
     A            CHK##T         6  0       COLHDG('ADVANCE' 'CKNO')
     A*
     A*  COLOR/SIZE HEADING TYPE
     A            HDTYPT         3  0       COLHDG('HEADING' 'TYPE')
     A*
     A*  PO REFUSAL AUTHORIZATION CODE
     A            POAUTT         7  0       COLHDG('AUTHORIZATION' 'CODE')
     A*
     A*  RECEIPT UPDATE OPERID
     A            OPRUPT         5          COLHDG('UPDATE' 'ID')
     A*
     A*  FROM TERMINAL CODE
     A            BLDCDT         2          COLHDG('TERMINAL' 'CODE')
     A*
     A*  INPORT CODE
     A            IPORTT         1          COLHDG('INPORT' 'CODE')
     A*                                     I= IMPORT ITEM
     A*  INPORT CODE
     A            CTNHGT         5  0       COLHDG('CARTON CT' 'TO HANGING')
     A**********************************************************************
     A*           SCAC      -                                          ICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R SCACFM
     A*
     A            SCACCS         4          COLHDG('SCAC CODE')
     A            CARRNS        15          COLHDG('CARRIER NAME')
     A**********************************************************************
     A*           SIZE      -                                          ICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R SIZEFM
     A*
     A            SEQNOZ         3  0       COLHDG('SEQ NUMBER')
     A            SIZESZ        36          COLHDG('SIZES ARRAY 12 X 3')
     A**********************************************************************
     A*           SEQE      -                                          ICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R SEQEFM
     A*
     A            SEQNOC         3  0       COLHDG('SEQ NUMBER')
     A            ACCTSC         5  0       COLHDG('ACCOUNT #')
     A            DEPT#C         4  0       COLHDG('DEPT#')
     A            CTNGHC         1          COLHDG('CTN OR' 'GOH')
     A*                                        C = CARTONS
     A*                                        G = GARMENTS
     A**********************************************************************
     A*           SYID      -      SYSTEM ID FILE                      ICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R SYIDFM
     A*
     A            SYIDSY         1          COLHDG('SYSTEM ID')
     A            TERMSY         2          COLHDG('TERMINAL ID')
     A            COMPSY         3          COLHDG('COMPANY CODE')
     A*                                            "NRT"
     A*                                            "NRC"
     A**********************************************************************
     A*           TABL      -                TABLES                    ICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R TABLFM
     A*
     A            TABLEW         6          COLHDG('TABLE NAME')
     A            TCODEW        10          COLHDG('CODE - KEY')
     A            DESCRW        80          COLHDG('DESCRIPTION')
     A**********************************************************************
     A*           TJAC      -                TJX ACCOUNTS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R TJACFM
     A*
     A            ACCT#TX        5  0
     A**********************************************************************
     A*           TJPO      -                TJ MAX WEEKLY POS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R TJPOFM
     A*
     A            ACNAMTJ       25
     A            PONUMTJ       10
     A            VEHIDTJ       11
     A            ZIPCDTJ        5S 0
     A            CTNGHTJ        1
     A            TOQTYTJ        5S 0
     A            TOWGTTJ        5S 0
     A            INPROTJ        8S 0
     A            MDATETJ        6S 0
     A            CITYTJ        12
     A**********************************************************************
     A*   ACCOUNTS USED IN WEEKLY REPORT DRIVER PROGRAM                ICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00003
     A*         R TRAXFM
     A            ACCT#X         5  0       COLHDG('ACCOUNT #')
     A**********************************************************************
     A*           PGMS      -                PROGRAM STATUS DS FIELDS  ICAL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00003
     A*         R PGMSFM
     A            PSMNAM        10          COLHDG('PROGRAM NAME')
     A            PSSTAT         5S 0       COLHDG('STATUS CODE')
     A            PSPRES         5S 0       COLHDG('PREVIOUS STATUS CODE')
     A            PSSRC#         8          COLHDG('RPG SRC STMT SEQ #')
     A            PSRTNM         8          COLHDG('RTN IN ERROR')
     A            PSPAR#         3S 0       COLHDG('# OF PARMS USED')
     A            PSEXPT         3          COLHDG('EXCEPTION TYPE')
     A            PSEXP#         4          COLHDG('EXCEPTION #')
     A            PSMI#          4          COLHDG('MI/ODT #')
     A            PSMSGA        30          COLHDG('WORK AREA FOR MSG')
     A            PSLIBR        10          COLHDG('PGM LIBRARY')
     A            PSRTVE        80          COLHDG('RETRVD EXCPT DATA')
     A            PSEXID         4          COLHDG('EXCEPTION ID')
     A            PSXXX1        26          COLHDG('NOT USED')
     A            PSLFIL         8          COLHDG('LAST FILE USED')
     A            PSLFST        35          COLHDG('LAST FILE STATUS')
     A            PSJOBN        10          COLHDG('JOB NAME')
     A            PSUSER        10          COLHDG('USER NAME')
     A            PSJOB#         6S 0       COLHDG('JOB NUMBER')
     A            PSJDAT         6S 0       COLHDG('JOB DATE')
     A            PSEDAT         6S 0       COLHDG('EXECUTION DATE')
     A            PSETIM         6S 0       COLHDG('EXECUTION TIME')
     A            PSCDAT         6          COLHDG('COMPILE DATE')
     A            PSCTIM         6          COLHDG('COMPILE TIME')
     A            PSCLVL         4          COLHDG('LEVEL OF COMPILER')
     A            PSSRCF        10          COLHDG('SRC FILE NAME')
     A            PSSRCL        10          COLHDG('SRC LIB NAME')
     A            PSSMBR        10          COLHDG('SRC FILE MBR NAME')
     A            PSXXX2        96          COLHDG('NOT USED')
     A*                                                                *****
     A**********************************************************************
     A*           VALU      -                VALUE-CITY O.D./ MANF.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 010000 00010
     A*         R VALUFM
     A*
     A            STATV1         1          COLHDG('STATUS')
     A            PO##V1        10          COLHDG('P.O. #')
     A            UNITV1         5S 0       COLHDG('UNITS')
     A            GOHPV1         5S 0       COLHDG('GOH PCS')
     A            CARTV1         5S 0       COLHDG('CARTONS')
     A            WGHTV1         5S 0       COLHDG('TOTAL WEIGHT')
     A            CUBEV1         5S 0       COLHDG('TOTAL CUBE')
     A            INBTV1         3          COLHDG('INBOUND' 'TRANSIT TYPE')
     A            ICARV1        10          COLHDG('INBOUND' 'CARRIER')
     A            ITRLV1         6S 0       COLHDG('INBOUND' 'TRAILER#')
     A            PICDV1         6S 0       COLHDG('P/U BOL DATE')
     A            REC#V1         6S 0       COLHDG('RECEIPT #')
     A            RECDV1         6S 0       COLHDG('RECEIPT DATE')
     A            MAN#V1         7S 0       COLHDG('MANIFEST' 'NUMBER')
     A            SHPDV1         6S 0       COLHDG('O/B SHIP DATE')
     A            OCARV1        15          COLHDG('O/B CARRIER')
     A            OTRLV1         8          COLHDG('O/B TRAILER')
     A            OTHDV1         6S 0       COLHDG('OTHER DATES')
     A*                                                                *****
     A**********************************************************************
     A*           VALS      -                VALUE-CITY LEV.OF SERVC.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 010000 00010
     A*         R VALSFM
     A*
     A            ACCTV2         5  0       COLHDG('CUSTOMER #')
     A            MANFV2         7  0       COLHDG('CUSTOMER MANIFEST#')
     A            MANDV2         6S 0       COLHDG('MANIFEST' 'DATE')
     A            TRLRV2         8          COLHDG('TRAILER 1')
     A            OCARV2        15          COLHDG('OUTBOUND CARRIER')
     A*
     A            REC#V2         6  0       COLHDG('RECEIPT #')
     A            RECDV2         6S 0       COLHDG('RECEIPT DATE')
     A            DEPTV2         4  0       COLHDG('DEPARTMENT' '#')
     A            PICDV2         6S 0       COLHDG('P/U BOL DATE')
     A            CARRV2         8          COLHDG('CARRIER' 'NAME')
     A            CTNGV2         1          COLHDG('CTN OR' 'GOH')
     A            LOADV2         2  0       COLHDG('LOADING CODE')
     A*
     A            PONUV2        10          COLHDG('PO #')
     A            QTY#V2         5  0       COLHDG('QUANTITY')
     A            APRSV2         5  0       COLHDG('WEIGHT PER P.O.')
     A*
     A**********************************************************************
     A*           UNVC      -                UNYSON VALUE-CITY OD MANF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 010000 00010
     A*         R UNVCFM
     A*
     A            DNAMV3        30          COLHDG('DEST. NAME')
     A            DADDV3        30          COLHDG('DEST. ADDRESS')
     A            DAD2V3        30          COLHDG('DEST. ADDRESS 2')
     A            DCTYV3        30          COLHDG('DEST. CITY')
     A            DSTAV3        30          COLHDG('DEST. STATE')
     A            DZIPV3        10          COLHDG('DEST. ZIP')
     A            ONAMV3        30          COLHDG('ORIG. NAME')
     A            OADDV3        30          COLHDG('ORIG. ADDRESS')
     A            OAD2V3        30          COLHDG('ORIG. ADDRESS 2')
     A            OCTYV3        30          COLHDG('ORIG. CITY')
     A            OSTAV3        30          COLHDG('ORIG. STATE')
     A            OZIPV3        10          COLHDG('ORIG. ZIP')
     A            SDATV3        10          COLHDG('SHIP REQUEST DATE')
     A            COMMV3        30          COLHDG('COMMODITY')
     A            FIXTV3         1          COLHDG('FIXTURE')
     A            FCLSV3         5          COLHDG('FREIGHT CLASS')
     A            ORDTV3         1          COLHDG('ORDER TYPE')
     A            SHP#V3        10          COLHDG('SHIPMENT #')
     A            VENDV3        10          COLHDG('VENDOR')
     A            CONSV3         5          COLHDG('CONSIGNEE ID')
     A            PO##V3        10          COLHDG('PO #')
     A            WGHTV3         5          COLHDG('WEIGHT')
     A            VOLUV3         5          COLHDG('VOLUME')
     A            PIECV3        10          COLHDG('PIECES')
     A            EDATV3        10          COLHDG('EARLIEST SHIP DATE')
     A            CDATV3        10          COLHDG('CANCEL DATE')
     A            SHFRV3         6          COLHDG('SHIP FROM ID')
     A            LWGTV3        10          COLHDG('LOAD LEVEL WEIGHT')
     A            LVOLV3        10          COLHDG('LOAD LEVEL VOLUME')
     A            LPCSV3        10          COLHDG('LOAD LEVEL PIECES')
     A            OVRFV3         1          COLHDG('OVERFLOW FLAG')
     A            TRL#V3       255          COLHDG('TRAILER #')
     A            DEPTV3        10          COLHDG('DEPARTMENT')
     A            ADATV3        10          COLHDG('AVAILABLE TO SHIP')
     A            SCACV3        10          COLHDG('SCAC CODE')
     A            SHPFV3         1          COLHDG('SHIP FLAG')
     A*
     A**********************************************************************
     A*           VEND      -            CUSTOMER PROGRAMS USED
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 005000 00010
     A*         R VENDFM
     A*
     A            VEND#8         5  0       COLHDG('VENDOR   #')
     A            NAME#8        25          COLHDG('V NAME  #')
     A            ADRR#8        25          COLHDG('ADDRESS')
     A            CITY#8        16          COLHDG('CITY')
     A            STAT#8         2          COLHDG('VENDOR' 'STATE')
     A            ZIPC#8         5  0       COLHDG('VENDOR' 'ZIP')
     A            SYSID8         1          COLHDG('SYSTEM')
     A            SPECL8         1          COLHDG('SPECIAL CODE')
     A*                                     'Y' NO BILL BACK
     A*                                     '4' ?
     A*
     A**********************************************************************
     A*           ARMF      -            AR MANFIEST CONS. INVOICE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000500 00010
     A*         R ARMFFM
     A*
     A            WINV#Y         7  0       COLHDG('WALSH' 'INV#')
     A            MANDDY         2S 0       COLHDG('MANIFEST' 'DAY')
     A            MANMMY         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANYYY         2S 0       COLHDG('MANIFEST' 'YEAR')
     A            MANF#Y         7  0       COLHDG('CUSTOMER MANIFEST#')
     A            TRLR1Y         8          COLHDG('TRAILER 1')
     A            ACCT#Y         5  0       COLHDG('CUSTOMER #')
     A            TOCONY         7  2       COLHDG('TOTAL CONS CHG')
     A            ADVY$Y         7  2       COLHDG('PROTECT ADVANCES')
     A            TOLHLY         7  2       COLHDG('TOTAL LINE HAUL$')
     A            TOMSCY         7  2       COLHDG('TOTAL MISC CHG')
     A            SCACCY         4          COLHDG('SCAC' 'CODE')
     A            OBPR#Y        10          COLHDG('OUTBOUND PRO#')
     A            OBPR2Y        13          COLHDG('OUTBOUND PRO#')
     A            TERM#Y         2  0       COLHDG('TERMINAL #')
     A*
     A*  ADDITIONAL FIELDS ADDED 2/05 FOR NRT AUTO PRO ALLOCATION
     A            COMPNY         3          COLHDG('COMPANY' 'CODE')
     A*                                        NOTE: NRC OR NRT
     A            BILL#Y         5  0       COLHDG('NRT BILL TO')
     A            TOFSCY         7  2       COLHDG('FUEL' 'SURCHARGE')
     A*  ADDITIONAL FIELDS ADDED 11/10 FOR QTY/WGT TOTALS
     A            ACTQTY         5  0       COLHDG('ACTUAL CTN QTY')
     A            AGOQTY         5  0       COLHDG('ACTUAL GOH QTY')
     A            ACTWTY         5  0       COLHDG('ACTUAL CTN WGT')
     A            AGOWTY         5  0       COLHDG('ACTUAL GOH WGT')
     A**********************************************************************
     A*           EDIN      -      EDI FILE FOR CONSIGNEE INFO. FOR N1
     A*                            SEGMENT OF 214 DOCUMENT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EDINFM
     A*
     A            ACCT#4         5  0       COLHDG('CUSTOMER #')
     A            NAME#4        35          COLHDG('NAME')
     A            SHCOD4        20          COLHDG('DC LOCATION #')
     A            ADD1#4        35          COLHDG('ADDRESS 1')
     A            ADD2#4        35          COLHDG('ADDRESS 2')
     A            CITY#4        30          COLHDG('CITY')
     A            STATE4         2          COLHDG('STATE')
     A            ZIPC#4        11          COLHDG('ZIP CODE')
     A            CTRY#4         3          COLHDG('COUNTRY CODE')
     A**********************************************************************
     A*           EWRK    -    5       WORK FILE FOR AF-AG SEGMENT BEING CREATED
     A*                                 FOR RECEIVING RECORDS AND CHANGE STATUS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EWRKFM
     A*
     A            ACCT#5         5  0       COLHDG('CUSTOMER #')
     A            REC##5         6  0       COLHDG('RECEIPT#')
     A            WREC#5         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            SBL##5        12          COLHDG('SHIPPER B/L')
     A            RECDT5         6S 0       COLHDG('RECEIPT' 'DATE')
     A*                                     YYMMDD
     A            SHIPN5        25          COLHDG('SHIPPER NAME')
     A            SHAD15        25          COLHDG('SHIPPER CITY')
     A            SHZIP5         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHSTA5         2          COLHDG('SHIPPER' 'STATE')
     A*
     A            CTNGH5         1          COLHDG('CTN OR' 'GOH')
     A            DEPT#5         4  0       COLHDG('DEPARTMENT' '#')
     A            TOINV5         7  0       COLHDG('TOTAL' 'QTY' 'INV')
     A            TOQTY5         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWGT5         5  0       COLHDG('TOTAL' 'WGT')
     A            TOADV5         7  2       COLHDG('TOTAL' 'ADVANCE')
     A            PICDT5         6S 0       COLHDG('PICK-UP' 'DATE')
     A*                                     YYMMDD
     A            CCPPT5         2          COLHDG('PRE-PAID OR COLLECT')
     A            TDATE5         6  0       COLHDG('TODAYS DATE' )
     A*                                     YYMMDD
     A            EDIST5         2          COLHDG('STATUS CODE')
     A            STATF5         2          COLHDG('FOR AF AD CODE')
     A            STATG5         2          COLHDG('FOR AG CODE')
     A            TOCOL5         7  2       COLHDG('TOTAL' 'COLLECT')
     A            TDATG5         6  0       COLHDG('TODAYS DATE AG')
     A*                                     YYMMDD
     A            TYPAP5         2          COLHDG('TYPE OF APP.')
     A*                                     SS = SINGLE SHIPPMENT
     A*                                     TM = TRAILER MANIFEST
     A            TRL##5         8          COLHDG('TRAILER #')
     A            OSCAC5         4          COLHDG('OUTBOUND SCAC')
     A            ATYPE5         1          COLHDG('A/C TYPE')
     A**                                    VALUES('C' = CONSOLIDATION A/C)
     A            AKEY5          6          COLHDG('A/C+TYPE')
     A*           AKEY5          6  0       COLHDG('A/C+TYPE')
     A*                                     TYPE = 1 FOR LTL
     A*                                     TYPE= 2 FOR CONS.
     A* NEW LENGTH B/L#
     A            SBL#25        20          COLHDG('SHIPPER B/L')
     A            STATC5         2          COLHDG('FOR RA' 'CODE')
     A            CDATE5         6  0       COLHDG('VEND' 'CALL DATE')
     A            WINV#5         7  0       COLHDG('WALSH' 'INV#')
GP   A            MANFD5         8  0       COLHDG('MANF' 'DATE')
GP   A            MANFJ5         5  0       COLHDG('MANF' 'JUL.DATE')
GP   A            RELSJ5         5  0       COLHDG('REL#')
GP   A            CARSJ5         4          COLHDG('CARRIER' 'SCAC')
GP   A            N1TYP5         2          COLHDG('N1' 'TYPE')
GP   A*                                        "CS"
GP   A            N103Q5         2          COLHDG('N103' 'QUAL')
GP   A*                                        "93"
GP   A            N104ID         2          COLHDG('N104' 'ID')
GP   A*                                        "NV" (EAST COAST)
GP   A*                                        "CP" (WEST COAST)
GP02 A            ACCT#_EDI      5  0       COLHDG('ACCT#' 'EDI 212')
     A**********************************************************************
     A*           WRKE    -    6       WORK FILE FOR 210 FORMAT HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R WRKEFM
     A*
     A            ACCT#6         5  0       COLHDG('CUSTOMER #')
     A            REC##6         6  0       COLHDG('RECEIPT#')
     A            WREC#6         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            MANF#6         7  0       COLHDG('MANIFEST NUMBER')
     A            MANDT6         6S 0       COLHDG('MANIFEST DATE')
     A*                                     YYMMDD
     A            SBL##6        12          COLHDG('SHIPPER B/L')
     A            SHIPN6        25          COLHDG('SHIPPER NAME')
     A            SHAD16        25          COLHDG('SHIPPER CITY')
     A            SHZIP6         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHSTA6         2          COLHDG('SHIPPER' 'STATE')
     A*
     A            DEPT#6         4  0       COLHDG('DEPARTMENT' '#')
     A            PICDT6         6S 0       COLHDG('PICK-UP' 'DATE')
     A*                                     YYMMDD
     A            CCPPT6         2          COLHDG('PRE-PAID OR COLLECT')
     A            TDATE6         6  0       COLHDG('TODAYS DATE' )
     A*                                     YYMMDD
     A            TOCOL6         7  2       COLHDG('TOTAL' 'COLLECT')
     A            PONM16        10          COLHDG('FIRST P.O.#')
     A            PONM26        10          COLHDG('SECOND P.O.#')
     A            LOCCD6         2          COLHDG('DC LOCATION CODE')
     A            CODE#6        15          COLHDG('MANIFEST-DC LOC-REC#')
     A            FACCD6         3          COLHDG('FACILITY CODE')
     A            TOWGT6         5  0       COLHDG('TOTAL' 'WGT')
     A            TOINV6         7  0       COLHDG('TOTAL' 'QTY' 'INV')
     A            UNITQ6         3          COLHDG('QTY' 'QUALIFIER')
     A            ATYPE6         1          COLHDG('A/C TYPE')
     A**                                    VALUES('C' = CONSOLIDATION A/C)
     A            AKEY6          6          COLHDG('A/C+TYPE')
     A***         AKEY6          6  0       COLHDG('A/C+TYPE')
     A*                                     TYPE = 1 FOR LTL
     A*                                     TYPE= 2 FOR CONS.
     A* NEW LENGTH B/L#
     A            SBL#26        20          COLHDG('SHIPPER B/L')
     A**********************************************************************
     A*           WRKD    -    7       WORK FILE FOR 210 FORMAT DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R WRKDFM
     A*
     A            ACCT#7         5  0       COLHDG('CUSTOMER #')
     A            WREC#7         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            LINE#7         2  0       COLHDG('LINE #')
     A            SEQ##7         2  0       COLHDG('SEQ  #')
     A            RECDT7         6S 0       COLHDG('RECEIPT' 'DATE')
     A*                                     YYMMDD
     A            CTNGH7         1          COLHDG('CTN OR' 'GOH')
     A            TOINV7         7  0       COLHDG('TOTAL' 'QTY' 'INV')
     A            TOQTY7         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWGT7         5  0       COLHDG('TOTAL' 'WGT')
     A            TOCHG7         7  2       COLHDG('TOTAL' 'CHARGE')
     A**          TOADV7         7  2       COLHDG('TOTAL' 'ADVANCE')
     A**          TOCON7         7  2       COLHDG('TOTAL' 'COLLECT')
     A**          TODEL7         7  2       COLHDG('TOTAL LINE HAUL')
     A            TRL##7         8          COLHDG('TRAILER #')
     A            UNITQ7         3          COLHDG('QTY' 'QUALIFIER')
     A            REFNU7         2          COLHDG('REF' 'NUMBER')
     A            REFDE7        50          COLHDG('REF' 'DESC')
     A            GROSW7         2          COLHDG('GROSS WGHT CD')
     A            FRATQ7         2          COLHDG('FREIGHT' 'RATE QUALIFIER')
     A*
     A**********************************************************************
     A*           E#PM    -    9       PO FILE FOR 210 FORMAT DETAIL
     A*                                FOR MERVYN'S EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R E#PMFM
     A*
     A            ACCT#9         5  0       COLHDG('CUSTOMER #')
     A            WREC#9         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            LINE#9         2  0       COLHDG('LINE #')
     A            PO#Q19        16          COLHDG('PO #' '& QTY')
     A            PO#Q29        16          COLHDG('PO #' '& QTY')
     A*
     A**********************************************************************
     A*           TRNF    -    1       RECEIPT TRANSFER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 005000 00010
     A*         R TRNFFM
     A*
     A            CONT#1         5  0       COLHDG('CONTROL #')
     A            TRLR11         8          COLHDG('TRAILER #')
     A            TRNFC1         1S 0       COLHDG('TRANSFR' 'CENTURY')
     A            TRNFY1         2S 0       COLHDG('TRANSFER' 'YEAR')
     A            TRNFM1         2S 0       COLHDG('TRANSFER' 'MONTH')
     A            TRNFD1         2S 0       COLHDG('TRANSFER' 'DAY')
     A            ACCT#1         5  0       COLHDG('CUSTOMER #')
     A            REC##1         6  0       COLHDG('RECEIPT #')
     A************LINE#1         2  0       COLHDG('LINE #')
     A            SEAL11         8          COLHDG('SEAL #')
     A**********************************************************************
     A*           WRT1    -    6   TARGET MANIFEST WORK FILE 214
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R WRT1FM
     A*
     A            ACC##6         5  0       COLHDG('ACCOUNT NUMBER')
     A            MAN##6         7  0       COLHDG('MANIFEST NUMBER')
     A            MNDAT6         6S 0       COLHDG('MANIFEST DATE')
     A            QUALF6         2          COLHDG('QUALIFIER')
     A*                                     VALUES('OO')
     A            MANTM6         4S 0       COLHDG('MANIFEST TIME')
     A*                                     VALUES('HH:MM')
     A            OSCAC6         4          COLHDG('OUTBOUND SCAC')
     A            OBPRO6        10          COLHDG('OUTBOUND PRO#')
     A            TQULF6         1          COLHDG('TRANS QUAL')
     A*                                     VALUES('M')
     A            TRWGH6         6  0       COLHDG('TRAILER WEIGHT')
     A            TRQTY6         6  0       COLHDG('TRAILER QTY')
     A            SEAL#6         8          COLHDG('SEAL#')
     A            TRLR#6         8          COLHDG('TRAILER 1')
     A            PACKG6         3          COLHDG('TYPE')
     A*                                     VALUES('CTN')
     A            ACTYP6         1          COLHDG('A/C TYPE')
     A**                                    VALUES('C' = CONSOLIDATION A/C)
     A            ACKEY6         6          COLHDG('A/C+TYPE')
     A**          ACKEY6         6  0       COLHDG('A/C+TYPE')
     A*                                     TYPE = 1 FOR LTL
     A*                                     TYPE= 2 FOR CONS.
     A*  NEW LENGTH OB PRO#
     A            OBPR26        13          COLHDG('OUTBOUND PRO#')
     A**********************************************************************
     A*           E#PT    -    9       PO FILE FOR 214 FORMAT DETAIL
     A*                                FOR TARGET'S EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R E#PTFM
     A*
     A            ACC##9         5  0       COLHDG('CUSTOMER #')
     A            WRE##9         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            PONUM9        10          COLHDG('PO #')
     A            TGLOC9        15          COLHDG('DEPT/PO/' 'LOC/STORE')
     A            SEQNO9         5  0       COLHDG('SEQ#')
     A            QUALF9         2          COLHDG('QUALIFIER')
     A*                                     VALUES('GM' '  ')
     A            ITEM#9        12          COLHDG('ITEM#')
     A*                                           (STYLE# IN RECP)
     A            QTY##9         5  0       COLHDG('PO QTY')
     A*
     A**********************************************************************
     A*           WRT2    -    7    TARGET RECEIPT EDI 214  DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R WRT2FM
     A*
     A            ACC##7         5  0       COLHDG('CUSTOMER #')
     A            WRE##7         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            TYPEF7         1          COLHDG('D' 'V' 'I')
     A            SBL##7        12          COLHDG('SHIPPERS B/L')
     A            PRQUL7         2          COLHDG('PRO QUAIL')
     A*                                     VALUES('CN')
     A            PRO##7         8  0       COLHDG('PRO #')
     A            ISCAC7         4          COLHDG('INBOUND SCAC')
     A            PDTQ17         2          COLHDG('PDATE QUAIL')
     A            RDTQ17         2          COLHDG('RDATE QUAIL')
     A            PIDT17         6S 0       COLHDG('PICK-UP' 'DATE')
     A*                                     YYMMDD
     A            REDT17         6S 0       COLHDG('RECEIPT' 'DATE')
     A*                                     YYMMDD
     A            PTIME7         4S 0       COLHDG('PICK-UP TIME')
     A********                              VALUES('14:00')
     A            RTIME7         4S 0       COLHDG('RECEIPT TIME')
     A********                              VALUES('??:??')
     A*                                     FROM CONTROL FILE
     A            PDTQ87         1          COLHDG('PTIME QUAIL')
     A            RDTQ97         1          COLHDG('RTIME QUAIL')
     A            VENDN7        25          COLHDG('SHIPPER NAME')
     A            VENDC7        25          COLHDG('SHIPPER CITY')
     A            VENDS7         2          COLHDG('SHIPPER STATE')
     A            VENDZ7         5  0       COLHDG('SHIPPER ZIP')
     A            DEPT#7         4  0       COLHDG('DEPARTMENT' '#')
     A            PO###7        10          COLHDG('P.O. NUMBER')
     A* NEW LENGTH B/L#
     A            SBL#27        20          COLHDG('SHIPPERS B/L')
     A**********************************************************************
     A*           WRM1    -    M    MARSHALLS WORK FILE FOR TRANSMISSION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R WRM1FM
     A*
     A            STAT#M        10          COLHDG('STATUS')
     A            MAN##M         7  0       COLHDG('MANIFEST NUMBER')
     A            CZIPCM         5  0       COLHDG('CONS. ZIPCODE')
     A            DZIPCM         5  0       COLHDG('DEST. ZIPCODE')
     A            TRAILM         8          COLHDG('TRAILER#')
     A            OTCARM        10          COLHDG('OUT CARRIER')
     A            DATEMM         8  0       COLHDG('MANIFEST DATE')
     A*                                     YYYYMMDD
     A            PO###M         8          COLHDG('P.O.#')
     A            POZIPM         5  0       COLHDG('P.O. ZIP CODE')
     A            CARTMM         6  0       COLHDG('CARTON COUNT')
     A            WEIGMM         6  0       COLHDG('WEIGHT')
     A            GOHMMM         6  0       COLHDG('GARMENTS')
     A            RCPTMM         6  0       COLHDG('RECEIPT #')
     A            DATERM         8  0       COLHDG('RECEIPT DATE')
     A*                                     YYYYMMDD
     A            INCARM        10          COLHDG('INBOUND CARRIER')
     A            ADVCHM         8  2       COLHDG('ADVANCE CHARGE')
     A            CONS$M         8  2       COLHDG('CONSOL. DOLLARS')
     A            LINE$M         8  2       COLHDG('LINE CHARGE')
     A            LH$$$M         8  2       COLHDG('LINE HAUL')
     A            IDCODM         3          COLHDG('ID CODE')
     A            DATESM         8  0       COLHDG('DATE SENT')
     A*                                     YYYYMMDD
     A**********************************************************************
     A*           TONG    -    G    PROJECTED TONNAGE BY ACCOUNT       N
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R TONGFM
     A*
     A            ACCT1G         5  0       COLHDG('ACCOUNT NUMBER')
     A            YEARYG         4S 0       COLHDG('YEAR')
     A            MONTHG         2S 0       COLHDG('MONTH')
     A            DAYGGG         2S 0       COLHDG('DAY')
     A            WEIGHG         9  0       COLHDG('WEIGHT')
     A**********************************************************************
     A*           EFCM      -    WORK FILE FOR FEDERATED EDI 212 MANF.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 010000 00010
     A*         R EFCMFM
     A*
     A            ACREEM         1          COLHDG('ACTIVE' 'CODE')
     A*                                              = ACTIVE
     A*                                            V = VOIDED
     A            WMANEM         7  0       COLHDG('WALSH MANIFEST #')
     A            ACCTEM         5  0       COLHDG('CUSTOMER #')
     A            SCACEM         4          COLHDG('SCAC OUTBOUND')
     A            MANFEM         7  0       COLHDG('CUSTOMER MANIFEST#')
     A            MANCEM         2S 0       COLHDG('MANIFEST' 'CENT')
     A            MANYEM         2S 0       COLHDG('MANIFEST' 'YEAR')
     A            MANMEM         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANDEM         2S 0       COLHDG('MANIFEST' 'DAY')
     A*                                           E.G. YEAR 1998 --
     A*                                                MANCCM=19
     A            TRTYEM         2          COLHDG('TRANS.' 'TYPE')
     A**                                     VALUES('00 -- ORIGINAL EDI'
     A            SNAMEM        35          COLHDG('CONTACT' 'NAME')
     A            STELEM        20          COLHDG('TEL.NUMBER')
     A            DELCEM         2S 0       COLHDG('DELIVERY' 'CENT')
     A            DELYEM         2S 0       COLHDG('DELIVERY' 'YEAR')
     A            DELMEM         2S 0       COLHDG('DELIVERY' 'MONTH')
     A            DELDEM         2S 0       COLHDG('DELIVERY' 'DAY')
     A            DELTEM         4  0       COLHDG('DELIVERY' 'TIME')
     A            DELTQM         2          COLHDG('DEL TIME' 'QUAL')
     A*                                     VALUES(LT=LOCAL TIME)
     A            TRL1EM         8          COLHDG('TRAILER 1')
     A*                                     COULD BE AIR/FREIGHT BILL
     A            SEA1EM         8          COLHDG('SEAL #1')
     A            TRL2EM         8          COLHDG('TRAILER 2')
     A            SEA2EM         8          COLHDG('SEAL # 2')
     A            OBPREM        10          COLHDG('OUTBOUND PRO#')
     A            AKEYEM         6          COLHDG('A/C+TYPE')
     A*                                     TYPE = 1 FOR LTL
     A*                                     TYPE= 2 FOR CONS.
     A* NEW LENGTH OB PRO#
     A            OBPRXM        13          COLHDG('OUTBOUND PRO#')
     A**********************************************************************
     A*           EFCR      -   WORK FILE FOR FEDERATED EDI 212 RECEIPT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 010000 00010
     A*         R EFCRFM
     A*
     A            ACCTEH         5  0       COLHDG('CUSTOMER #')
     A            WMANEH         7  0       COLHDG('WALSH MANIFEST #')
     A            REC#EH         6  0       COLHDG('RECEIPT#')
     A            WRECEH         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            SBL#EH        12          COLHDG('SHIPPER B/L')
     A            PUSCEH         4          COLHDG('P/U SCAC')
     A            SHIPEH        25          COLHDG('SHIPPER NAME')
     A            SHADEH        25          COLHDG('SHIPPER CITY')
     A            SHZIEH         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHSTEH         2          COLHDG('SHIPPER' 'STATE')
     A*
     A            CTNGEH         1          COLHDG('CTN OR' 'GOH')
     A            DEPTEH         4  0       COLHDG('DEPARTMENT' '#')
     A            TOINEH         7  0       COLHDG('TOTAL' 'QTY' 'INV')
     A            TOQTEH         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWGEH         5  0       COLHDG('TOTAL' 'WGT')
     A            PICCEH         2S 0       COLHDG('PICK-UP' 'DATE')
     A            PICYEH         2S 0       COLHDG('PICK-UP' 'DATE')
     A            PICMEH         2S 0       COLHDG('PICK-UP' 'DATE')
     A            PICDEH         2S 0       COLHDG('PICK-UP' 'DATE')
     A*                                     YYYYMMDD
     A            CCPPEH         2          COLHDG('PRE-PAID OR COLLECT')
     A            TOCOEH         7  2       COLHDG('TOTAL' 'COLLECT')
     A            LDSQEH         3  0       COLHDG('LOAD' 'SEQ')
     A**                                         FROM NOSE TO TAIL
     A**                                         VALUES=001,002...
     A            AKEYEH         6          COLHDG('A/C+TYPE')
     A*                                     TYPE = 1 FOR LTL
     A*                                     TYPE= 2 FOR CONS.
     A* NEW LENGTH B/L#
     A            SBL2EH        20          COLHDG('SHIPPER B/L')
     A**********************************************************************
     A*           EFCP      -  WORK FILE FOR FEDERATED 212 PO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFCPFM
     A*
     A            ACREEF         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A*
     A            ACCTEF         5  0       COLHDG('CUSTOMER #')
     A            WMANEF         7  0       COLHDG('WALSH MANIFEST #')
     A            WRECEF         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            LDSQEF         3  0       COLHDG('LOAD' 'SEQ')
     A            PONUEF        10          COLHDG('PO #')
     A            QTY#EF         5  0       COLHDG('QUANTITY')
     A            STREEF         4  0       COLHDG('STORE #')
     A            AKEYEF         6          COLHDG('A/C+TYPE')
     A*                                     TYPE = 1 FOR LTL
     A*                                     TYPE= 2 FOR CONS.
     A**********************************************************************
     A*           EFOM    -    N       WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*                                FOR OUTSIDE CARRIERS
     A*                                (MANF/MOVE LEVEL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R EFOMFM
     A*
     A            SNDIDN         4          COLHDG('SENDER ID #')
     A*                                      OUTSIDE CARRIER SENDER
     A*                                      ID = SCAC
     A            CONSEN         5  0       COLHDG('CONSIGNEE #')
     A*
     A            OSCACN         4          COLHDG('OUTBOUND SCAC')
     A*                                           (NART FOR NOW)
     A            MANCEN         2S 0       COLHDG('MANIFEST' 'CENT')
     A*                                           E.G. YEAR 1998 --
     A*                                                MANCEM=19
     A            MANYEN         2S 0       COLHDG('MANIFEST' 'YEAR')
     A            MANMEN         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANDEN         2S 0       COLHDG('MANIFEST' 'DAY')
     A*
     A            TRTYEN         2          COLHDG('TRANS.' 'TYPE')
     A**                                     VALUES('00 -- ORIGINAL EDI'
     A            SNAMEN        35          COLHDG('CONTACT' 'NAME')
     A            STELEN        20          COLHDG('TEL.NUMBER')
     A*
     A            DELCEN         2S 0       COLHDG('DELIVERY' 'CENT')
     A            DELYEN         2S 0       COLHDG('DELIVERY' 'YEAR')
     A            DELMEN         2S 0       COLHDG('DELIVERY' 'MONTH')
     A            DELDEN         2S 0       COLHDG('DELIVERY' 'DAY')
     A            DELTEN         4  0       COLHDG('DELIVERY' 'TIME')
     A            DELTQN         2          COLHDG('DEL TIME' 'QUAL')
     A*                                     VALUES(LT=LOCAL TIME)
     A            TRAILN        10          COLHDG('TRAILER #')
     A            SEA1EN        10          COLHDG('SEAL #1')
     A            SEA2EN        10          COLHDG('SEAL #2')
     A*
???? A            AKEYEN         6          COLHDG('CONS# + TYPE')
     A*                                     VALUE('L'TYPE= LTL ACCOUNT)
     A**********************************************************************
     A*           EFOR    -    U       WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*                                (PROS LEVEL)
     A*                                FOR OUTSIDE CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFORFM
     A*
     A            SNDIDU         4          COLHDG('SENDER ID #')
     A*                                      OUTSIDE CARRIER SENDER
     A*                                      ID = SCAC
     A            PRO#EU        20          COLHDG('PRO' 'NUMBER')
     A*
     A            CONSEU         5  0       COLHDG('CONSIGNEE #')
     A*
     A            BLNUEU        20          COLHDG('SHIPPER B/L')
     A            PUSCEU         4          COLHDG('P/U SCAC' 'CODE')
     A**                                     SAME AS OSCACN
     A            SHPNEU        25          COLHDG('SHIPPER NAME')
     A            SHADEU        25          COLHDG('SHIPPER ADDR')
     A            SHCTEU        16          COLHDG('SHIPPER CITY')
     A            SHZPEU         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHSTEU         2          COLHDG('SHIPPER' 'STATE')
     A*
     A            CTNGEU         3          COLHDG('CTN OR' 'GOH')
     A            TOQTEU         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWTEU         5  0       COLHDG('TOTAL' 'WGT')
     A            PAYCEU         2          COLHDG('PRE-PAID OR COLLECT')
     A*                                               CC = COLLECT
     A*                                               PP = PREPAID
     A**                                    (WILL BE BLANK FOR NOW)
     A**                                     (THIS INFO. NOT ENTERED)
     A            PICCEU         2S 0       COLHDG('PICK-UP' 'CENT')
     A            PICYEU         2S 0       COLHDG('PICK-UP' 'YEAR')
     A            PICMEU         2S 0       COLHDG('PICK-UP' 'MONTH')
     A            PICDEU         2S 0       COLHDG('PICK-UP' 'DAY')
     A*
     A            TOTLEU         9  2       COLHDG('TOTAL' 'AMOUNT')
     A*                                      (WILL BE ZERO FOR NOW)
     A*                                      (THIS INFO. NOT ENTERED)
     A            LDSQEU         3  0       COLHDG('LOAD' 'SEQ')
     A**                                         FROM NOSE TO TAIL
     A**                                         VALUES=001,002...
     A**********************************************************************
     A*           EFOP    -    V       PO FILE FOR 212 FORMAT DETAIL
     A*                                FOR FEDERATED EDI
     A*                                FOR OUTSIDE CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFOPFM
     A*
     A            SNDIDV         4          COLHDG('SENDER ID #')
     A*                                      OUTSIDE CARRIER SENDER
     A*                                      ID = SCAC
     A            PRO#EV        20          COLHDG('PRO #')
     A            CONSEV         5  0       COLHDG('CONSIGNEE #')
     A            LDSQEV         3  0       COLHDG('LOAD' 'SEQ')
     A            PONUEV        15          COLHDG('PO #')
     A            QUANEV         5  0       COLHDG('QUANTITY')
     A            DEPTEV         4          COLHDG('DEPT #')
     A**********************************************************************
     A*           OSFC      -      OUTSIDE CARRIERS FOR FEDERATED TO
     A*                            GET INFO. FOR EDI 212 FOR THE
     A*                            OUTSIDE CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R OSFCFM
     A*
     A            SCAC#4         4          COLHDG('CARRIER SCAC')
     A            SHPNE4        25          COLHDG('SHIPPER NAME')
     A            SHADE4        25          COLHDG('SHIPPER ADDR')
     A            SHCTE4        16          COLHDG('SHIPPER CITY')
     A            SHSTE4         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPE4         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SCNAM4        35          COLHDG('CONTACT' 'NAME')
     A            SCTEL4        20          COLHDG('SHIPPER' 'TEL#')
     A            SCFAX4        20          COLHDG('SHIPPER' 'FAX#')
     A            SCEML4        20          COLHDG('SHIPPER' 'E-MAIL')
     A*
     A**********************************************************************
     A*           ETMF    -    M   MANIFEST WORK FILE 223
     A*                            FOR TARGET & MERVYNS EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETMFFM
     A*
     A            AC###M         5  0       COLHDG('ACCOUNT NUMBER')
     A            ACCIDM         2          COLHDG('ACCOUNT' 'ID')
     A*                                       BLANK FOR NOW
     A*                                       TG = TARGET
     A*                                       MR = MERVYNS
     A            STATMM         2          COLHDG('EDI PURPOSE' 'STAT')
     A*                                       00 = CHANGE OF PRO# OR
     A*                                            TRAILER ONLY
     A*                                       33 = CHANGE OF MONEY ONLY
     A*                                       SU = STATUS UPDATE
     A            MNF##M         7  0       COLHDG('MANIFEST NUMBER')
     A            MNDATM         8S 0       COLHDG('MANIFEST DATE')
     A*                                         YYYYMMDD
     A            OSCACM         4          COLHDG('OUTBOUND SCAC')
     A****        OBPROM        10          COLHDG('OUTBOUND PRO#')
     A            OBPROM        13          COLHDG('OUTBOUND PRO#')
     A            TRLR#M         8          COLHDG('TRAILER ')
     A            TRWGHM         6  0       COLHDG('TRAILER WEIGHT')
     A            BL###M        12          COLHDG('B/L#')
     A            TO$$$M         7  2       COLHDG('TOTAL' '$$$')
     A            TO$$FM         1          COLHDG('FLAG' 'TOT $$$')
     A*                                        'N'  MEANS NO TOT $$$
     A*                                        'Y'  MEANS HAVE TOT $$$
     A            ACTYPM         1          COLHDG('A/C TYPE')
     A**                                    VALUES('C' = CONSOLIDATION A/C)
     A            ACKEYM         6          COLHDG('A/C+TYPE')
     A*                                     TYPE = L FOR LTL
     A*                                     TYPE= C FOR CONS.
     A            SHIP#M         4  0       COLHDG('NUMBER OF' 'SHIPMENTS')
     A            RELDTM         8S 0       COLHDG('RELEASE DATE')
     A*                                         YYYYMMDD
     A            HANCPM         2          COLHDG('HAN PAYMENT' 'TYPE')
     A*                                         CC= COLLECT
     A*                                         PP= PREPAID
     A            LHSCPM         2          COLHDG('LH PAYMENT' 'TYPE')
     A*                                         CC= COLLECT
     A*                                         PP= PREPAID
     A            TLHS$M         7  2       COLHDG('TOTAL' 'LHS$')
     A*                                        ZERO FOR NOW (CSD07 LHS)
     A            TLH$FM         1          COLHDG('FLAG' 'LHS$')
     A*                                        'N'  MEANS NO LINE HAUL$
     A*                                        'Y'  MEANS HAVE LINE HAUL$
     A            DCLOCM         4          COLHDG('DC LOC')
     A*
     A            ORSCAM         4          COLHDG('223 SCAC')
     A*                                       NART - EAST COAST
     A*                                       NRTV - WEST COAST
     A**********************************************************************
     A*           ETRC    -    R    EDI 223  DETAIL
     A*                                FOR TARGET'S & MERVYNS EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETRCFM
     A*
     A            AC###R         5  0       COLHDG('CUSTOMER #')
     A            WRE##R         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A*
     A            TYPEFR         1          COLHDG('D' 'V' 'I')
     A            RECT#R         6  0       COLHDG('RECEIPT #')
     A            REDT1R         8S 0       COLHDG('RECEIPT' 'DATE')
     A*                                     YYYYMMDD
     A            PIDT1R         8S 0       COLHDG('PICK-UP' 'DATE')
     A*                                     YYYYMMDD
     A            MNDATR         8S 0       COLHDG('MANIFEST DATE')
     A*                                         YYYYMMDD
     A            VENDNR        25          COLHDG('SHIPPER NAME')
     A            VENDAR        25          COLHDG('SHIPPER ADD1')
     A            VENDCR        25          COLHDG('SHIPPER CITY')
     A            VENDSR         2          COLHDG('SHIPPER STATE')
     A            VENDZR         5  0       COLHDG('SHIPPER ZIP')
     A*
     A* FOLLOWING FIELDS ARE FOR THE L11 SEGMENT OF THE 223 EDI DOC.
     A* 1ST L11 LOOP
     A            PRO##R        12          COLHDG('PRO #')
     A*                                      IF NO PRO# PUT 'NS'
     A            QTYN#R         7  0       COLHDG('1ST L11' 'QTY')
     A*                                        QTY FOR 1ST LOOP
     A* 2ND L11 LOOP
GP01 A*  WE WILL NOT USE THIS FLD _ NOW WE WILL USE WGT#NR
     A            WGT##R         5  0       COLHDG('2ND L11'  'WGT')
     A*
     A* 3RD L11 LOOP
     A            QUAL3R         2          COLHDG('3RD L1102'  'QUAL')
     A*                                       'SI' (FOR 3RD LOOP)
     A*                                            WITH VENDOR SHIP ID
     A*                                       '  ' IF NO ID
     A            SHPIDR        30          COLHDG('3RD L1103' 'SHIP ID')
     A*                                       ' '   (IF NO ID    )
     A* 4TH L11 LOOP
     A            QUAL4R         2          COLHDG('4TH L1102'  'QUAL')
     A*                                       'KL' (FOR 4TH LOOP)
     A*                                            WITH ADVANCE CHG
     A*                                       '  ' IF NO ADVANCE CHARGE
     A            TYPE4R         3          COLHDG('4TH L1103' 'TYPE')
     A*                                       'CWT' (FOR 4TH LOOP)
     A*                                            WITH ADVANCE CHG
     A*                                       '  ' IF NO ADVANCE CHARGE
     A            ADV$$R         7  2       COLHDG('ADVANCE' 'CHARGES')
     A*
     A* 5TH L11 LOOP
     A            QUAL5R         2          COLHDG('5TH L1102' 'QUAL')
     A*                                       'KL' (FOR 5TH LOOP)
     A*                                            WITH SPECIAL CHG
     A*                                       '  ' IF NO SPECIAL CHARGE
     A            TYPE5R         3          COLHDG('5TH L1103' 'TYPE')
     A*                                       'SPU' (FOR 5TH LOOP)
     A*                                            WITH SPECIAL CHG
     A*                                       '   'IF NO SPECIAL CHARGE
     A            SPEC$R         7  2       COLHDG('SPECIAL' 'CHARGES')
     A*
     A* "SI" CSD DETAIL LOOP
     A            PAYSIR         2          COLHDG('SI PAYMENT' 'METHOD')
     A*                                      'CC' OR 'PP'
     A            PAY$2R         7  2       COLHDG('PAYMENT' '$$')
     A*                                      CAN BE ZEROS OR
     A*                                        ADVANCE CHARGES
     A            PSIF2R         1          COLHDG('PAYMENT' 'SI FLAG')
     A*                                        'N'  MEANS NO SI CHG
     A*                                        'Y'  MEANS HAVE SI CHARGES
     A* THE FOLLOWING FLDS ARE FOR THE CSD DETAIL SEGMENT
     A* "HAN" CSD DETAIL LOOP
     A            PAYHNR         2          COLHDG('HAN PAYMENT' 'METHOD')
     A*                                      'CC' OR 'PP'
     A            PAY$1R         7  2       COLHDG('PAYMENT' '$$')
     A*                                      CAN BE CONSOL$$$ FOR
     A*                                       RECEIPT OR ZEROS
     A            PHNF1R         1          COLHDG('PAYMENT' 'HAN FLAG')
     A*                                        'N'  MEANS NO HAN CHG
     A*                                        'Y'  MEANS HAVE HAN CHARGES
     A* FOR NRT PICK-UP WITH $$$ CASE
     A            SHBL#R        20          COLHDG('SHIPPERS B/L')
     A*                                     FOR CSD09 SEGMENT IN 223
     A*                                     "NRCL"
     A* SCAC FOR ADVANCE  CHARGE
     A            PSCACR         4          COLHDG('PAYMENT SCAC')
     A*                                      FOR THE CSD08 DETAIL SEG.
     A*                                       FOR THE SI CSD LOOP
     A*                                       FOR ADV$ PAY$2R
     A* 1ST L11 LOOP
     A            CARRPR        30          COLHDG('PRO #')
     A*                                        PRO# OR OCEAN BOL#
     A*                                        OCEAN BOL# FOR TARGET
     A*                                        IMPORTS
     A* SCAC FOR HANDLING CHARGE
     A            PHANSR         4          COLHDG('HANDLING$' 'SCAC')
     A*                                      FOR THE CSD08 DETAIL SEG.
     A*                                       FOR THE HAN CSD LOOP
     A*                                       WITH CSD02 BEING U0
     A            WGT#NR         6  0       COLHDG('2ND L11'  'WGT')
     A**********************************************************************
     A*           ETPO    -    P       PO FILE FOR 223 FORMAT DETAIL
     A*                                FOR TARGET'S & MERVYNS EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETPOFM
     A*
     A            AC###P         5  0       COLHDG('CUSTOMER #')
     A            WRE##P         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            PO###P         7          COLHDG('PO #')
     A            DEP##P         4          COLHDG('DEPT')
     A            DCLOCP         4          COLHDG('DC LOC')
     A            SEQNOP         5  0       COLHDG('SEQ#')
     A            QTY##P         5  0       COLHDG('PO QTY')
     A            WGT##P         5  0       COLHDG('WEIGHT')
     A*
     A**********************************************************************
     A*           EAH1      -      EDI B/L HEADER FOR AMES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EAH1FM
     A*
     A            ACAMH1         5  0       COLHDG('CUSTOMER #')
     A            ACAXH1         6          COLHDG('A/C+TYPE')
     A*                                     TYPE= C FOR CONS.
     A            WRAMH1         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            REC#H1         6  0       COLHDG('RECEIPT #')
     A            MANFH1         7  0       COLHDG('MANIFEST #')
     A            INPRH1         8          COLHDG('INBOUND' 'PRO#')
     A            MFIBH1        15          COLHDG('MANIFEST #' 'I/B PRO#')
     A            CCPPH1         2          COLHDG('PRE-PAID OR COLLECT')
     A            MANDH1         8S 0       COLHDG('MANIFEST' 'DATE')
     A*                                        YYYYMMDD
     A            SHPDH1         8S 0       COLHDG('SHIP' 'DATE')
     A*                                        YYYYMMDD
     A*                                        P/U DATE OR RECEIPT
     A*                                        DATE (B/L DATE)
     A            TQTYH1         5  0       COLHDG('TOTAL' 'QTY')
     A            TOWTH1         5  0       COLHDG('TOTAL' 'WGT')
     A            TCOLH1         7  2       COLHDG('TOTAL' 'COLLECT$')
     A            WINVH1         7  0       COLHDG('WALSH' 'INV#')
     A            DEPTH1         4  0       COLHDG('DEPARTMENT' '#')
     A            SHPNH1        25          COLHDG('SHIPPER NAME')
     A            SHADH1        25          COLHDG('SHIPPER ADD1')
     A            SHSTH1         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPH1         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SBL#H1        20          COLHDG('SHIPPERS B/L #')
     A            NTSC#1         4          COLHDG('NTS' 'CLIENT#')
     A*                                          3604
     A**********************************************************************
     A*           EAP1    -    P1      PO FILE FOR 210 FORMAT DETAIL
     A*                                FOR AMES EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EAP1FM
     A*
     A            ACAMP1         5  0       COLHDG('CUSTOMER #')
     A            WRAMP1         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            LINEP1         2  0       COLHDG('LINE #')
     A            POAMP1        10          COLHDG('PO #')
     A            QTAMP1         5  0       COLHDG('QTY')
     A            WTAMP1         5  0       COLHDG('WGT')
     A            DESCP1        25          COLHDG('PO' 'DESC')
     A*                                       "ITEMS FOR PO XXXXXXXXXX"
     A**********************************************************************
     A*           EAP2    -    P2      PO FILE FOR 210 FORMAT DETAIL
     A*                                FOR AMES EDI
     A*                                FOR NOW -- THERE IS NO CHARGES
     A*                                AT PO LEVEL -- SO SEND
     A*                                 TOTAL CHARGES AT 1ST PO LEVEL
     A*                                 LX -- L1 1ST PO LOOP
     A*                                 REST PO LOOPS LX -- L1 WILL
     A*                                   HAVE  L1  LOOP WITH 0 CHARGE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EAP2FM
     A*
     A            ACAMP2         5  0       COLHDG('CUSTOMER #')
     A            WRAMP2         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            LINEP2         2  0       COLHDG('LINE #')
     A            QF$$P2         3          COLHDG('QUALIF' 'CHARGES')
     A*                                      '045' = ADVANCE FEE
     A*                                      'CNS' = CONSOLIDATION FEE
     A*                                      ' '   = NO  FEE
     A            DE$$P2        25          COLHDG('DESC' 'CHARGES')
     A*                                       'ADVANCE FEE' IF HAVE
     A*                                       'CONSOLIDATION FEE'
     A*                                       ' ' IF NO  FEE
     A            TO$$P2         7  2       COLHDG('TOTAL' 'CHARGES')
     A**********************************************************************
     A*           ELZH    -   Z1       HDR FILE FOR 211 FORMAT DETAIL
     A*                                FOR LIZ CLAIBORNE (RECEIVED)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00100
     A*         R ELZHFM
     A*
     A            MAILZ1        10          COLHDG('EDI MAILBOX' 'ID')
     A            BOL#Z1        17          COLHDG('SHIPPER' 'B/L')
     A            EQP#Z1        20          COLHDG('EQUIPMENT' 'NUMBER')
     A*                                       SHIPMENT IS ON NOW
     A            DATEZ1         8S 0       COLHDG('RELEASE' 'DATE')
     A*                                        YYYYMMDD
     A            CCPPZ1         2          COLHDG('PAYMENT' 'METHOD')
     A*                                        CC
     A*                                        PP
     A            PSCAZ1         4          COLHDG('PRIMARY' 'SCAC')
     A*                                      THIS SCAC CARRIER P/U FROM
     A*                                      SHIP-FROM LOCATION
     A**
     A            SCACZ1         4          COLHDG('SECONDARY' 'SCAC')
     A*                                      P/U FROM PRIMARY CARRIER
     A* SHIP-FROM
     A            SFWHZ1         5          COLHDG('SHIP-FROM' 'WHS')
     A            SFNMZ1        25          COLHDG('SF' 'NAME')
     A            SFADZ1        25          COLHDG('SHIPPER ADD1')
     A            SFCTZ1        25          COLHDG('SHIPPER' 'CITY')
     A            SFSTZ1         2          COLHDG('SHIPPER' 'STATE')
     A            SFZPZ1         5  0       COLHDG('SHIPPER' 'ZIP')
     A* SHIP-TO
     A            STDCZ1         5          COLHDG('SHIP-TO' 'DC')
     A            STNMZ1        25          COLHDG('ST' 'NAME')
     A            STADZ1        25          COLHDG('ST' 'ADD1')
     A            STCTZ1        25          COLHDG('ST' 'CITY')
     A            STZPZ1         5  0       COLHDG('ST' 'ZIP')
     A            STSTZ1         2          COLHDG('ST' 'STATE')
     A*
     A********    QTLZZ1         5  0       COLHDG('QTY')
     A*********   QTUZZ1         3          COLHDG('QTY' 'UNIT')
     A*                                       PCS
     A*                                       CTN
     A**********  WTAMZ1         5  0       COLHDG('WGT')
     A**********  CMCDZ1        30          COLHDG('COMMODITY' 'CODE')
     A            STATZ1         1          COLHDG('MOVED' 'STATUS')
     A*                                      ' ' NOT MOVED TO LZHD,...
     A*                                      'M' MOVED TO LZHD,LZCT,LZP
     A*                                      'X' PROBLEM RECORD
     A*                                          NOT WRITTEN TO LZHD,..
     A*                                      (UPDATED BY PGM ELZ211)
     A**********************************************************************
     A*           ELZP    -    P1      PO FILE FOR 211 FORMAT DETAIL
     A*                                FOR LIZ CLAIBORNE (RECEIVED)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R ELZPFM
     A*
     A            MAILP1        10          COLHDG('EDI MAILBOX' 'ID')
     A            BLLNP1         2  0       COLHDG('B/L LINE' 'ITEM #')
     A            BOL#P1        17          COLHDG('SHIPPER' 'B/L')
     A            INVZP1         9          COLHDG('INV#')
     A            POLZP1        17          COLHDG('PO #')
     A            LINZP1         6  0       COLHDG('PO' 'LINE #')
     A            DEPZP1         4          COLHDG('DEPT#')
     A            QTUZP1         3          COLHDG('QTY' 'UNIT')
     A*                                       PCS
     A*                                       CTN
     A            QTLZP1         5  0       COLHDG('QTY')
     A            WTLZP1         5  0       COLHDG('WGT')
     A**********************************************************************
     A*           ELZC    -    P2      PO FILE FOR 211 FORMAT DETAIL
     A*                                FOR LIZ CLAIBORNE (RECEIVED)
     A*                                CARTON DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R ELZCFM
     A*
     A            MAILP2        10          COLHDG('EDI MAILBOX' 'ID')
     A            BOL#P2        17          COLHDG('SHIPPER' 'B/L')
     A            BLLNP2         2  0       COLHDG('B/L LINE' 'ITEM #')
     A            LINZP2         6  0       COLHDG('PO' 'LINE #')
     A            CTNZP2        20          COLHDG('CTN' 'ID')
     A            INVZP2         9          COLHDG('INV#')
     A            POLZP2        10          COLHDG('PO #')
     A* NOTE : THE INV# AND PO# IS IN ELZP (KEYED BY MAILBOX#,BOL#,
     A*        B/L LINE# & PO LINE#
     A**********************************************************************
     A*           LANE    -   LA       LIZ CLAIBORNE LANE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00050
     A*         R LANEFM
     A*
     A            ACRECLA        1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A*                                       V = VOIDED
     A            ACCT#LA        5  0       COLHDG('ACCOUNT#')
     A            LANE#LA        2  0       COLHDG('LANE#')
     A            CONLTLA        1          COLHDG('ACCOUNT' 'TYPE')
     A*                                     'C'= LANE FOR CONSOLIDATION
     A*                                     'L'= LANE FOR LTL
     A            LNTYPLA        1          COLHDG('LANE' 'TYPE')
     A*                                     'G'= LANE FOR GOOD PO
     A*                                     'B'= LANE FOR BAD PO
     A*                                     'S'= LANE FOR SPECIAL PO
     A*                                          FOR FUTURE REF
     A**********************************************************************
     A*           LZMP    -   MP       MAPPING FILE FOR LIZ CLAIBORNE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00100
     A*         R LZMPFM
     A*
     A            ACCMPH         5  0       COLHDG('ACCT' 'NUMBER')
     A            ACTMPH         1          COLHDG('A/C' 'TYPE')
     A*                                       C= CONS
     A*                                       L = LTL
     A            STNMPH        25          COLHDG('ACCT' 'NAME')
     A            STZMPH         5  0       COLHDG('ACCT' 'ZIP')
     A            POFILH         1          COLHDG('PO#' 'FILTER')
     A*                                       USED IN ELZ211 PGM
     A*                                       TO DROP '-' FROM PO#
     A*                                       SENT TO US
     A*                                     ' ' = NO FILTERING REQUIRED
     A*                                           WHEN MAPPING PO#
     A*                                     '2' = DROP SECOND DASH
     A*                                           AND ANYTHING AFTER
     A*                                           THAT WHEN MAPPING PO#
     A**********************************************************************
     A*           LZHD    -   LH       HDR FILE LIZ CALIBORNE
     A*                                DATA COPIED FM 211 FILES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R LZHDFM
     A*
     A            MAILLH        10          COLHDG('EDI MAILBOX' 'ID')
     A*                                        YYYYMMDD
     A            DT211H         8S 0       COLHDG('211' 'DATE')
     A*                                        YYYYMMDD
     A            DT214H         8S 0       COLHDG('214' 'DATE')
     A*                                        YYYYMMDD
     A            TM211H         4S 0       COLHDG('211' 'TIME')
     A*                                        YYYYMMDD
     A            BOL#LH        17          COLHDG('SHIPPER' 'B/L')
     A            INTRLH        10          COLHDG('INBOUND' 'TRL')
     A*                                       SHIPMENT IS ON NOW
     A            DATELH         8S 0       COLHDG('RELEASE' 'DATE')
     A*                                       YYYYMMDD FROM THE EDI 211
     A            CCPPLH         2          COLHDG('PAYMENT' 'METHOD')
     A*                                        CC
     A*                                        PP
     A            PSCALH         4          COLHDG('PRIMARY' 'SCAC')
     A*                                      THIS SCAC CARRIER P/U FROM
     A*                                      SHIP-FROM LOCATION
     A            SCACLH         4          COLHDG('SECONDARY' 'SCAC')
     A*                                      P/U FROM PRIMARY CARRIER
     A* SHIP-FROM
     A            SFWHLH         5          COLHDG('SHIP-FROM' 'WHS')
     A            SFNMLH        25          COLHDG('SF' 'NAME')
     A            SFADLH        25          COLHDG('SHIPPER ADD1')
     A            SFCTLH        25          COLHDG('SHIPPER' 'CITY')
     A            SFSTLH         2          COLHDG('SHIPPER' 'STATE')
     A            SFZPLH         5  0       COLHDG('SHIPPER' 'ZIP')
     A* SHIP-TO
     A            ACCTLH         5  0       COLHDG('ACCT' 'NUMBER')
     A            ACTPLH         1          COLHDG('A/C' 'TYPE')
     A*                                       C= CONS
     A*                                       L = LTL
     A            STDCLH         5          COLHDG('SHIP-TO' 'DC')
     A            STNMLH        25          COLHDG('ST' 'NAME')
     A            STADLH        25          COLHDG('ST' 'ADD1')
     A            STCTLH        25          COLHDG('ST' 'CITY')
     A            STZPLH         5  0       COLHDG('ST' 'ZIP')
     A            STSTLH         2          COLHDG('ST' 'STATE')
     A*
     A            QTLZLH         5  0       COLHDG('BOL' 'QTY')
     A*********   QTUZLH         3          COLHDG('QTY' 'UNIT')
     A*                                       PCS
     A*                                       CTN
     A            WTAMLH         5  0       COLHDG('BOL' 'WGT')
     A**********  CMCDLH        30          COLHDG('COMMODITY' 'CODE')
     A            PCKHDH         1          COLHDG('PACK&HOLD' 'CODE')
     A*                                       Y = PACK & HOLD
     A*                                      ' ' = NOT PACK & HOLD
     A***
     A            RESPOH         1          COLHDG('ALL PO' 'RESOLVED')
     A*                                     ' '= NOT ALL RESOLVED YET
     A*                                     Y = ALL PO ARE RESOLVED
     A            DTTRLH         8S 0       COLHDG('DATE' 'TRL IN')
     A*                                        YYYYMMDD
     A*                                        ENTERED BY IRENE
     A*                                        WHEN SHE RECEIVES PAPERS
     A            USTRLH        10          COLHDG('USERID' 'OF DTTRLH')
     A***
     A            CWSYSH         1          COLHDG('CW SYS' 'ASSIGNMENT')
     A*                                        Y = ASSIGNED TO CW SYSTE
     A*                                       ' ' = NOT ASSIGNED
     A*                                       'C' = COMPLETED
     A            CWUSRH        10          COLHDG('USERID' 'OF CWSYSH')
     A***                                    ONLY UPDATED WHEN
     A*                                      THIS ASSIGNED TO CW SYSTEM
     A            CWDATH         8S 0       COLHDG('CW' 'DATE')
     A*                                        YYYYMMDD
     A            CBLDGH         1          COLHDG('C BLDG' 'ASSIGNMENT')
     A*                                        Y = ASSIGNED TO C BLDG
     A*                                       ' ' = NOT ASSIGNED
     A            CBUSRH        10          COLHDG('USERID' 'OF CBUSRH')
     A            FAXBDH         8S 0       COLHDG('BAD PO' 'FAXED')
     A*                                        DATE BAD PO REPORT FAXED
     A*                                        FROM A BLDG
     A*                                        YYYYMMDD
     A            FAXEXH         8S 0       COLHDG('EXCEPTION' 'FAXED')
     A*                                        DATE EXCEPTIONS FAXED
     A*                                        FROM C BLDG
     A*                                        YYYYMMDD
     A            MASTEH         1          COLHDG('MASTER' 'CTN BOL')
     A*                                        Y = YES
     A*                                          = NO
     A*                                        FOR MASTEH = 'Y' -- NO
     A*                                        NEED TO SEND 214
     A**********************************************************************
     A*           LZPO    -    LP      PO FILE FOR LIZ CLAIBORNE
     A*                                DATA COPIED FM 211 FILES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R LZPOFM
     A*
     A            MAILLP        10          COLHDG('EDI MAILBOX' 'ID')
     A            ACCTLP         5  0       COLHDG('ACCT' 'NUMBER')
     A            ACTPLP         1          COLHDG('A/C' 'TYPE')
     A*                                       C= CONS
     A*                                       L = LTL
     A            BOL#LP        17          COLHDG('SHIPPER' 'B/L')
     A            INVZLP         9          COLHDG('INV#')
     A            POLZLP        10          COLHDG('PO #')
     A            LINZLP         6  0       COLHDG('LINE #')
     A*                                       MAILLP,INV#,PO#,LINZLP
     A*                                       KEYS TO LZCT FILE FOR ALL
     A*                                       CTNS UNDER THIS PO
     A            DEPZLP         4  0       COLHDG('DEPT#')
     A            QTUZLP         3          COLHDG('QTY' 'UNIT')
     A*                                       PCS
     A*                                       CTN
     A            QTLZLP         5  0       COLHDG('QTY')
     A            WTLZLP         5  0       COLHDG('WGT')
     A**
     A            OKPOLP         1          COLHDG('PO' 'GOOD')
     A*                                     ' '= NOT CHECKED YET
     A*                                     G = GOOD PO
     A*                                     B = BAD  PO
     A            DTCKLP         8  0       COLHDG('DATE' 'POCHECK')
     A*                                       YYYYMMDD
     A            CKIDLP        10          COLHDG('CHECKED' 'BY')
     A*
     A            RESFLP         1          COLHDG('RESOLVED' 'FLAG')
     A*                                       SET BY PGM LZ006S
     A*                                       'Y'
     A*                                       ' '
     A            DTRESP         8  0       COLHDG('DATE' 'RESOLVED')
     A*                                       YYYYMMDD
     A            REF##P         8  0       COLHDG('REC#/PRO#')
     A*                                         REC# IS ACTUALLY 6,0
     A            OBLN#P         2  0       COLHDG('OUT' 'LANE#')
     A            REMRKP        20          COLHDG('REMARKS')
     A            HOLD#P         5  0       COLHDG('HOLD#')
     A            MASTEP         1          COLHDG('MASTER' 'PO/INV')
     A*                                        Y = YES
     A*                                          = NO
     A*                                        FOR MASTEP = 'Y' -- NO
     A*                                        NEED TO SEND 214
     A**********************************************************************
     A*           LZCT    -    LC      CTN FILE FOR LIZ CALIBORNE
     A*                                CARTON DETAIL
     A*                                KEY: MAILBOX#,BOL#,INV#,PO#,
     A*                                      LINE#
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 001000 00010
     A*         R LZCTFM
     A*
     A            MAILLC        10          COLHDG('EDI MAILBOX' 'ID')
     A            ACCTLC         5  0       COLHDG('ACCT' 'NUMBER')
     A            ACTPLC         1          COLHDG('A/C' 'TYPE')
     A*                                       C= CONS
     A*                                       L = LTL
     A            BOL#LC        17          COLHDG('SHIPPER' 'B/L')
     A            INVZLC         9          COLHDG('INV#')
     A            POLZLC        10          COLHDG('PO #')
     A            LINZLC         6  0       COLHDG('LINE #')
     A            CTNZLC        20          COLHDG('CTN' 'ID')
     A**
     A            ADDEDC         1          COLHDG('CTN' 'ADDED')
     A*                                      ' '
     A*                                      'A' CTN ADDED MANUALLY
     A            ADDIDC        10          COLHDG('ADDED' 'BY')
???? A            INDTLC         8  0       COLHDG('IN' 'DATE')
     A**                                      DATE WE UNLOAD TRL
     A            INTRLC        10          COLHDG('ACTUAL I/B' 'TRL')
     A*                                       UPDATED WHEN CTN SCANNED
     A*                                       INBOUND
     A            OBTRLC        10          COLHDG('OUT' 'TRL')
     A*
     A            OBDTLC         8  0       COLHDG('OUT' 'DATE')
     A**
     A**********************************************************************
     A*           ETH0      -      EDI 210 HEADER FOR TJ MAX(MARMAX)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R ETH0FM
     A*
     A            AEDITH         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJM210
     A            PRO#TH         7  0       COLHDG('PRO#')
     A            SHPIDH        30          COLHDG('SHIPMENT' 'ID#')
     A            CCPPTH         2          COLHDG('PRE-PAID OR COLLECT')
     A            PRODTH         8S 0       COLHDG('PRO' 'DATE')
     A*                                        YYYYMMDD
     A            NET$TH         9  2       COLHDG('NET' 'DUE')
     A            DELDTH         8S 0       COLHDG('DEL' 'DATE')
     A*                                        YYYYMMDD
     A            DTQFTH         3          COLHDG('DATE' 'QUALIFIER')
     A*                                       035
     A            SCACTH         4          COLHDG('CARRIER' 'SCAC')
     A            BILQTH         3          COLHDG('BILLING' 'TYPE')
     A*                                      BLT
     A            BILITH         4          COLHDG('BILLING' 'INFO')
     A*                                      CC = COLLECT
     A*                                      PP = PREPAID
     A*                                      POEA = POE ADVANCED
     A*                                      POEH = POE HANDLING
     A            SHPDTH         8S 0       COLHDG('SHIP' 'DATE')
     A*                                        YYYYMMDD
     A            SHQFTH         2          COLHDG('SHIP DT' 'QUALIFIER')
     A*                                       11
     A            TQTYTH         9  0       COLHDG('TOTAL' 'QTY')
     A            TOWTTH         9  0       COLHDG('TOTAL' 'WGT')
     A            WGTQTH         1          COLHDG('WGT' 'QUALIF')
     A*                                        G = GROSS WEIGHT
     A            TVOLTH         9  0       COLHDG('GROSS' 'TOT VOL')
     A            VOLQFH         1          COLHDG('VOL' 'QUALIF')
     A*                                        E
     A            INV#TH         9  0       COLHDG('INV#')
     A*                                       FOR NRT P/U --
     A*                                        INV#=PRO#
     A            SHPNTH        60          COLHDG('SHIPPER NAME')
     A            SHIDTH        12          COLHDG('LOC' 'ID')
     A*                                       FROM COMP FILE
     A            SHADTH        55          COLHDG('SHIPPER' 'ADDR')
     A            SHCTTH        25          COLHDG('SHIPPER' 'CITY')
     A            SHSTTH         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPTH         5  0       COLHDG('SHIPPER' 'ZIP')
     A            CNNMTH        60          COLHDG('CONSIGNEE')
     A            CNIDTH        12          COLHDG('LOC' 'ID')
     A*                                       FROM CADR FILE
     A            CNADDH        55          COLHDG('CONSIG' 'ADDR')
     A            CNCTTH        25          COLHDG('CONSIG' 'CITY')
     A            CNSTTH         2          COLHDG('CONSIG' 'STATE')
     A            CNZPTH         5  0       COLHDG('CONSIG' 'ZIP')
     A            EQP#TH        10          COLHDG('EQP#')
     A*                                        TRL# OR
     A*                                       CONTAINER# (W/O CHECK DIG
     A            EQPDTH         2          COLHDG('EQP' 'DESC')
     A*                                         TL = TRAILER
     A*                                         CN = CONTAINER
     A            EQSCTH         4          COLHDG('EQP' 'SCAC')
     A*                                       SCAC OF TRL/CONTAINER
     A**********************************************************************
     A*           ETD0      -      EDI 210 DETAIL FOR TJ MAX(MARMAX)
     A*             NOT USED FOR NOW
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETD0FM
     A*
     A            AEDITD         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJM210
     A            PRO#TD         7  0       COLHDG('PRO#')
     A            STP#TD         2  0       COLHDG('STOP #')
     A            STPRTD         2          COLHDG('STP REASON' 'CODE')
     A*                                       CU
     A*                                       CL
     A*                                       PL
     A*                                       PU
     A            TWGTTD         5  0       COLHDG('GROSS' 'TOT WGT')
     A            WGTUTD         1          COLHDG('WGT' 'UNIT CD')
     A*                                        L
     A            TVOLTD         5  0       COLHDG('GROSS' 'TOT VOL')
     A            VOLUTD         1          COLHDG('VOL' 'UNIT CD')
     A*                                        E
     A            TQTYTD         5  0       COLHDG('TOTAL QTY')
     A            NMEQTD         2          COLHDG('NAME' 'QUALIF')
     A*                                      SH - SHIPPER
     A*                                      SF - SHIP FROM
     A            NAMETD        60          COLHDG('NAME')
     A            LOCITD        12          COLHDG('LOC' 'ID')
     A*                                       FROM CADR/COMP FILE
     A            LOCQTD         2          COLHDG('LOC' 'QUALIF')
     A*                                      92
     A            ADDRTD        55          COLHDG('ADDR')
     A            CITYTD        25          COLHDG('CITY')
     A            STATTD         2          COLHDG('STATE')
     A            ZIPCTD         5  0       COLHDG('ZIP')
     A**********************************************************************
     A*           ETP0      -      EDI 210 DETAIL FOR TJ MAX(MARMAX)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETP0FM
     A*
     A            AEDITP         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJM210
     A            PRO#TP         7  0       COLHDG('PRO#')
     A            STP#TP         2  0       COLHDG('STOP #')
     A*                                         = 0
     A*                                       NOT USED SINCE
     A*                                        SPO IS AT HEADER LEVEL
     A*                                        IN THE 210 NOW
     A*                                      !!! DO NOT WRITE PO FOR
     A*                                         EACH STOP
     A            STPRTP         2          COLHDG('STP REASON' 'CODE')
     A*                                       CU
     A*                                       CL
     A*                                       PL
     A*                                       PU
     A            REFITP         2          COLHDG('REF ID')
     A*                                       04 - WMILP
     A*                                       05 - TK MAXX
     A*                                       08 - TJ MAX
     A*                                       10 - MARSHALLS
     A*                                       19 - AJ WRIGHT
     A*                                       24 - WMI LP
     A*                                       28 - HOME GOODS
     A            PO##TP        22          COLHDG('PO #')
     A            CORGTP         3          COLHDG('CT/' 'PC')
     A            WGTTTP         5  0       COLHDG('WGT')
     A            WGTUTP         1          COLHDG('WGT' 'UNIT CD')
     A*                                        L
     A            QUANTP         5  0       COLHDG('QTY')
     A            OBMFTP        30          COLHDG('O/B MANF#')
     A            WRECTP         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A**********************************************************************
     A*           ETB0      -      EDI 210 DETAIL FOR TJ MAX(MARMAX)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETB0FM
     A*
     A            AEDITB         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJM210
     A            PRO#TB         7  0       COLHDG('PRO#')
     A            LINETB         2  0       COLHDG('LINE #')
     A**???       WRAMTB         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            DESCTB        50          COLHDG('DESC')
     A            COMMTB        30          COLHDG('COMMODITY' 'CODE')
     A            COMQTB         1          COLHDG('COMMODITY' 'QUAL')
     A*                                      N
     A*                                      Z
     A            BWGTTB        11          COLHDG('WGT' 'BILLED')
     A            BWGQTB         2          COLHDG('QUALIF')
     A*                                      'LB'  = POUNDS
     A*                                      'FR'  = FLAT RATE
     A*                                      'NP'  = PER PIECE
     A*                                     'DM'   = MILES
     A            WGTTTB         9  0       COLHDG('WGT')
     A            WGTQTB         1          COLHDG('WGT' 'QUALIF')
     A*                                        B = BILLED WEIGHT
     A*                                        G = GROSS WEIGHT
     A*                                        F = DEFICIT WEIGHT
     A            WGTUTB         1          COLHDG('WGT' 'UNIT')
     A*                                        L
     A            QUANTB         9  0       COLHDG('QTY')
     A            PACKTB         3          COLHDG('PACKING' 'CODE')
     A*
     A            FRTRTB         9  2       COLHDG('FREIGHT' 'RATE')
     A            FRTQTB         2          COLHDG('FREIGHT' 'QUALIF')
     A*                                        FR= FLAT RATE
     A*                                        MN= MINIMUM
     A*                                        PH= PER HUNDRED (BASE UNITS)
     A*                                        PL= PER LOAD
     A*                                        PM= PER MILE
     A*                                        WM= WEIGHT MEASUREMENT
     A            SPECTB         3          COLHDG('SPECIAL' 'CODE')
     A            AMT$TB         9  2       COLHDG('CHARGES')
     A            FRTR2B        10          COLHDG('FREIGHT' 'RATE')
     A*                                     SAME VALUE AS FRTQTB
     A*                                     BUT WITH A DECIMAL POINT
     A**********************************************************************
     A*           WRKT    -    8       WORK FILE FOR TJMAX
     A*                                (USED IN PGM E#12WA)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R WRKTFM
     A*
     A            INPR#8         8  0       COLHDG('INBOUND' 'PRO#')
     A            ACCT#8         5  0       COLHDG('CUSTOMER #')
     A            WREC#8         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            DC###8         5  0       COLHDG('TJMAX DC')
     A**********************************************************************
     A*           EL4H    -   H4       HDR FILE FOR 214 FORMAT DETAIL
     A*                                FOR LIZ CLAIBORNE (RECEIVED)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00100
     A*         R EL4HFM
     A*
     A            AEDIH4         5          COLHDG('EDI' 'PARTNER ID')
     A*                                       LZ214
     A            BOL#H4        17          COLHDG('SHIPPER' 'B/L')
     A            REF#H4         8          COLHDG('REC#/PRO#')
     A*                                         REC# IS ACTUALLY 6,0
     A*                                       OR PRO#
     A*                                       OR "REFUSAL"
     A**********************************************************************
     A*           EL4D    -   D4       DTL FILE FOR 214 FORMAT DETAIL
     A*                                FOR LIZ CLAIBORNE (RECEIVED)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00100
     A*         R EL4DFM
     A*
     A            BOL#D4        17          COLHDG('SHIPPER' 'B/L')
     A            REF#D4         8          COLHDG('REC#/PRO#')
     A*                                         REC# IS ACTUALLY 6,0
     A*                                       OR PRO#
     A*                                       OR "REFUSAL"
     A            STATD4         2          COLHDG('SHIPMENT' 'STATUS')
     A*                                       A7 - REFUSED
     A*                                       X1 - ARRIVED AT DELIVERY
     A*                                       X3 - ARRIVED AT P/U
     A            REASD4         2          COLHDG('REASON' 'CODE')
     A*                                       BS - REFUSED BY CUSTOMER
     A*                                       NS - NORMAL STATUS
     A            DATED4         8  0       COLHDG('DATE')
     A*                                      DATE FOR CORR. STATUS
     A            INVZD4         9          COLHDG('INV#')
     A**********************************************************************
     A*           EBH4      -      EDI 214 HEADER FOR BEALLS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EBH4FM
     A*
     A            ACCTBH         5  0       COLHDG('A/C#')
     A*                                       25505 = BEALLS
     A*                                       THIS IS USED AS TRADING
     A*                                        PARTNER IN EDI AND FOR
     A            REF#BH        14          COLHDG('REF#')
     A*                                       1ST 8 POS = PRO#
     A*                                       LAST 6 IS REC#
     A            SCACBH         4          COLHDG('SCAC')
     A*                                       NART
     A            INQRBH         1          COLHDG('EDI' 'FIELD')
     A*                                      '1'
     A            EDILBH         1          COLHDG('EDI LOAD' 'RECD')
     A*                                      'N'
     A            MANFBH         7  0       COLHDG('MANF#')
     A*
     A*           EDIQBH         1          COLHDG('EDI'' 'QUALIFIER')
     A*                                        ' '
     A            SHPNBH        25          COLHDG('SHIPPER NAME')
     A            SHCTBH        25          COLHDG('SHIPPER' 'CITY')
     A            SHSTBH         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPBH         5  0       COLHDG('SHIPPER' 'ZIP')
     A*
     A            TQTYBH         5  0       COLHDG('TOTAL' 'INV QTY')
     A            BASQBH         5  0       COLHDG('BASED ON' 'QTY')
     A            BASWBH         5  0       COLHDG('BASED ON' 'WGT')
     A            WGTQBH         1          COLHDG('WEIGHT' 'QUALIFIER')
     A*                                         'B'
     A            WGUQBH         1          COLHDG('WEIGHT' 'UNIT')
     A*                                         'L'
     A            BAS$BH         7  2       COLHDG('BASED ON' '$$')
     A            SHRTBH         1          COLHDG('SHORT' 'QTY')
     A*                                      ' '
     A*                                      'A' = SHORT
     A            PACKBH         3          COLHDG('CTN/')
     A*                                       CTN
     A*                                       SKD
     A            HANCBH         3          COLHDG('HANDLING' 'CODE')
     A*                                       DRO = VENDOR DROPPED IT
     A*                                       PUC = WE PCIKED UP
     A            CCPPBH         3          COLHDG('COLLECT/' 'PREPAID')
     A*                                      PPD
     A*                                      CPC
     A            TCOLBH         9  2       COLHDG('TOTAL' 'COLLECT$')
     A*
     A            SBL2BH        20          COLHDG('SHIPPER BOL#')
     A*
     A            AKEYBH         6          COLHDG('A/C+TYPE')
     A*
     A            DC##BH         3          COLHDG('DC')
     A**********************************************************************
     A*           EBD4      -      EDI 214 DETAIL FOR BEALLS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EBD4FM
     A*
     A            ACCTBD         5  0       COLHDG('A/C#')
     A*                                       25505 = BEALLS (ONE LOC)
     A*                                       THIS IS USED AS TRADING
     A*                                        PARTNER IN EDI AND FOR
     A*                                        DC LOC AND DC CITY,...
     A            REF#BD        14          COLHDG('REF#')
     A*                                       1ST 8 POS = PRO#
     A*                                       LAST 6 IS REC#
     A            DTQFBD         2          COLHDG('AF DATE' 'QUALIFIER')
     A*                                      'AF'
     A*                                      'AG'
     A            DATEBD         8  0       COLHDG('DATE')
     A*                                       FOR 'AF':
     A*                                       PICK UP DATE (WE PICK UP)
     A*                                       ELSE = RECEIPT DATE
     A*                                       FOR 'AG':
     A*                                       MANIFEST DATE
     A*
     A* FOLLOWING 2 FIELDS ONLY FILLED IN WITH DATE RECORD OF 'AF'
     A            LHCABD         4          COLHDG('LINEHAUL' 'CARRIER')
     A            TRLRBD        12          COLHDG('TRAILER')
     A*
     A**********************************************************************
     A*           EBP4    -            PO FILE FOR 214 FORMAT DETAIL
     A*                                FOR BEALLS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EBP4FM
     A*
     A            ACCTBP         5  0       COLHDG('A/C#')
     A*                                       25505 = BEALLS (ONE LOC)
     A*                                       THIS IS USED AS TRADING
     A*                                        PARTNER IN EDI AND FOR
     A*                                        DC LOC AND DC CITY,...
     A            REF#BP        14          COLHDG('REF#')
     A*                                       1ST 8 POS = PRO#
     A*                                       LAST 6 IS REC#
     A*
     A            LINEBP         5  0       COLHDG('LINE #')
     A            POAMBP         7          COLHDG('PO #')
     A            QTAMBP         5  0       COLHDG('QTY')
     A            QTUNBP         2          COLHDG('QTY UNIT')
     A*                                      CT
     A            WTAMBP         5  0       COLHDG('WGT')
     A            WTUNBP         1          COLHDG('WGT UNIT')
     A*                                      L
     A            DEPTBP         3  0       COLHDG('DEPARTMENT')
     A*
     A**********************************************************************
     A*           WINA    -            WINNER'S ACCOUNT # FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R WINAFM
     A*
     A            ACCTWI         5  0       COLHDG('A/C#')
     A**********************************************************************
     A*           ETJH      -    WORK FILE FOR TJMAX 212 EDI MANF. INFO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00010
     A*         R ETJHFM
     A*
     A            AEDIH2         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJMAX
     A            WMANH2         7  0       COLHDG('WALSH RECEIPT#  ')
     A            ACCTH2         5  0       COLHDG('CUSTOMER #')
     A            SCACH2         4          COLHDG('OUR SCAC')
     A*                                      NART
     A            MANFH2         7  0       COLHDG('CUSTOMER MANIFEST#')
     A            MANDH2         8S 0       COLHDG('MANIFEST' 'DATE')
     A*                                        YYYYMMDD
     A            TRTYH2         2          COLHDG('TRANS.' 'TYPE')
     A**                                     VALUES('00 -- ORIGINAL EDI'
     A            ACNMH2        25          COLHDG('ACCOUNT' 'NAME')
     A            DCCDH2         5          COLHDG('DC CODE')
     A            TRL1H2         8          COLHDG('TRAILER')
     A            OBSCH2         4          COLHDG('O/B' 'SCAC')
     A            TRPFH2        12          COLHDG('TRL &' 'PREFIX')
     A**********************************************************************
     A*           ETJG      -    WORK FILE FOR TJMAX 212 EDI MANF. INFO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00010
     A*         R ETJGFM
     A*
     A            AEDIG2         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJx
     A            IDLCG2         6          COLHDG('EDI' 'ID FOR LOC')
     A*                                       ST OR CS
     A            ACNMG2        25          COLHDG('ACCOUNT' 'NAME')
     A            ASSIG2         8          COLHDG('EDI' 'ASSIGNED CODE')
     A*                                       92
     A            DCCDG2        15          COLHDG('DC CODE')
     A*                                        TJX ASSIGNED (IN CADR FILE)
     A**********************************************************************
     A*           ETJD      -   WORK FILE FOR TJMAX EDI 212 RECEIPT DTL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00010
     A*         R ETJDFM
     A*
     A            AEDID2         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJMAX
     A            WMAND2         7  0       COLHDG('WALSH RECEIPT#  ')
     A            WRECD2         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            ACCTD2         5  0       COLHDG('CUSTOMER #')
     A            REC#D2         6  0       COLHDG('RECEIPT#')
     A            PUDTD2         8S 0       COLHDG('PICK-UP' 'DATE')
     A*                                     YYYYMMDD
     A            REDTD2         8S 0       COLHDG('RECEIPT' 'DATE')
     A*                                     YYYYMMDD
     A            SHIPD2        25          COLHDG('SHIPPER NAME')
     A            SHCID2        25          COLHDG('SHIPPER CITY')
     A            SHSTD2         2          COLHDG('SHIPPER' 'STATE')
     A            SHZID2         5  0       COLHDG('SHIPPER' 'ZIP')
     A            LDSQD2         3  0       COLHDG('LOADING' 'SEQ')
     A**********************************************************************
     A*           ETJR      -  WORK FILE FOR TJAMX 212 PO  (REF#)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00010
     A*         R ETJRFM
     A*
     A            AEDIR2         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJMAX
     A            WMANR2         7  0       COLHDG('WALSH RECEIPT#  ')
     A            REF#R2        30          COLHDG('REF#')
     A*                                       IF FREIGHT BILL# THEN
     A*                                       Nx00yyyyyyyM
     A*                                         x = alpha for our loc
     A*                                             A = AVON
     A*                                             L= LA
     A*                                             N = N BERGEN
     A*                                         y = our manf# preceded
     A*                                             by leading zeros
     A            REFQR2         2          COLHDG('REF#' 'QUALIFIER')
     A*                                        CN = CARRIER PRO#
     A*                                        OU = FREIGHT BILL#
     A*                                        ST= OUR LOC ID
     A*                                          IN REF#R2 FOR THIS
     A*                                            10 = N BERGEN
     A*                                            20 = COMPTON
     A*                                            30 = AVON
     A**********************************************************************
     A*           ETJP      -  WORK FILE FOR TJAMX 212 PO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00010
     A*         R ETJPFM
     A*
     A            AEDIP2         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJMAX
     A            WMANP2         7  0       COLHDG('WALSH MANIFEST #')
     A            WRECP2         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            ACCTP2         5  0       COLHDG('CUSTOMER #')
     A            REC#P2         6  0       COLHDG('RECEIPT#')
     A            PONUP2        10          COLHDG('PO #')
     A            QTYUP2         2          COLHDG('QTY' 'UNIT')
     A*                                          CT = CARTONS
     A*                                          RA = GOH
     A            QTY#P2         5  0       COLHDG('QUANTITY')
     A            WGTUP2         2          COLHDG('QTY' 'UNIT')
     A*                                          L = LBS.
     A            WGT#P2         5  0       COLHDG('WEIGHT')
     A            IBOLP2        20          COLHDG('I/B' 'BOL')
     A*                                       BOL FOR DOMESTIC SHIPMENT
     A*                                       CONTIANER# FOR IMPORTS
     A            LDSQP2         3  0       COLHDG('LOADING' 'SEQ')
     A**********************************************************************
     A*           ETJQ      -  WORK FILE FOR TJAMX 212 PO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00010
     A*         R ETJPQFM
     A*
     A            AEDIPQ         6          COLHDG('EDI' 'INTERCHANGE#')
     A*                                       TJMAX
     A            WMANPQ         7  0       COLHDG('WALSH MANIFEST #')
     A            WRECPQ         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            ACCTPQ         5  0       COLHDG('CUSTOMER #')
     A            REC#PQ         6  0       COLHDG('RECEIPT#')
     A            PONUPQ        10          COLHDG('PO #')
     A            QTYUPQ         2          COLHDG('QTY' 'UNIT')
     A*                                          CT = CARTONS
     A*                                          RA = GOH
     A            QTY#PQ         5  0       COLHDG('QUANTITY')
     A            WGTUPQ         2          COLHDG('QTY' 'UNIT')
     A*                                          L = LBS.
     A            WGT#PQ         5  0       COLHDG('WEIGHT')
     A            IBOLPQ        20          COLHDG('I/B' 'BOL')
     A*                                       BOL FOR DOMESTIC SHIPMENT
     A*                                       CONTIANER# FOR IMPORTS
     A            LDSQPQ         3  0       COLHDG('LOADING' 'SEQ')
     A            SPO02PQ       30          COLHDG('Ref Routing from 250')
     A**********************************************************************
     A*           EMH3      -      EDI B/L HEADER FOR MARSHALL FIELD'S
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 00005
     A*         R EMH3FM
     A*
     A            ACAMH3         5  0       COLHDG('CUSTOMER #')
     A            ACAXH3         6          COLHDG('A/C+TYPE')
     A*                                     TYPE= C FOR CONS.
     A*           WRAMH3         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A*           REC#H3         6  0       COLHDG('RECEIPT #')
     A            MANFH3         7  0       COLHDG('MANIFEST #')
     A            OCARH3        15          COLHDG('O/B CARRIER')
     A            SCACH3         4          COLHDG('SCAC')
     A            MBOLH3        12          COLHDG('MANIFEST' 'BOL')
     A*           INPRH3         8          COLHDG('INBOUND' 'PRO#')
     A            MFIBH3        15          COLHDG('MANIFEST #' 'I/B PRO#')
     A            CCPPH3         2          COLHDG('PRE-PAID OR COLLECT')
     A            MANDH3         8S 0       COLHDG('MANIFEST' 'DATE')
     A*                                        YYYYMMDD
     A            SHPDH3         8S 0       COLHDG('SHIP' 'DATE')
     A*                                        YYYYMMDD
     A*                                        P/U DATE OR RECEIPT
     A*                                        DATE (B/L DATE)
     A            TQTYH3         5  0       COLHDG('TOTAL' 'QTY')
     A            TOWTH3         5  0       COLHDG('TOTAL' 'WGT')
     A*           TCOLH3         7  2       COLHDG('TOTAL' 'COLLECT$')
     A            TADVH3         7  2       COLHDG('PROTECT' 'ADVANCES')
     A            TCCGH3         7  2       COLHDG('TOTAL' 'CONS' 'CHARGES')
     A            INVAH3         7  2       COLHDG('TOTAL' 'INVOICE' 'AMOUNT')
     A            WINVH3         7  0       COLHDG('WALSH' 'INV#')
     A            DEPTH3         4  0       COLHDG('DEPARTMENT' '#')
     A            CONNH3        25          COLHDG('CONSIGNEE' 'NAME')
     A            CDCNH3         5          COLHDG('CONSIGNEE' 'DC#')
     A            CCTYH3        15          COLHDG('CONSIGNEE' 'CITY')
     A            CSTAH3         2          COLHDG('CONSIGNEE' 'STATE')
     A            CZIPH3         5  0       COLHDG('CONSIGNEE' 'ZIP')
     A            SHPNH3        25          COLHDG('SHIPPER NAME')
     A            SHADH3        25          COLHDG('SHIPPER ADD1')
     A            SHSTH3         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPH3         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SBL#H3        20          COLHDG('SHIPPERS B/L #')
     A            NTSC#3         4          COLHDG('NTS' 'CLIENT#')
     A*                                          3604
     A**********************************************************************
     A*           EMF1    -    F1      PO FILE FOR 210 FORMAT DETAIL
     A*                                FOR MARSHALL FIELD'S EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EMF1FM
     A*
     A            ACAMF1         5  0       COLHDG('CUSTOMER #')
     A            WRAMF1         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            MANFF1         7  0       COLHDG('MANIFEST #')
     A            LINEF1         5  0       COLHDG('LINE #')
     A            POAMF1        10          COLHDG('PO #')
     A            QTAMF1         5  0       COLHDG('QTY')
     A            WTAMF1         5  0       COLHDG('WGT')
     A            DESCF1        50          COLHDG('PO' 'DESC')
     A*                                       "ITEMS FOR PO XXXXXXXXXX"
     A*                                       "RECEIPT #  XXXXXXXXXX"
     A**********************************************************************
     A*           EMF2    -    F2      PO FILE FOR 210 FORMAT DETAIL
     A*                                FOR MARSHALL FIELD'S EDI
     A*                                FOR NOW -- THERE IS NO CHARGES
     A*                                AT PO LEVEL -- SO SEND
     A*                                 TOTAL CHARGES AT 1ST PO LEVEL
     A*                                 LX -- L1 1ST PO LOOP
     A*                                 REST PO LOOPS LX -- L1 WILL
     A*                                   HAVE  L1  LOOP WITH 0 CHARGE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EMF2FM
     A*
     A            ACAMF2         5  0       COLHDG('CUSTOMER #')
     A            WRAMF2         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            MANFF2         7  0       COLHDG('MANIFEST #')
     A            LINEF2         5  0       COLHDG('LINE #')
     A            QF$$F2         3          COLHDG('QUALIF' 'CHARGES')
     A*                                      '045' = ADVANCE FEE
     A*                                      'CNS' = CONSOLIDATION FEE
     A*                                      ' '   = NO  FEE
     A            DE$$F2        25          COLHDG('DESC' 'CHARGES')
     A*                                       'ADVANCE FEE' IF HAVE
     A*                                       'CONSOLIDATION FEE'
     A*                                       ' ' IF NO  FEE
     A            TO$$F2         7  2       COLHDG('TOTAL' 'CHARGES')
     A**********************************************************************
     A*           EMF3    -    F3      PO FILE FOR 210 FORMAT DETAIL
     A*                                FOR MARSHALL FIELD'S EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EMF3FM
     A*
     A            ACAMF3         5  0       COLHDG('CUSTOMER #')
     A            MANFF3         7  0       COLHDG('MANIFEST #')
     A**********************************************************************
     A*           CWRP      -                CONS WORK FILE FOR
     A*                                      TARGET EDI 223
     A*                                      (PGM E#10WA)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 030000 00010
     A*         R CWRPFM
     A*
     A            ACRETM         1          COLHDG('ACTIVE' 'CODE')
     A*                                         = ACTIVE
     A            ACCTTM         5  0       COLHDG('CUSTOMER #')
     A            WRECTM         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            REC#TM         6  0       COLHDG('RECEIPT #')
     A            PO##TM        10          COLHDG('PO #')
     A            INPRTM         8  0       COLHDG('I/B' 'PRO#')
     A**********************************************************************
     A*           TJWK      -                TJAMX WORK FILE USED IN
     A*                                      PGM TJ001RE AND E#12WA
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 030000 00010
     A*         R TJWKFM
     A*
     A            ACCT#WK        5  0       COLHDG('CUSTOMER #')
     A            WREC#WK        7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            WMANFWK        7  0       COLHDG('WALSH MANIFEST #')
     A            CTGOHWK        1          COLHDG('CTN/GOH')
     A*                                         C
     A*                                         G
     A*
     A**********************************************************************
     A*           TJRD      -  T7            TJMAXX READY CONTAINERS WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000100 00010
     A*         R TJRDFM
     A*
     A            TERMCT7        6          COLHDG('TERMINAL' 'CODE')
     A            CONT#T7       11          COLHDG('CONTAINER#')
     A            ORDERT7        7  0       COLHDG('ORDER #')
     A            RDATET7         L         COLHDG('READY' 'DATE')
     A                                      DFT('0001-01-01')
     A            RTIMET7        1          COLHDG('READY TIME' 'AM/PM')
     A            HDEPTT7        1          COLHDG('HOT DEPT' 'Y/N')
     A            PERCTT7        4  0       COLHDG('HOT DEPT %')
     A            ELPDTT7         L         COLHDG('EARLIEST' 'LP DATE')
     A                                      DFT('0001-01-01')
     A            PICLCT7        6          COLHDG('PICKUP LOCATION' 'CODE')
     A*
     A**********************************************************************
     A*           TJXW      -  TZ            TJAMX HIGH PRIORITY DEPT WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 030000 00010
     A*         R TJXWFM
     A*
     A            TERMCTZ        3          COLHDG('TERMINAL' 'CODE')
     A            CUSTCTZ        3          COLHDG('CUSTOMER' 'CODE')
     A            YDOPTTZ        1          COLHDG('IN YARD' 'AT PORT')
     A*                                         Y = YARD
     A*                                         P = PORT
     A            TTYPETZ        1          COLHDG('CONTAINER' 'TRAILER')
     A*                                         C = CONTAINER
     A*                                         T = TRAILER
     A            CTTR#TZ       11          COLHDG('CONT/TRL #')
     A            PO###TZ       10          COLHDG('PURCHASE' 'ORDER #')
     A            LADPLTZ         L         COLHDG('LADDER PLAN' 'DATE')
     A                                      DFT('0001-01-01')
     A*
     A            LADPCTZ        1          COLHDG('LADDER PLAN' 'CODE')
     A            DCCODTZ        4  0       COLHDG('DC' 'CODE')
     A            CNLDTTZ         L         COLHDG('CANCEL' 'DATE')
     A                                      DFT('0001-01-01')
     A            DEPT#TZ        4  0       COLHDG('DEPARTMENT #')
     A            DEPTHTZ        4          COLHDG('HOT' 'DEPARTMENT')
     A            QTY##TZ        5  0       COLHDG('PO' 'QUANTITY')
     A            WGT##TZ        7  0       COLHDG('PO' 'WEIGHT')
     A            RECDTTZ         L         COLHDG('RECEIPT' 'DATE')
     A                                      DFT('0001-01-01')
     A            CONT#TZ        3  0       COLHDG('CONTROL #')
     A            IMTYPTZ        1          COLHDG('IMPORT' 'TYPE')
     A            FACL#TZ        3          COLHDG('FACILITY')
     A            YARD#TZ        1          COLHDG('YARD')
     A*
     A**********************************************************************
     A*           TJHD      -  TY            TJAMX HIGH PRIORITY DEPT MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R TJHDFM
     A*
     A            ACRECTY        1          COLHDG('ACTIVE RECORD')
     A            CUSTCTY        3          COLHDG('CUSTOMER' 'CODE')
     A            DEPT#TY        4  0       COLHDG('DEPARTMENT #')
     A            NAMEDTY       25          COLHDG('DEPARTMENT' 'NAME')
     A*
     A**********************************************************************
     A*           MAAK    -    MK      MACYS ASN AUDIT WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00010
     A*         R MAAKFM
     A*
     A            ACRECMK        1          COLHDG('ACTIVE RECORD')
     A            OBTRLMK       11          COLHDG('OB TRAILER')
     A            ACCT#MK        5  0       COLHDG('ACCOUNT #')
     A            CRTN#MK       20          COLHDG('CARTON #')
     A            PFLAGMK        1          COLHDG('PROCESS' 'FLAG')
     A            WREC#MK        7  0       COLHDG('INTERNAL' 'WALSH REC#')
     A            RCODEMK       20          COLHDG('REASON' 'CODE')
     A            AUDDTMK         L         COLHDG('AUDIT' 'DATE')
     A                                      DFT('0001-01-01')
     A            AUDTMMK        4  0       COLHDG('AUDIT' 'TIME')
     A                                      DFT(0)
     A            BOTRLMK       11          COLHDG('ASNBO' 'OB TRAILER')
     A            BACCTMK        5  0       COLHDG('ASNBO' 'ACCOUNT #')
     A*
     A**********************************************************************
     A*           NRCW    -    NR      NRT VS NRC BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R NRCWFM
     A*
     A            ARECCNR        1          COLHDG('ACTIVE RECORD')
     A            ACCT#NR        5  0       COLHDG('NRC ACCOUNT #')
     A            INPRONR        8  0       COLHDG('INBOUND' 'PRO#')
     A            MANF#NR        7  0       COLHDG('MANIFEST #')
     A            MDATENR        8  0       COLHDG('MANIFEST DATE')
     A            REC##NR        6  0       COLHDG('RECEIPT #')
     A            RDATENR        8  0       COLHDG('RECEIPT DATE')
     A            TOADVNR        7  2       COLHDG('TOTAL' 'ADVANCE')
     A            LHAULNR        7  2       COLHDG('LINE HAUL')
     A            MATCHNR        1          COLHDG('MATCH FIELD')
     A*
     A**********************************************************************
     A*           NWRK    -    NW      NRT VS NRC BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R NWRKFM
     A*
     A            ACCT#NW        5  0       COLHDG('NRT ACCOUNT #')
     A            CONS#NW        5  0       COLHDG('CONS ACCOUNT #')
     A            MANF#NW        7  0       COLHDG('MANIFEST #')
     A            MDATENW        8  0       COLHDG('MANIFEST DATE')
     A            DFLAGNW        1          COLHDG('DATE FLAG')
     A            INPRONW        8  0       COLHDG('INBOUND' 'PRO#')
     A            TOADVNW        7  2       COLHDG('TOTAL' 'ADVANCE')
     A            PDATENW        8  0       COLHDG('PRO DATE')
     A*
     A**********************************************************************
     A*           ZIPC    -    Z       DEST. ZIP CODE CROSS REFERENCE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ZIPCFM
     A*
     A            ZIPCCC         5          COLHDG('DEST. ZIP CODE')
     A            CROZPC         4          COLHDG('CROSS REF. ZIP')
     A            DESTCC        25          COLHDG('DESTINATION NAME')
     A            ACCTCC         5  0       COLHDG('ACCOUNT' '#')
     A            POLDCC         1          COLHDG('PO LAST DIGIT')
     A            STR##C         5  0       COLHDG('STORE #')
     A            STR#AC         5          COLHDG('STORE #' 'ALPHA')
     A*
     A**********************************************************************
     A*           FEDV    -    FV      FEDERATED VENDOR 820 FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R FEDVFM
     A*
     A            ACCTFV         7  0       COLHDG('ACCOUNT#')
     A            NAMEFV        30          COLHDG('ACCOUNT NAME')
     A            ADDRFV        30          COLHDG('ADDRESS LINE 1')
     A            CITYFV        20          COLHDG('CITY')
     A            STATFV         4          COLHDG('STATE')
     A            ZIPCFV        10          COLHDG('ZIP CODE')
     A            COUNFV        30          COLHDG('COUNTRY')
     A            APIDFV         2  0       COLHDG('APPLICATION ID')
     A**********************************************************************
     A*           TRTM    -    2       TRAVEL TIME FOR FED.A/C
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R TRTMFM
     A*
     A            ACCTM2         5  0       COLHDG('ACCOUNT#')
     A* REGULAR TRUCK -  MON TO SAT (EACH TIME IS 2,0
     A*              E.G. IF MONDAY O/B BY TRUCK
     A*                   WILL TAKE  5 DAYS TO REACH
     A*                   FIRST 2 POS WILL BE 05 IN TRKTM2
GP01 A            TRKTM2        14          COLHDG('TRUCKTIME')
     A* REGULAR RAIL- MON TO SAT (EACH TIME IS 2,0
GP01 A            RRLTM2        14          COLHDG('REG RAIL')
     A* EXPEDITED RAIL
GP01 A            EXRTM2        14          COLHDG('EXPED RAIL')
     A* UNUSED
GP01 A            AAATM2        14          COLHDG('UNUSED')
     A**********************************************************************
     A*           STND    -    SD      STEINMART RECEIPTS DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R STNDFM
     A*
     A            STS1SD         1          COLHDG('STATUS')
     A            ACCTSD         5  0       COLHDG('ACCOUNT #')
     A            REC#SD         6  0       COLHDG('RECEIPT #')
     A            BARCSD        20          COLHDG('BARCODE')
     A            IDATSD          L         COLHDG('I/B DATE')
     A                                      DFT('0001-01-01')
     A            SCACSD         4          COLHDG('SCAC CODE')
     A            OTRLSD        11          COLHDG('O/B TRAILER')
     A            STORSD         5  0       COLHDG('STORE')
     A            DC##SD         5  0       COLHDG('DC')
     A            ODATSD          L         COLHDG('O/B DATE')
     A                                      DFT('0001-01-01')
     A            IBIDSD         5  0       COLHDG('I/B CODE#')
     A            OBIDSD         5  0       COLHDG('O/B CODE#')
     A            WMANSD         7  0       COLHDG('WALSH MANIFEST#')
     A            ICHGSD         5  0       COLHDG('I/B CHANGE CODE#')
     A            ICHDSD          L         COLHDG('I/B CHANGE DATE')
     A                                      DFT('0001-01-01')
     A            ICHTSD         4  0       COLHDG('I/B CHANGE TIME')
     A            OCHGSD         5  0       COLHDG('O/B CHANGE CODE#')
     A            OCHDSD          L         COLHDG('O/B CHANGE DATE')
     A                                      DFT('0001-01-01')
     A            OCHTSD         4  0       COLHDG('O/B CHANGE TIME')
     A            ITIMSD         4  0       COLHDG('I/B SCAN TIME')
     A            OTIMSD         4  0       COLHDG('O/B SCAN TIME')
     A**********************************************************************
     A*           STNH    -    SH      STEINMART RECEIPTS HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R STNHFM
     A*
     A            STS1SH         1          COLHDG('STATUS')
     A            ACCTSH         5  0       COLHDG('ACCOUNT #')
     A            REC#SH         6  0       COLHDG('RECEIPT #')
     A            SCNQSH         5  0       COLHDG('I/B SCAN QTY')
     A            RECQSH         5  0       COLHDG('RECEIPT QTY')
     A            OBSQSH         5  0       COLHDG('O/B SCAN QTY')
     A**********************************************************************
     A*           STNS    -    ST      STEINMART STORE MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R STNSFM
     A*
     A            ARECST         1          COLHDG('RECORD CODE')
     A            ACCTST         5  0       COLHDG('ACCOUNT #')
     A            STORST         5  0       COLHDG('STORE')
     A            DC##ST         5  0       COLHDG('DC')
     A**********************************************************************
     A*           STNC    -    SC      STEINMART SSECURITY CODES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000050 00010
     A*         R STNCFM
     A*
     A            ARECSC         1          COLHDG('RECORD CODE')
     A            SEC#SC         5  0       COLHDG('SECURITY CODE')
     A            USERSC        25          COLHDG('USER NAME')
     A**********************************************************************
     A*           STNX    -    SX      STEINMART BAR CODE REMOVE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R STNXFM
     A*
     A            ARECSX         1          COLHDG('RECORD CODE')
     A            ACCTSX         5  0       COLHDG('ACCOUNT #')
     A            REC#SX         6  0       COLHDG('RECEIPT #')
     A            BARCSX        20          COLHDG('BARCODE')
     A            SEC#SX         5  0       COLHDG('SECURITY CODE')
     A            RDATSX          L         COLHDG('REMOVE DATE')
     A                                      DFT('0001-01-01')
     A**********************************************************************
     A*           STNZ    -    SZ      STEINMART FREIGHT CHARGE BACK
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000050 00010
     A*         R STNZFM
     A*
     A            ARECSZ         1          COLHDG('RECORD CODE')
     A            FAMGSZ         2          COLHDG('FAMILY CODE')
     A            FAMSSZ         4          COLHDG('FAMILY SUB GROUP')
     A            MIN$SZ         6  2       COLHDG('MINIMUM CHARGE')
     A            WC1LSZ         5  0       COLHDG('WEIGHT CLASS #1')
     A            WC1$SZ         5  4       COLHDG('WC#1 COST/LB')
     A            WC2LSZ         5  0       COLHDG('WEIGHT CLASS #2')
     A            WC2$SZ         5  4       COLHDG('WC#2 COST/LB')
     A**********************************************************************
     A*           SLAD    -    CD      STEINMART I/B 212 DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R SLADFM
     A*
     A            BOL#CD        17          COLHDG('BOL#')
     A            MANFCD         7  0       COLHDG('MANIFEST #')
     A            TRALCD        11          COLHDG('TRAILER #')
     A            CRTNCD        20          COLHDG('CARTON #')
     A            USIDCD         5  0       COLHDG('USER ID' 'CODE')
     A            DATECD          L         COLHDG('I/B DATE')
     A                                      DFT('0001-01-01')
     A            TIMECD         4  0       COLHDG('I/B TIME')
     A            VENDCD         1          COLHDG('VENDOR' 'TYPE')
     A            STATCD         1          COLHDG('STATUS')
     A            DAMGCD         1          COLHDG('DAMAGE' 'CODE')
     A            PFSTCD         1          COLHDG('PROBLEM FEIGHT' 'STATUS')
     A            ADDRCD         1          COLHDG('ADD' 'RECORD')
     A            PNORCD        10          COLHDG('POINT OF' 'ORIGIN')
     A            PO##CD        10          COLHDG('PO#')
     A            E944CD         1          COLHDG('EDI 944 CREATED' 'Y/N')
     A            MPO#CD        22          COLHDG('MASTER'  'PO#')
     A            POQTCD         6  0       COLHDG('TOTAL PO' 'QUANTITY')
     A            UCHGCD         5  0       COLHDG('CHANGED BY' 'CODE')
     A**********************************************************************
     A*           SLAE    -    CE      STEINMART EXCEPTION FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 005000 00010
     A*         R SLAEFM
     A*
     A            BOL#CE        17          COLHDG('BOL#')
     A            MANFCE         7  0       COLHDG('MANIFEST #')
     A            TRALCE        11          COLHDG('TRAILER #')
     A            CRTNCE        20          COLHDG('CARTON #')
     A            USIDCE         5  0       COLHDG('USER ID')
     A            DATECE          L         COLHDG('I/B DATE')
     A                                      DFT('0001-01-01')
     A            TIMECE         4  0       COLHDG('I/B TIME')
     A            VENDCE         1          COLHDG('VENDOR' 'TYPE')
     A            STATCE         1          COLHDG('STATUS')
     A            DAMGCE         1          COLHDG('DAMAGE' 'CODE')
     A            PFSTCE         1          COLHDG('PROBLEM FEIGHT' 'STATUS')
     A            ADDRCE         1          COLHDG('ADD' 'RECORD')
     A            PNORCE        10          COLHDG('POINT OF' 'ORIGIN')
     A            PO##CE        10          COLHDG('PO#')
     A            E944CE         1          COLHDG('EDI 944 CREATED' 'Y/N')
     A            MPO#CE        22          COLHDG('MASTER'  'PO#')
     A            POQTCE         6  0       COLHDG('TOTAL PO' 'QUANTITY')
     A**********************************************************************
     A*           SLAH    -    CH      STEINMART I/B 212 HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R SLAHFM
     A*
     A            BOL#CH        17          COLHDG('BOL#')
     A            MANFCH         7  0       COLHDG('MANIFEST #')
     A            TRALCH        11          COLHDG('TRAILER #')
     A            CLOSCH          L         COLHDG('MANF CLOSE' 'DATE')
     A                                      DFT('0001-01-01')
     A            STRTCH          L         COLHDG('START UNLOAD' 'DATE')
     A                                      DFT('0001-01-01')
     A            HARDCH          L         COLHDG('HARD CLOSE' 'DATE')
     A                                      DFT('0001-01-01')
     A            HARTCH         4  0       COLHDG('HARD CLOSE' 'TIME')
     A            SOFTCH          L         COLHDG('SOFT CLOSE' 'DATE')
     A                                      DFT('0001-01-01')
     A            SFTTCH         4  0       COLHDG('SOFT CLOSE' 'TIME')
     A            EQTYCH         5  0       COLHDG('EXPECTED' 'QTY')
     A            RQTYCH         5  0       COLHDG('RECEIVED' 'QTY')
     A            PEROCH        25          COLHDG('PERSON' 'OPEN TRLR')
     A            PERSCH        25          COLHDG('PERSON' 'SOFT CLOSE')
     A            PERHCH        25          COLHDG('PERSON' 'HARD CLOSE')
     A            SEALCH         8          COLHDG('SEAL#')
     A            PNORCH        10          COLHDG('POINT OF' 'ORIGIN')
     A            EDIICH          Z         COLHDG('EDI I/B TIMESTAMP')
     A            SCACCH         4          COLHDG('SCAC CODE')
     A            DIRTCH         1          COLHDG('DIRECT' 'TRAILER')
     A            DIRDCH          L         COLHDG('DIRECT TRLR' 'ENTRY DATE')
     A                                      DFT('0001-01-01')
     A**********************************************************************
     A*           SLAV    -    CV      STEINMART EDI RH & RD DOWNLOAD
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R SLAVFM
     A*
     A            BOL#CV        17          COLHDG('BOL#')
     A            MANFCV         7  0       COLHDG('MANIFEST #')
     A            TRALCV        11          COLHDG('TRAILER #')
     A            CLOSCV          L         COLHDG('MANF CLOSE' 'DATE')
     A                                      DFT('0001-01-01')
     A            DOWNCV          L         COLHDG('DOWN LOAD' 'DATE')
     A                                      DFT('0001-01-01')
     A            PFL1CV         1          COLHDG('PROCESS' 'FLAG #1')
     A            PCD1CV         3          COLHDG('PROCESS' 'CODE #1')
     A            PDT1CV         8          COLHDG('PROCESS' 'DATE #1')
     A            PFL2CV         1          COLHDG('PROCESS' 'FLAG #2')
     A            PCD2CV         3          COLHDG('PROCESS' 'CODE #2')
     A            PDT2CV         8          COLHDG('PROCESS' 'DATE #2')
     A            PFL3CV         1          COLHDG('PROCESS' 'FLAG #3')
     A            PCD3CV         3          COLHDG('PROCESS' 'CODE #3')
     A            PDT3CV         8          COLHDG('PROCESS' 'DATE #3')
     A            PFL4CV         1          COLHDG('PROCESS' 'FLAG #4')
     A            PCD4CV         3          COLHDG('PROCESS' 'CODE #4')
     A            PDT4CV         8          COLHDG('PROCESS' 'DATE #4')
     A            PFL5CV         1          COLHDG('PROCESS' 'FLAG #5')
     A            PCD5CV         3          COLHDG('PROCESS' 'CODE #5')
     A            PDT5CV         8          COLHDG('PROCESS' 'DATE #5')
     A**********************************************************************
     A*           SLAW    -    CW      STEINMART PO EDIT CHECK FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00010
     A*         R SLAWFM
     A*
     A            ARECCW         1          COLHDG('ACTIVE' 'RECORD')
     A            DEPTCW         4  0       COLHDG('DEPARTMENT#')
     A            AMNTCW         7  2       COLHDG('AMOUNT')
     A**********************************************************************
     A*           MLHT    -    ML      MACYS LEVEL OF SERVICE HISTORY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0300000 020000 00010
     A*         R MLHTFM
     A*
     A            ARECML         1          COLHDG('ACTIVE' 'RECORD')
     A            ACCTML         5  0       COLHDG('CUSTOMER #')
     A            REC#ML         6  0       COLHDG('RECEIPT #')
     A            WRECML         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            RJULML         5  0       COLHDG('RECEIPT' 'JULIAN')
     A            CONTML         3  0       COLHDG('CONTROL #')
     A            TERMML         2          COLHDG('TERMINAL #')
     A            ICARML         5  0       COLHDG('CARRIER' 'CODE')
     A            TRLRML        10          COLHDG('INBOUND' 'TRAILER')
     A            IBDDML         2S 0       COLHDG('INBOUND' 'DAY')
     A            IBMMML         2S 0       COLHDG('INBOUND' 'MONTH')
     A            IBYYML         2S 0       COLHDG('INBOUND' 'YEAR')
     A            IBTMML         4  0       COLHDG('INBOUND' 'TIME')
     A            STDDML         2S 0       COLHDG('START' 'DAY')
     A            STMMML         2S 0       COLHDG('START' 'MONTH')
     A            STYYML         2S 0       COLHDG('START' 'YEAR')
     A            STTMML         4  0       COLHDG('START' 'TIME')
     A            LDDDML         2S 0       COLHDG('LOADED' 'DAY')
     A            LDMMML         2S 0       COLHDG('LOADED' 'MONTH')
     A            LDYYML         2S 0       COLHDG('LOADED' 'YEAR')
     A            LDTMML         4  0       COLHDG('LOADED' 'TIME')
     A            PFLGML         1          COLHDG('PRINT' 'FLAG')
     A**********************************************************************
     A*           MAPO    -    MJ      MARSHALLS TJMAXX PO CROSS-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 000500 00010
     A*         R MAPOFM
     A*
     A            ARECMJ         1          COLHDG('ACTIVE' 'RECORD')
     A            AJPOMJ        10  0       COLHDG('AJ WRIGHT' 'PO#')
     A            PREFMJ         2  0       COLHDG('PO' 'PREFIX')
     A            MTPOMJ        10  0       COLHDG('MARSHALLS/TJMAXX' 'PO#')
     A            DCNTMJ        25          COLHDG('DESTINATION')
     A**********************************************************************
     A*           MLWK    -    MW      MACYS LEVEL OF SERVICE R.S.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0300000 020000 00010
     A*         R MLWKFM
     A*
     A            ARECMW         1          COLHDG('ACTIVE' 'RECORD')
     A            ACCTMW         5  0       COLHDG('CUSTOMER #')
     A            WRECMW         7  0       COLHDG('INTERNAL' 'WALSH RECEIPT #')
     A            RJULMW         5  0       COLHDG('RECEIPT' 'JULIAN')
     A            CONTMW         3  0       COLHDG('CONTROL #')
     A            TERMMW         2          COLHDG('TERMINAL #')
     A            ICARMW         5  0       COLHDG('CARRIER' 'CODE')
     A            LOCTMW         3          COLHDG('LOCATION')
     A            SCACMW         6          COLHDG('SCAC CODE')
     A            IBTRMW        10          COLHDG('I/B TRAILER')
     A            IDATMW          L         COLHDG('I/B' 'DATE')
     A                                      DFT('0001-01-01')
     A            ITIMMW         4  0       COLHDG('I/B' 'TIME')
     A                                      DFT(0)
     A            PDATMW          L         COLHDG('P/U' 'DATE')
     A                                      DFT('0001-01-01')
     A            PWKDMW          L         COLHDG('PWK' 'DATE')
     A                                      DFT('0001-01-01')
     A            TDATMW          L         COLHDG('THRU' 'DATE')
     A                                      DFT('0001-01-01')
     A            TTIMMW         4  0       COLHDG('THRU' 'TIME')
     A                                      DFT(0)
     A            VENDMW        12          COLHDG('VENDOR')
     A            ZIPCMW         5  0       COLHDG('ZIP CODE')
     A            CTNSMW         5  0       COLHDG('CARTONS')
     A            WGHTMW         6  0       COLHDG('WEIGHT')
     A            PO##MW        10          COLHDG('PO#')
     A            DDCCMW         5          COLHDG('DDC CODE')
     A            EDATMW          L         COLHDG('ETA' 'DATE')
     A                                      DFT('0001-01-01')
     A            OSCAMW         4          COLHDG('O/B SCAC')
     A            OBTRMW         8          COLHDG('O/B TRAILER')
     A            MANFMW        13          COLHDG('OB MANF BOL')
     A            CDATMW          L         COLHDG('CLOSE' 'DATE')
     A                                      DFT('0001-01-01')
     A            CTIMMW         4  0       COLHDG('CLOSE' 'TIME')
     A                                      DFT(0)
     A            ODATMW          L         COLHDG('O/B' 'DATE')
     A                                      DFT('0001-01-01')
     A            OTIMMW         4  0       COLHDG('O/B' 'TIME')
     A                                      DFT(0)
     A            ADATMW          L         COLHDG('ASN' 'DATE')
     A                                      DFT('0001-01-01')
     A            ATIMRR         4  0       COLHDG('ASN' 'TIME')
     A                                      DFT(0)
     A            SDATMW          L         COLHDG('START' 'DATE')
     A                                      DFT('0001-01-01')
     A            STIMMW         4  0       COLHDG('START' 'TIME')
     A                                      DFT(0)
     A**********************************************************************
     A*           INTA    -    IA      INTERNAL DATA ACCOUNT TYPE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R INTAFM
     A*
     A            ARECIA         1          COLHDG('ACTIVE' 'RECORD')
     A            ACCTIA        25          COLHDG('ACCOUNT' 'TYPE')
     A**********************************************************************
     A*           INTB    -    IB      INTERNAL DATA BUILDING
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R INTBFM
     A*
     A            ARECIB         1          COLHDG('ACTIVE' 'RECORD')
     A            BLDGIB        15          COLHDG('BUILDING')
     A            LOCIB          2          COLHDG('LOCATION')
     A**********************************************************************
     A*           INTT    -    IT      INTERNAL DATA TYPE OF WORK
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R INTTFM
     A*
     A            ARECIT         1          COLHDG('ACTIVE' 'RECORD')
     A            TWRKIT        20          COLHDG('TYPE OF' 'WORK')
     A**********************************************************************
     A*           INTW    -    IW      INTERNAL DATA WORK TASK
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00100
     A*         R INTWFM
     A*
     A            ARECIW         1          COLHDG('ACTIVE' 'RECORD')
     A            SEC#IW         5  0       COLHDG('SECURITY CODE')
     A            CDATIW          L         COLHDG('CREATE' 'DATE')
     A                                      DFT('0001-01-01')
     A            CTIMIW         6  0       COLHDG('CREATE' 'TIME')
     A                                      DFT(0)
     A            BLDGIW        15          COLHDG('BUILDING')
     A            ACCTIW        25          COLHDG('ACCOUNT' 'TYPE')
     A            WORKIW        20          COLHDG('TYPE OF' 'WORK')
     A            WDATIW          L         COLHDG('WORK' 'DATE')
     A                                      DFT('0001-01-01')
     A            VALUIW        10  2       COLHDG('NUMERIC' 'VALUE')
     A            LOCIW          2          COLHDG('LOCATION')
      *
     A            UUSERIW        5  0       COLHDG('UPDATE' 'USER')
     A            UDATIW          L         COLHDG('UPDATE' 'DATE')
     A                                      DFT('0001-01-01')
     A            UTIMIW         6  0       COLHDG('UPDATE' 'TIME')
     A                                      DFT(0)
     A**********************************************************************
     A*           SCOB    -    S1      SCAN OB DOOR W/ TRAILER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R SCOBFM
     A*
     A            ARECS1         1          COLHDG('ACTIVE' 'RECORD')
     A            BLDGS1         3          COLHDG('LOC/ BUILDING')
     A            OBDRS1         4  0       COLHDG('O/B DOOR #')
     A            TRALS1        11          COLHDG('TRAILER #')
     A            ACCTS1         5  0       COLHDG('ACCOUNT #')
     A            EMFLG1         1          COLHDG('EMAIL' 'FLAG')
     A            SNTFL1         1          COLHDG('SENT' 'FLAG')
     A            SCACS1         4          COLHDG('SCAC' 'CODE')
     A**********************************************************************
     A*           SCRC    -    S2      SCAN LOADED RECEIPT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 020000 00100
     A*         R SCRCFM
     A*
     A            ARECS2         1          COLHDG('ACTIVE' 'RECORD')
     A            TRALS2        11          COLHDG('TRAILER #')
     A            WRECS2         7  0       COLHDG('INTERNAL' 'WALSH REC#')
     A            ACCTS2         5  0       COLHDG('ACCOUNT #')
     A            STATS2         1          COLHDG('STATUS')
     A            DOORS2         4  0       COLHDG('I/B DOOR #')
     A            PALSS2        10          COLHDG('PALLET' 'HEADER')
     A            BLDGS2         3          COLHDG('LOC/ BUILDING')
     A            IBDTS2          L         COLHDG('I/B SCAN' 'DATE')
     A                                      DFT('0001-01-01')
     A            IBTMS2         4  0       COLHDG('I/B SCAN' 'TIME')
     A                                      DFT(0)
     A            ICODS2         5  0       COLHDG('I/B' 'USER CODE')
     A            OBDTS2          L         COLHDG('O/B SCAN' 'DATE')
     A                                      DFT('0001-01-01')
     A            OBTMS2         4  0       COLHDG('O/B SCAN' 'TIME')
     A                                      DFT(0)
     A            OCODS2         5  0       COLHDG('O/B' 'USER CODE')
     A            OBDRS2         4  0       COLHDG('O/B DOOR #')
     A            IBQTS2         5  0       COLHDG('I/B' 'QTY')
     A            FRTYP2         2          COLHDG('FREIGHT TYPE')
     A*                                     PL - PALLET
     A*                                     FL - FLOOR LOADED
     A*                                     XX - XXXXXXXXXXXX
     A            WMANF2         7  0       COLHDG('WALSH MANIFEST #')
     A**********************************************************************
     A*           SCBL    -    S3      SCAN BUILDING/ LOC MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00010
     A*         R SCBLFM
     A*
     A            ARECS3         1          COLHDG('ACTIVE' 'RECORD')
     A            BLDGS3         3          COLHDG('BUILDING/ LOC CODE')
     A            NAMES3        25          COLHDG('BLDG/ LOC NAME')
     A**********************************************************************
     A*           SHDA    -    SA      SCAN THD RECEIPTS AUDIT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 000500 00010
     A*         R SHDAFM
     A*
     A            ARECSA         1          COLHDG('ACTIVE' 'RECORD')
     A            LOCASA         4          COLHDG('LOCATION' 'CODE')
     A            USERSA        10          COLHDG('USER' 'CODE')
     A            TYPESA         1          COLHDG('AUDIT' 'TYPE')
     A*                                        R = RECEIVING
     A*                                        S = SHIPPING
     A            ACCTSA         5  0       COLHDG('ACCOUNT#')
     A            WRECSA         7  0       COLHDG('W. REC#')
     A            STATSA         1          COLHDG('RECEIPT' 'STATUS')
     A            ITEMSA        12          COLHDG('ITEM#')
     A            PO##SA        11          COLHDG('PO#')
     A            RECQSA         5  0       COLHDG('RECEIPT' 'QTY')
     A            OBSQSA         5  0       COLHDG('OBSERVED' 'QTY')
     A            AUDTSA         1          COLHDG('AUDIT' 'REASON CODE')
     A            SDATSA          L         COLHDG('SCAN' 'DATE')
     A                                      DFT('0001-01-01')
     A            STIMSA          T         COLHDG('SCAN' 'TIME')
     A                                      DFT('00.00.00')
     A*
     A**********************************************************************
     A*           WKAR    -    WA      WORK FILE FOR TRGET A/R
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000100 00010
     A*         R WKARFM
     A*
     A            ARECWA         1          COLHDG('ACTIVE' 'RECORD')
     A            WINVWA         7  0       COLHDG('WALSH INV#')
     A            MANFWA          L         COLHDG('MANF' 'DATE')
     A                                      DFT('0001-01-01')
     A            IPROWA         8  0       COLHDG('I/B PRO#')
     A            CARRWA         8          COLHDG('I/B CARR' 'NAME')
     A            OPN$WA         9  2       COLHDG('CONS$' 'OPEN AMT')
     A            MAN#WA         7  0       COLHDG('MANIFEST #')
     A            ORIGWA         9  2       COLHDG('ORIGINAL' 'AMT')
     A            CONNWA        25          COLHDG('CONSIGNEE' 'NAME')
     A            SCACWA         4          COLHDG('SCAC' 'CODE')
     A**********************************************************************
     A*           HDCM    -    HC      THD CARRIER MASTER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000100 00010
     A*         R HDCMFM
     A*
     A            ARECHC         1          COLHDG('ACTIVE' 'RECORD')
     A            DCIDHC         4          COLHDG('DC ID')
     A            NAMEHC        25          COLHDG('DC' 'NAME')
     A            LOHRHC         5  0       COLHDG('L/H HOURS')
     A            LOSRHC         5  0       COLHDG('LEVEL OF' 'SERVICE')
     A            CARRHC         4          COLHDG('PRIMARY' 'CARRIER')
     A            MODEHC         5          COLHDG('MODE')
     A            ACCTHC         5  0       COLHDG('ACCOUNT#')
     A            CRR2HC         4          COLHDG('SECONDARY' 'CARRIER')
     A            TERMHC         2          COLHDG('TERMINAL ID')
     A            CRR3HC         4          COLHDG('TERTIARY' 'CARRIER')
     A            DCTYPE         5          COLHDG('DC' 'TYPE')
     A**********************************************************************
     A*           HDBW    -    HB      THD BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R HDBWFM
     A*
     A            ARECHB         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMHB         2          COLHDG('TERMINAL ID')
     A            CONTHB        19          COLHDG('CONTAINER')
     A            AGPOHB        22          COLHDG('AGGREGATE PO')
     A            ALPOHB        30          COLHDG('ALLOCATION PO')
     A            CBM#HB         5  3       COLHDG('CUBIC' 'MEASURMENT')
     A            QTYRHB         5  0       COLHDG('QUANTITY' 'RECEIVED')
     A            QTYIHB         5  0       COLHDG('QUANTITY' 'INVOICED')
     A            ACCTHB         5  0       COLHDG('ACCOUNT#')
     A            DCIDHB        10          COLHDG('DC#')
     A            CBMRHB         5  3       COLHDG('CBM' 'RATE')
     A            EMTDHB         7  0       COLHDG('EMPTY' 'DATE')
     A            ITM#HB        25          COLHDG('ITEM' 'NUMBER')
     A            VPRTHB        25          COLHDG('VENDOR' 'PART#')
     A            WRECHB         7  0       COLHDG('INTERNAL' 'W.REC#')
     A            NCBMHB         5  3       COLHDG('NEW CUBIC' 'MEASURMENT')
     A            CBMNHB         8  3       COLHDG('NEW CUBIC' 'MEASURMENT 2')
     A            CBMAHB         8  3       COLHDG('ASN CUBIC' 'MEASURMENT 2')
     A**********************************************************************
     A*           HDCR    -    HR      THD CONTAINER BILLING RATE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R HDCRFM
     A*
     A            ARECHR         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMHR         2          COLHDG('TERMINAL ID')
     A            CATGHR         2  0       COLHDG('RATE' 'CATEGORY')
     A            MINQHR         5  0       COLHDG('MIN' 'QTY')
     A            MAXQHR         5  0       COLHDG('MAX' 'QTY')
     A            RATCHR         8  4       COLHDG('CARTON' 'RATE')
     A            MDOLHR         7  2       COLHDG('MINIMUM' 'CHARGE')
     A            TIERHR        20          COLHDG('TIER' 'DESCRIPTION')
     A**********************************************************************
     A*           HDCW    -    HB      THD CONTAINER SUMMARY WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R HDCWFM
     A*
     A            ARECHW         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMHW         2          COLHDG('TERMINAL ID')
     A            EMTDHW         7  0       COLHDG('EMPTY DATE')
     A            CONTHW        19          COLHDG('CONTAINER')
     A            CBMTHW         8  3       COLHDG('TOTAL' 'CBM')
     A            QTYTHW         7  0       COLHDG('QUANTITY' 'TOTAL')
     A            CATGHW         2  0       COLHDG('RATE' 'CATEGORY')
     A            RATCHW         8  4       COLHDG('CARTON' 'RATE')
     A            DOLLHW         7  2       COLHDG('DOLLAR' ' AMOUNT')
     A            TIERHW        20          COLHDG('TIER' 'DESCRIPTION')
     A            SRCGHW         8  4       COLHDG('SURCHARGE' 'RATE')
     A            SAMTHW         7  2       COLHDG('SURGCHARGE' ' AMOUNT')
     A**********************************************************************
     A*           HDSP    -    HS      THD CONTAINER BILLING SPLITS FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R HDSPFM
     A*
     A            ARECHS         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMHS         2          COLHDG('TERMINAL ID')
     A            CATGHS         2  0       COLHDG('RATE' 'CATEGORY')
     A            MINQHS         5  0       COLHDG('MIN' 'QTY')
     A            MAXQHS         5  0       COLHDG('MAX' 'QTY')
     A            SURCHS         8  4       COLHDG('SURCHARGE' '/CBM')
     A**********************************************************************
     A**********************************************************************
     A*           HDVO    -    VO      THD CONTAINER BILLING VOUCHER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00100
     A*         R HDVOFM
     A*
     A            TERM#VO        2          COLHDG('TERMINAL ID#')
     A            UPKEYVO        1          COLHDG('UPKEY')
     A            HUSDCVO        5          COLHDG('H USD CODE')
     A            HCOCOVO        4  0       COLHDG('H COMPANY' 'CODE')
     A            HIDATVO        6          COLHDG('H INVOICE DATE')
     A            HPDATVO        6          COLHDG('H POST DATE')
     A            HINV#VO        7  0       COLHDG('H INVOICE' 'NUMBER')
     A            HINVTVO        2          COLHDG('H INVOICE' 'TYPE')
     A            HDESCVO       15          COLHDG('H G/L DESCRIPTION')
     A            VSAP#VO        7  0       COLHDG('V SAP#')
     A            VINVAVO       10  2       COLHDG('V INVOICE' 'AMOUNT')
     A            VDUEDVO        6          COLHDG('V DUE DATE')
     A            GLACCVO        7  0       COLHDG('G G/L ACCOUNT#')
     A            GPOAMVO       10  2       COLHDG('G PO AMOUNT')
     A            GPROFVO       12  0       COLHDG('G PROFIT CENTER')
     A            GPOWKVO       10  0       COLHDG('G PO# VAR' 'YYYYWW FIXED')
     A            GDESCVO       15          COLHDG('G COST' 'DESCRIPTION')
     A            TTOTLVO        7          COLHDG('T TOTAL')
     A            TTAMTVO       10  2       COLHDG('T TOTAL' 'AMOUNT')
     A            USRC1VO       12          COLHDG('USER ALPHA' 'FIELD 1')
     A            USRC2VO       12          COLHDG('USER ALPHA' 'FIELD 2')
     A**********************************************************************
     A*           MLOG    -    LG      MANIFEST LOG FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R MLOGFM
     A*
     A            ARECLG         1          COLHDG('ACTIVE' 'RECORD')
     A            WMANLG         7  0       COLHDG('WALSH MANIFEST #')
     A            STA1LG         1          COLHDG('STATUS - PRINTED')
     A            PGMNLG        10          COLHDG('PROGRAM ID')
     A**********************************************************************
     A*           WKOB    -    W8      WORKFILE FOR O/B TRAILERS.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00010
     A*         R WKOBFM
     A*
     A            ARECW8         1          COLHDG('ACTIVE' 'RECORD')
     A            BLDGW8         3          COLHDG('LOC/ BLDG')
     A            TRALW8        11          COLHDG('TRAILER #')
     A            STATW8         1          COLHDG('STATUS')
     A            OCARW8        15          COLHDG('O/B/ CARRIER')
     A            WMANW8         7  0       COLHDG('WALSH MANIFEST #')
     A            MDATW8          L         COLHDG('MANIFEST' 'DATE')
     A                                      DFT('0001-01-01')
     A**********************************************************************
     A*           USER    -    U       USER FOR OUTQ
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00010
     A*         R USERFM
     A*
     A            USERNU        10          COLHDG('USER' 'NAME')
     A            ROUTQU        10          COLHDG('RECEIPT')
     A            MOUTQU        10          COLHDG('MANIFEST')
     A            BOUTQU        10          COLHDG('BOL')
     A            VOUTQU        10          COLHDG('VUR')
     A*
     A**********************************************************************
     A*           ACSX    -    AZ      ACADEMY SPORTS X-REF FILE FOR DC.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000050 00010
     A*         R ACSXFM
     A*
     A            ARECAZ         1          COLHDG('ACTIVE' 'RECORD')
     A            DCIDAZ         7          COLHDG('SHIP TO/ DC')
     A            ACCTAZ         5  0       COLHDG('ACCOUNT' '#')
     A*
     A*
     A**********************************************************************
     A*           CVSX    -    CZ      CVS X-REF FILE FOR DC.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000050 00010
     A*         R CVSXFM
     A*
     A            ARECCZ         1          COLHDG('ACTIVE' 'RECORD')
     A            DCIDCZ        10          COLHDG('SHIP TO/ DC')
     A            ACCTCZ         5  0       COLHDG('ACCOUNT' '#')
     A*
     A**********************************************************************
     A*           CVSW    -    CL      CVS BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CVSWFM
     A*
     A            ARECCL         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMCL         2          COLHDG('TERMINAL ID')
     A            EXCOCL         3          COLHDG('COMPANY')
     A            EXKNCL         9  0       COLHDG('KEY' 'INDEX')
     A            EXKSCL         9  0       COLHDG('KEY' 'SEQUENCE')
     A            EXTPCL        15          COLHDG('TRADING' 'PARTNER')
     A            EXSHCL        25          COLHDG('SHIPMENT' 'ID')
     A            CONTCL        11          COLHDG('CONTAINER')
     A            PO##CL        22          COLHDG('PURCHASE' 'ORDER')
     A            CBM#CL         5  3       COLHDG('CUBIC' 'MEASURMENT')
     A            QTYRCL         5  0       COLHDG('QUANTITY' 'RECEIVED')
     A            WGTRCL         5  0       COLHDG('WEIGHT' 'RECEIVED')
     A            ACCTCL         5  0       COLHDG('ACCOUNT#')
     A            DCIDCL        10          COLHDG('DC#')
     A            CBMRCL         5  3       COLHDG('CBM' 'RATE')
     A            EMTDCL         7  0       COLHDG('EMPTY' 'DATE')
     A            ITM#CL        20          COLHDG('ITEM' 'NUMBER')
     A            VPRTCL        48          COLHDG('VENDOR' 'PART#')
     A            MSDCCL         8  0       COLHDG('MSD' 'CODE')
     A            WRECCL         7  0       COLHDG('INTERNAL' 'W.REC#')
     A            PICDCL          L         COLHDG('PICKUP' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            NYKPCL         7  0       COLHDG('NYK PRO#')
     A            VESSCL        28          COLHDG('VESSEL')
     A            VOYACL        10          COLHDG('VOYAGE')
     A            MANFCL         7  0       COLHDG('CUSTOMER' 'MANIFEST')
     A            OBTRCL         8          COLHDG('OUTBOUND' 'TRAILER')
     A*
     A**********************************************************************
     A*           CVRT    -    VR      CVS BILLING RATE TABLE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R CVRTFM
     A*
     A            TERMVR         2          COLHDG('TERMINAL ID')
     A            MINQVR         5  0       COLHDG('MIN' 'QTY')
     A            MAXQVR         5  0       COLHDG('MAX' 'QTY')
     A            RATCVR         8  4       COLHDG('CBM' 'RATE')
     A**********************************************************************
     A*           CVRF    -    VF      CVS CONTAINER SUMMARY RATE WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CVRFFM
     A*
     A            TERMVF         2          COLHDG('TERMINAL ID')
     A            EMTDVF         7  0       COLHDG('EMPTY DATE')
     A            CONTVF        11          COLHDG('CONTAINER')
     A            QTYTVF         7  0       COLHDG('QUANTITY' 'TOTAL')
     A            RATCVF         8  4       COLHDG('CBM' 'RATE')
     A*
     A**********************************************************************
     A*           TMSC    -    TL      TJ MAXX MARSHALLS SCAN FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 005000 00010
     A*         R TMSCFM
     A*
     A            LOCATL         3          COLHDG('LOCATION' 'ID')
     A            TRALTL        11          COLHDG('I/B TRAILER')
     A            SCACTL         4          COLHDG('I/B SCAC')
     A            DATETL          L         COLHDG('I/B SCAN' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIMETL          T         COLHDG('I/B' 'SCAN TIME')
     A                                      DFT('00.00.00')
     A            EXPQTL         7  0       COLHDG('EXPECTED' 'QTY')
     A            ACTQTL         7  0       COLHDG('ACTUAL' 'QTY')
     A            MRTQTL         7  0       COLHDG('MIS-ROUTE' 'QTY')
     A            DMGQTL         7  0       COLHDG('DAMAGED CTN' 'QTY')
     A            STATTL         1          COLHDG('STATUS')
     A            TTYPTL         1          COLHDG('TRAILER' 'TYPE')
     A*                                       T = TJMAXX
     A*                                       M = MARSHALLS
     A*                                       B = BOTH
     A            FLOCTL         6          COLHDG('FROM' 'LOCATION')
     A            YDATTL          L         COLHDG('I/B YARD' 'DATE')
     A                                      DFT('0001-01-01')
     A            YTIMTL          T         COLHDG('I/B YARD' 'TIME')
     A                                      DFT('00.00.00')
     A*
     A**********************************************************************
     A*           TMSD    -    TA      TJ MAXX MARSHALLS DOOR LABEL MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R TMSDFM
     A*
     A            LOCATA         3          COLHDG('LOCATION' 'ID')
     A            DLBLTA        10          COLHDG('DOOR' 'LABEL')
     A            TRALTA        11          COLHDG('O/B TRAILER')
     A            LDATTA          L         COLHDG('START LOAD' 'DATE')
     A                                      DFT('0001-01-01')
     A            LTMETA          T         COLHDG('START LOAD' 'TIME')
     A                                      DFT('00.00.00')
     A            TTYPTA         1          COLHDG('TRAILER' 'TYPE')
     A*                                       T = TJMAXX
     A*                                       M = MARSHALLS
     A*                                       B = BOTH
     A            RUN#TA         4          COLHDG('RUN#')
     A            STATTA         1          COLHDG('STATUS')
     A*                                       O = OPEN AT DOOR
     A*                                       M = CLOSED MANIFESTED
     A            MDATTA          L         COLHDG('MANIFEST' 'DATE')
     A                                      DFT('0001-01-01')
     A            MTMETA          T         COLHDG('MANIFEST' 'TIME')
     A                                      DFT('00.00.00')
     A            STI1TA         1          COLHDG('STORE #1' 'ID')
     A            ST#1TA         5  0       COLHDG('STORE #1')
     A            STQ1TA         2  0       COLHDG('STORE #1' 'PALLET QTY')
     A            STI2TA         1          COLHDG('STORE #2' 'ID')
     A            ST#2TA         5  0       COLHDG('STORE #2')
     A            STQ2TA         2  0       COLHDG('STORE #2' 'PALLET QTY')
     A            STI3TA         1          COLHDG('STORE #3' 'ID')
     A            ST#3TA         5  0       COLHDG('STORE #3')
     A            STQ3TA         2  0       COLHDG('STORE #3' 'PALLET QTY')
     A            STI4TA         1          COLHDG('STORE #4' 'ID')
     A            ST#4TA         5  0       COLHDG('STORE #4')
     A            STQ4TA         2  0       COLHDG('STORE #4' 'PALLET QTY')
     A            STI5TA         1          COLHDG('STORE #5' 'ID')
     A            ST#5TA         5  0       COLHDG('STORE #5')
     A            STQ5TA         2  0       COLHDG('STORE #5' 'PALLET QTY')
     A            STI6TA         1          COLHDG('STORE #6' 'ID')
     A            ST#6TA         5  0       COLHDG('STORE #6')
     A            STQ6TA         2  0       COLHDG('STORE #6' 'PALLET QTY')
     A            STI7TA         1          COLHDG('STORE #7' 'ID')
     A            ST#7TA         5  0       COLHDG('STORE #7')
     A            STQ7TA         2  0       COLHDG('STORE #7' 'PALLET QTY')
     A            STI8TA         1          COLHDG('STORE #8' 'ID')
     A            ST#8TA         5  0       COLHDG('STORE #8')
     A            STQ8TA         2  0       COLHDG('STORE #8' 'PALLET QTY')
     A            STI9TA         1          COLHDG('STORE #9' 'ID')
     A            ST#9TA         5  0       COLHDG('STORE #9')
     A            STQ9TA         2  0       COLHDG('STORE #9' 'PALLET QTY')
     A            STIATA         1          COLHDG('STORE #10' 'ID')
     A            ST#ATA         5  0       COLHDG('STORE #10')
     A            STQATA         2  0       COLHDG('STORE #10' 'PALLET QTY')
     A            PLANTA         6  0       COLHDG('PLAN' 'ID #')
     A*
     A**********************************************************************
     A*           TMSE    -    TE      TJ MAXX MARSHALLS RUN# STORE MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R TMSEFM
     A*
     A            LOCATE         3          COLHDG('LOCATION' 'ID')
     A            RUN#TE         4          COLHDG('RUN#')
     A            SEQ#TE         4  0       COLHDG('SEQUENCE #')
     A            STIDTE         1          COLHDG('STORE' 'ID')
     A            STORTE         5  0       COLHDG('STORE #')
     A*
     A**********************************************************************
     A*           TMSF    -    TF      TJ MAXX MARSHALLS DETAIL SCAN FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 005000 00010
     A*         R TMSFFM
     A*
     A            LOCATF         3          COLHDG('LOCATION' 'ID')
     A            TRALTF        11          COLHDG('I/B TRAILER')
     A            SCACTF         4          COLHDG('I/B SCAC')
     A            DATETF          L         COLHDG('I/B SCAN' 'DATE')
     A                                      DFT('0001-01-01')
     A            STIDTF         1          COLHDG('STORE' 'ID')
     A            STORTF         5  0       COLHDG('STORE #')
     A            ACTQTF         7  0       COLHDG('ACTUAL' 'QTY')
     A            MRTQTF         7  0       COLHDG('MIS-ROUTE' 'QTY')
     A            DMGQTF         7  0       COLHDG('DAMAGED CTN' 'QTY')
     A*
     A**********************************************************************
     A*           TMSH    -    TH      TJ MAXX MARSHALLS PLAN HEADER FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 005000 00010
     A*         R TMSHFM
     A*
     A            LOCTTH         3          COLHDG('LOCATION' 'ID')
     A            PLANTH         6S 0       COLHDG('PLAN ID')
     A            PLNTTH        50          COLHDG('PLAN NOTES')
     A            DATETH          L         COLHDG('PLAN DATE')
     A                                      DFT('0001-01-01')
     A            TIMETH          T         COLHDG('P[L[AN TIME')
     A            TYPETH         1A         TEXT('P=PLANNED M=MANUAL')
     A            STATTH         1A         TEXT('S=SHIPPED A=ACTIVE " "=OPEN')
     A*
     A**********************************************************************
     A*           TMSL    -    TG      TJX STAGING LOCATION MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R TMSLFM
     A*
     A            LOCATG         3          COLHDG('FACILITY' 'LOCATION')
     A            SLOCTG         6          COLHDG('STAGING' 'LOCATION')
     A            STIDTG         1          COLHDG('STORE' 'ID')
     A            STORTG         5  0       COLHDG('STORE #')
     A*
     A**********************************************************************
     A*           TMST    -    TS      TJ MAXX MARSHALLS STORE FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R TMSTFM
     A*
     A            ARECTS         1          COLHDG('ACTIVE' 'CODE')
     A            STORTS         5  0       COLHDG('STORE #')
     A            NAMETS        25          COLHDG('STORE' 'NAME')
     A            ADDRTS        25          COLHDG('ADDRESS')
     A            CITYTS        15          COLHDG('CITY')
     A            STATTS         2          COLHDG('STATE')
     A            ZIPCTS         5  0       COLHDG('ZIP' 'CODE')
     A            STYPTS         1          COLHDG('STORE' 'TYPE')
     A*                                       T = TJMAXX
     A*                                       M = MARSHALLS
     A*                                       B = BOTH
     A            RUN#TS         3          COLHDG('STORE' 'RUN#')
     A            CAP#TS         2          COLHDG('STORE' 'CAP#')
     A*
     A**********************************************************************
     A*           TMSR    -    TH      TJ MAXX MARSHALLS PLAN EXTRA RUNS.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 005000 00010
     A*         R TMSRFM
     A*
     A            LOCTTR         3          COLHDG('LOCATION' 'ID')
     A            PLANTR         6S 0       COLHDG('PLAN ID')
     A            RUN#TR         4          COLHDG('RUN#')
     A            RUNSTR         1          COLHDG('RUN SPLIT')
     A            SEQ#TR         4  0       COLHDG('SEQUENCE #')
     A            STIDTR         1          COLHDG('STORE' 'ID')
     A            STORTR         5  0       COLHDG('STORE #')
     A*
     A**********************************************************************
     A*           TMSS    -    TT      TJ MAXX MARSHALLS STORE FILE VERS 2.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R TMSSFM
     A*
     A            ARECTT         1          COLHDG('ACTIVE' 'CODE')
     A            STIDTT         1          COLHDG('STORE' 'ID')
     A*                                       T = TJMAXX
     A*                                       M = MARSHALLS
     A            STORTT         5  0       COLHDG('STORE #')
     A            NAMETT        25          COLHDG('STORE' 'NAME')
     A            ADDRTT        25          COLHDG('ADDRESS')
     A            CITYTT        15          COLHDG('CITY')
     A            STATTT         2          COLHDG('STATE')
     A            ZIPCTT         5  0       COLHDG('ZIP' 'CODE')
     A            TODNTT         1          COLHDG('TIME OF' 'DAY NO.')
     A*                                       1 = A.M.
     A*                                       2 = MID-DAY
     A*                                       3 = AFTERNOON
     A* RESTRICTIONS -
     A            TTYPTT         2          COLHDG('TRAILER' 'TYPE')
     A*                                       = NONE, PP=PUP, ST=STR
     A            LIFTTT         1          COLHDG('LIFT GATE (Y/ )')
     A*
     A            MXPLTT         2S 0       COLHDG('MAX' 'PALLETS')
     A            HGTHTT         4A         COLHDG('HEIGT' 'LIMIT')
     A**********************************************************************
     A*           TMSP    -    TQ      TJ MAXX MARSHALS PALLET SCAN FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R TMSPFM
     A*
     A            LOCATQ         3          COLHDG('LOCATION' 'ID')
     A            PALLTQ        10          COLHDG('PALET ID')
     A            STORTQ         5  0       COLHDG('STORE #')
     A            PLIDTQ          L         COLHDG('PALLET IN' 'DATE')
     A                                      DFT('0001-01-01')
     A            PLITTQ          T         COLHDG('PALLET IN' 'TIME')
     A                                      DFT('00.00.00')
     A            PLODTQ          L         COLHDG('PALLET OUT' 'DATE')
     A                                      DFT('0001-01-01')
     A            PLOTTQ          T         COLHDG('PALLET OUT' 'TIME')
     A                                      DFT('00.00.00')
     A            STATTQ         1          COLHDG('STATUS')
     A            PLANTQ         6  0       COLHDG('PLAN' 'ID #')
     A            PSTSTQ         1          COLHDG('PLAN' 'STATUS')
     A            SPLITQ         1          COLHDG('SPLIT RUN')
     A            STIDTQ         1          COLHDG('STORE ID')
     A            PLOBTQ         6  0       COLHDG('OB PLAN' 'ID #')
     A            PSOBTQ         1          COLHDG('OB PLAN' 'STATUS')
     A            NONCTQ         1          COLHDG('NONCON' 'FLAG')
     A            OBUSRQ        10          COLHDG('OUTBOUND' 'USERID')
     A            IBUSRQ        10          COLHDG('INBOUND' 'USERID')
     A            LOADTQ         8          COLHDG('LOAD SHEET')
     A            LDDTTQ          L         COLHDG('LOAD SHEET DATE')
     A*
     A**********************************************************************
     A*           TMSW    -    TW      TJ MAXX MARSHALS PALLET SCAN FILE.V2
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R TMSWFM
     A*
     A            LOCATW         3          COLHDG('LOCATION' 'ID')
     A            PALLTW        10          COLHDG('PALLET ID')
     A            STORTW         5  0       COLHDG('STORE #')
     A            STIDTW         1          COLHDG('STORE ID')
     A            PLIDTW          L         COLHDG('PALLET' 'CREATE DATE')
     A                                      DFT('0001-01-01')
     A            PLITTW          T         COLHDG('PALLET' 'CREATE TIME')
     A                                      DFT('00.00.00')
     A            PSGDTW          L         COLHDG('PALLET' 'STAGING DATE')
     A                                      DFT('0001-01-01')
     A            PSGTTW          T         COLHDG('PALLET' 'STAGING TIME')
     A                                      DFT('00.00.00')
     A            PLODTW          L         COLHDG('PALLET OUT' 'DATE')
     A                                      DFT('0001-01-01')
     A            PLOTTW          T         COLHDG('PALLET OUT' 'TIME')
     A                                      DFT('00.00.00')
     A            STATTW         1          COLHDG('STATUS')
     A            TRALTW        11          COLHDG('O/B TRAILER')
     A            PLANTW         6  0       COLHDG('PLAN' 'ID #')
     A            PSTSTW         1          COLHDG('PLAN' 'STATUS')
     A            PLOCTW         6          COLHDG('STAGE' 'LOCATION')
     A            SPLITW         1          COLHDG('SPLIT RUN')
     A*
     A**********************************************************************
     A*           TMSO    -    TO      TJ MARSHALLS SCANNING ORIGIN MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R TMSOFM
     A*
     A            ACTRTO         1          COLHDG('ACTIVE' 'RECORD CODE')
     A            FLOCTO         6          COLHDG('FROM LOCATION' 'CODE')
     A            NAMETO        25          COLHDG('LOCATION' 'NAME')
     A            ADDRTO        25          COLHDG('ADDRESS')
     A            CITYTO        15          COLHDG('CITY')
     A            STATTO         2          COLHDG('STATE')
     A            ZIPCTO         5  0       COLHDG('ZIP' 'CODE')
     A            STIDTO         1          COLHDG('STORE I.D.' '(T/M)')
     A*                                       T = TJMAXX
     A*                                       M = MARSHALLS
     A*                                       B = BOTH
     A*
     A**********************************************************************
     A*           TMSU    -    TU      TJ MAXX MARSHALS USER FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R TMSUFM
     A*
     A            USERTU        10          COLHDG('USER' 'ID')
     A            NAMETU        25          COLHDG('USER' 'NAME')
     A            LOCTTU         3          COLHDG('LOCATION' 'CODE')
     A            SACTTU         2          COLHDG('SCAN GUN' 'ACTIVE')
     A            TRALTU        11          COLHDG('TRAILER' 'SCAN')
     A*
     A*
     A**********************************************************************
     A*           DSWS    -    DW      DSW PALLET SCAN FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R DSWSFM
     A*
     A            LOCADW         3          COLHDG('LOCATION' 'ID')
     A            USERDW        10          COLHDG('USER' 'ID')
     A            PALLDW        10          COLHDG('PALET ID')
     A            PO##DW        10          COLHDG('PO#')
     A            QTYEDW         5  0       COLHDG('QTY ENTERED')
     A            QTYPDW         5  0       COLHDG('PO QTY')
     A            PBLDDW          L         COLHDG('BUILD PALLET' 'DATE')
     A                                      DFT('0001-01-01')
     A            PBLTDW          T         COLHDG('BUILD PALLET' 'TIME')
     A                                      DFT('00.00.00')
     A            WRECDW         7  0       COLHDG('WALSH' 'RECEIPT#')
     A            WMANDW         7  0       COLHDG('WALSH' 'MANIFEST#')
     A            OTRLDW        11          COLHDG('O/B TRAILER')
     A            ODORDW         4  0       COLHDG('O/B DOOR')
     A            PLODDW          L         COLHDG('PALLET LOAD' 'DATE')
     A                                      DFT('0001-01-01')
     A            PLOTDW          T         COLHDG('PALLET LOAD' 'TIME')
     A                                      DFT('00.00.00')
     A            TSTSDW         1          COLHDG('O/B TRAL' 'STATUS')
     A            ACCTDW         5  0       COLHDG('CUSTOMER #')
     A            OBUSDW        10          COLHDG('O/B SCAN' 'USER ID')
     A*
     A**********************************************************************
     A*           DSWU    -    DU      DSW USER FILE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000500 00010
     A*         R DSWUFM
     A*
     A            USERDU        10          COLHDG('USER' 'ID')
     A            NAMEDU        25          COLHDG('USER' 'NAME')
     A            LOCTDU         3          COLHDG('LOCATION' 'CODE')
     A*
     A**********************************************************************
     A*           TGED      -                TARGET EDI 214 PU DATE (AF)
     A*                                       SENT TO TARGET IN ADV 214 FOR
     A*                                        TARGET ADVANCE (SCAC NLRT)
     A*                                        ADDED TO IN PGM
     A*                                          TG214ADTL, TG214ADLTL
     A*                                       -- TO BE USED IN THE
     A*                                            PGM TG214CDLH FOR 214
     A*                                            WHERE WE SEND THE PU DATE TOO
     A*                                        OR EDI 214 PU DATE FROM THE
     A*                                            TG214CDLH TO PUT IN THE
     A*                                           EDI FROM TG214ADTL, TG214ADLTL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00003
     A*         R TGEDFM
     A*
     A            ACRETG         6          COLHDG('ACTIVE')
     A            INPRTG         8  0       COLHDG('ADV.PRO' '/MANF#')
     A*                                       ADVANCE PRO ON RECEIPT
     A*                                        WHEN DOING ADVANCE PRO
     A*                                       OR MANF#M FROM MANF FILE
     A*                                       WHEN DO LINEHAUL OUTBD TRL
     A            S214TG         2          COLHDG('EDI214' 'STATUS')
     A            STOPTG         3  0       COLHDG('STOP' 'SEQ#')
     A            SHPNTG        35          COLHDG('SHIPPER' 'NAME')
     A*                                         AS IN RECH
     A            SHPZTG         5  0       COLHDG('SHIPPER' 'ZIP' )
     A*                                         AS IN RECH
     A            DATPTG         8  0       COLHDG('PU DATE' '214')
     A            TIMPTG         8  0       COLHDG('PU TIME' '214')
     A            BYPGTG        10          COLHDG('WRITTEN BY' 'PGM')
     A            CRTDTG          L         COLHDG('CREATION DATE')
     A            CRTMTG          T         COLHDG('CREATION TIME')
     A*
     A**********************************************************************
     A*           TKSX    -    TK      TRACTOR SUPPLY X-REF FILE FOR DC.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000050 00010
     A*         R TKSXFM
     A*
     A            ARECTK         1          COLHDG('ACTIVE' 'RECORD')
     A            DCIDTK        10          COLHDG('SHIP TO/ DC')
     A            ACCTTK         5  0       COLHDG('ACCOUNT' '#')
     A*
     A**********************************************************************
     A*           TKSW    -    T3      TRS BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R TKSWFM
     A*
     A            ARECT3         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMT3         2          COLHDG('TERMINAL ID')
     A            EXCOT3         3          COLHDG('COMPANY')
     A            EXKNT3         9  0       COLHDG('KEY' 'INDEX')
     A            EXKST3         9  0       COLHDG('KEY' 'SEQUENCE')
     A            EXTPT3        15          COLHDG('TRADING' 'PARTNER')
     A            EXSHT3        25          COLHDG('SHIPMENT' 'ID')
     A            CONTT3        11          COLHDG('CONTAINER')
     A            PO##T3        22          COLHDG('PURCHASE' 'ORDER')
     A            CBM#T3         5  3       COLHDG('CUBIC' 'MEASURMENT')
     A            QTYRT3         5  0       COLHDG('QUANTITY' 'RECEIVED')
     A            WGTRT3         5  0       COLHDG('WEIGHT' 'RECEIVED')
     A            ACCTT3         5  0       COLHDG('ACCOUNT#')
     A            DCIDT3        10          COLHDG('DC#')
     A            CBMRT3         5  3       COLHDG('CBM' 'RATE')
     A            EMTDT3         7  0       COLHDG('EMPTY' 'DATE')
     A            ITM#T3        20          COLHDG('ITEM' 'NUMBER')
     A            VPRTT3        48          COLHDG('VENDOR' 'PART#')
     A            MSDCT3         8  0       COLHDG('MSD' 'CODE')
     A            WRECT3         7  0       COLHDG('INTERNAL' 'W.REC#')
     A            PICDT3          L         COLHDG('PICKUP' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            NYKPT3         7  0       COLHDG('NYK PRO#')
     A            VESST3        28          COLHDG('VESSEL')
     A            VOYAT3        10          COLHDG('VOYAGE')
     A            MANFT3         7  0       COLHDG('CUSTOMER' 'MANIFEST')
     A            OBTRT3         8          COLHDG('OUTBOUND' 'TRAILER')
     A*
     A**********************************************************************
     A*           TKSR    -    T2      TRS BILLING RATE TABLE.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000500 00010
     A*         R TKSRFM
     A*
     A            TERMT2         2          COLHDG('TERMINAL ID')
     A            MINQT2         5  0       COLHDG('MIN' 'QTY')
     A            MAXQT2         5  0       COLHDG('MAX' 'QTY')
     A            RATCT2         8  4       COLHDG('CBM' 'RATE')
     A**********************************************************************
     A*           TKSF    -    T1      TRS CONTAINER SUMMARY RATE WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R TKSFFM
     A*
     A            TERMT1         2          COLHDG('TERMINAL ID')
     A            EMTDT1         7  0       COLHDG('EMPTY DATE')
     A            CONTT1        11          COLHDG('CONTAINER')
     A            QTYTT1         7  0       COLHDG('QUANTITY' 'TOTAL')
     A            RATCT1         8  4       COLHDG('CBM' 'RATE')
     A            PICDT1          L         COLHDG('PICK-UP' 'DATE')
     A                                      DFT('0001-01-01')
     A            CAMTT1         7  2       COLHDG('CONTAINER' 'AMOUNT')
     A            TCBMT1        10  4       COLHDG('TOTAL CBM')
     A            WGTTT1         7  0       COLHDG('WEIGHT' 'TOTAL')
     A*
     A**********************************************************************
     A*           CBCK    -            CONTROLS CREATED AFTER WARDS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CBCKFM
     A*
     A            ACTN##         1          COLHDG('ACTION: ADD/UPDATE')
     A            TERMT#         2          COLHDG('TERMINAL ID')
     A            JULDT#         5  0       COLHDG('JULIAN DATE')
     A            TIMEC#         4  0       COLHDG('TIME')
     A            CONT##         3  0       COLHDG('CONTROL NUMBER')
     A            BLDG##         1          COLHDG('BUILDING')
     A            XDATE#         8  0       COLHDG('ACTION DATE')
     A            XTIME#         4  0       COLHDG('ACTION TIME')
     A*
     A*
     A**********************************************************************
     A*           MDLW    -    MD      MEDLINE BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R MDLWFM
     A*
     A            ARECMD         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMMD         2          COLHDG('TERMINAL ID')
     A            EXCOMD         3          COLHDG('COMPANY')
     A            EXKNMD         9  0       COLHDG('KEY' 'INDEX')
     A            EXKSMD         9  0       COLHDG('KEY' 'SEQUENCE')
     A            EXTPMD        15          COLHDG('TRADING' 'PARTNER')
     A            EXSHMD        25          COLHDG('SHIPMENT' 'ID')
     A            CONTMD        11          COLHDG('CONTAINER')
     A            PO##MD        22          COLHDG('PURCHASE' 'ORDER')
     A            CBM#MD         5  3       COLHDG('CUBIC' 'MEASURMENT')
     A            QTYRMD         5  0       COLHDG('QUANTITY' 'RECEIVED')
     A            WGTRMD         5  0       COLHDG('WEIGHT' 'RECEIVED')
     A            ACCTMD         5  0       COLHDG('ACCOUNT#')
     A            DCIDMD        10          COLHDG('DC#')
     A            CBMRMD         5  3       COLHDG('CBM' 'RATE')
     A            EMTDMD         7  0       COLHDG('EMPTY' 'DATE')
     A            ITM#MD        20          COLHDG('ITEM' 'NUMBER')
     A            VPRTMD        48          COLHDG('VENDOR' 'PART#')
     A            MSDCMD         8  0       COLHDG('MSD' 'CODE')
     A            WRECMD         7  0       COLHDG('INTERNAL' 'W.REC#')
     A            PICDMD          L         COLHDG('PICKUP' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            NYKPMD         7  0       COLHDG('NYK PRO#')
     A            VESSMD        28          COLHDG('VESSEL')
     A            VOYAMD        10          COLHDG('VOYAGE')
     A            MANFMD         7  0       COLHDG('CUSTOMER' 'MANIFEST')
     A            OBTRMD         8          COLHDG('OUTBOUND' 'TRAILER')
     A*
     A*
     A**********************************************************************
     A*           HDXC    -    XC      THD BILLING EXCEL WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R HDXCFM
     A*
     A            FRWKXC         6  0       COLHDG('FW')
     A            MTDTXC        10          COLHDG('Date Worked')
     A            INVTXC        20          COLHDG('Invoice Type')
     A            SDESXC        25          COLHDG('Short Description')
     A            INV#XC         7  0       COLHDG('Invoice')
     A            TL##XC         4          COLHDG('Transload')
     A            PO10XC        12          COLHDG('PO')
     A            CT11XC        19          COLHDG('Equipment')
     A            BOL#XC        20          COLHDG('BOL')
     A            QTYAXC        10  2       COLHDG('IB CBM')
     A            CTACXC         8  0       COLHDG('Cartons')
     A            RECPXC         8  0       COLHDG('Splits')
     A            CATGXC         2  0       COLHDG('Tier')
     A            RATEXC         8  4       COLHDG('CBM Rate')
     A            SCRGXC         8  4       COLHDG('Surcharge Rate')
     A            TOTRXC         8  4       COLHDG('Total Rate')
     A            TOTAXC        10  2       COLHDG('Total')
     A*
     A*
     A**********************************************************************
     A*           ACPW    -    A1      ACADEMY SPORTS BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R ACPWFM
     A*
     A            ARECA1         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMA1         2          COLHDG('TERMINAL ID')
     A            CONTA1        11          COLHDG('CONTAINER')
     A            PO##A1        22          COLHDG('PURCHASE' 'ORDER')
     A            CBM#A1         5  3       COLHDG('CUBIC' 'MEASURMENT')
     A            QTYRA1         5  0       COLHDG('QUANTITY' 'RECEIVED')
     A            WGTRA1         5  0       COLHDG('WEIGHT' 'RECEIVED')
     A            ACCTA1         5  0       COLHDG('ACCOUNT#')
     A            DCIDA1        10          COLHDG('DC#')
     A            CBMRA1         5  3       COLHDG('CBM' 'RATE')
     A            EMTDA1         7  0       COLHDG('EMPTY' 'DATE')
     A            ITM#A1        20          COLHDG('ITEM' 'NUMBER')
     A            WRECA1         7  0       COLHDG('INTERNAL' 'W.REC#')
     A            PICDA1          L         COLHDG('PICKUP' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            VESSA1        28          COLHDG('VESSEL')
     A            VOYAA1        10          COLHDG('VOYAGE')
     A            MANFA1         7  0       COLHDG('CUSTOMER' 'MANIFEST')
     A            OBTRA1         8          COLHDG('OUTBOUND' 'TRAILER')
     A*
     A**********************************************************************
     A*           ACPF    -    A2          ACADEMY SPORTS BILLING SUMMARY WFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R ACPFFM
     A*
     A            TERMA2         2          COLHDG('TERMINAL ID')
     A            EMTDA2         7  0       COLHDG('EMPTY DATE')
     A            CONTA2        11          COLHDG('CONTAINER')
     A            QTYTA2         7  0       COLHDG('QUANTITY' 'TOTAL')
     A            RATCA2         8  4       COLHDG('CBM' 'RATE')
     A            PICDA2          L         COLHDG('PICK-UP' 'DATE')
     A                                      DFT('0001-01-01')
     A            CAMTA2         7  2       COLHDG('CONTAINER' 'AMOUNT')
     A            TCBMA2        10  4       COLHDG('TOTAL CBM')
     A            WGTTA2         7  0       COLHDG('WEIGHT' 'TOTAL')
     A*
     A*
     A*
     A**********************************************************************
     A*           HDXI    -    XI      THD I/B SCANNING EXCEL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R HDXIFM
     A*
     A            DATEXI          L         COLHDG('Audit' 'Date')
     A                                      DFT('0001-01-01')
     A            ANAMXI        25          COLHDG('Auditor' 'Name')
     A            DOCKXI         5          COLHDG('Dock #')
     A            OPSAXI        25          COLHDG('Ops' 'Associate')
     A            BOL#XI        20          COLHDG('BOL#')
     A            CONTXI        11          COLHDG('Container')
     A            CRTSXI         7  0       COLHDG('Cartons')
     A            SPLTXI         5  0       COLHDG('Splits')
     A            HDSDXI        10          COLHDG('THD' 'Sub Dept')
     A            APO#XI        22          COLHDG('AGGREGATE PO')
     A            SKU#XI        12          COLHDG('SKU')
     A            QTYAXI         7  0       COLHDG('Audit Count' 'Qty Each')
     A            CTNAXI         7  0       COLHDG('Audit Count' 'Ctn Qty')
     A            PAKAXI         7  0       COLHDG('Audit Count' 'Buy Pack')
     A            QTYOXI         7  0       COLHDG('Ops Count' 'Qty Each')
     A            CTNOXI         7  0       COLHDG('Ops Count' 'Ctn Qty')
     A            PAKOXI         7  0       COLHDG('Ops Count' 'BUY PACK')
     A            QTYSXI         7  0       COLHDG('ASN Count' 'Qty Each')
     A            CTNSXI         7  0       COLHDG('ASN Count' 'Ctn Qty')
     A            PAKSXI         7  0       COLHDG('ASN Count' 'Buy Pack')
     A            COMMXI        25          COLHDG('Comments')
     A            VARIXI         7  0       COLHDG('Variance' 'Each')
     A            ACCUXI         7  2       COLHDG('Accuracy' '%Each')
     A*
     A*
     A**********************************************************************
     A*           HDXO    -    XO      THD O/B SCANNING EXCEL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R HDXOFM
     A*
     A            DATEXO          L         COLHDG('Audit' 'Date')
     A                                      DFT('0001-01-01')
     A            ANAMXO        25          COLHDG('Auditor' 'Name')
     A            DOCKXO         5          COLHDG('Dock #')
     A            OPSAXO        25          COLHDG('Ops' 'Associate')
     A            BOL#XO        20          COLHDG('O/B BOL#')
     A            TRALXO        11          COLHDG('Trailer')
     A            DESTXO        10          COLHDG('Destination' 'DC')
     A            APO#XO        22          COLHDG('AGGREGATE PO')
     A            ALLPXO        30          COLHDG('ALLOCATION' 'PO')
     A            SKU#XO        12          COLHDG('SKU')
     A            QTYAXO         7  0       COLHDG('Audit Count' 'Qty Each')
     A            CTNAXO         7  0       COLHDG('Audit Count' 'Ctn Qty')
     A            PAKAXO         7  0       COLHDG('Audit Count' 'Buy Pack')
     A            QTYOXO         7  0       COLHDG('Ops Count' 'Qty Each')
     A            CTNOXO         7  0       COLHDG('Ops Count' 'Ctn Qty')
     A            PAKOXO         7  0       COLHDG('Ops Count' 'Buy Pack')
     A            QTYSXO         7  0       COLHDG('ASN Count' 'Qty Each')
     A            CTNSXO         7  0       COLHDG('ASN Count' 'Ctn Qty')
     A            PAKSXO         7  0       COLHDG('ASN Count' 'Buy Pack')
     A            COMMXO        25          COLHDG('Comments')
     A            VARIXO         7  0       COLHDG('Variance' 'Each')
     A            ACCUXO         7  2       COLHDG('Accuracy' '%Each')
     A*
     A*
     A**********************************************************************
     A*           HDDV    -    HD      THD CONTAINER DIVERSIONS FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R HDDVFM
     A*
     A            CONTHD        11          COLHDG('CONTAINER#')
     A            DATEHD          L         COLHDG('PROCESS' 'DATE')
     A                                      DFT('0001-01-01')
     A            FLD1HD        10          COLHDG('USER FIELD 1')
     A            FLD2HD        10  0       COLHDG('USER FIELD 2')
     A*
     A*
     A**********************************************************************
     A*           HDDU    -    HV      THD REVERSE DIVERTED CONTAINERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 000010 00010
     A*         R HDDUFM
     A*
     A            CONTHV        11          COLHDG('CONTAINER#')
     A            UNDTHV          L         COLHDG('UNDIVERTED' 'DATE')
     A                                      DFT('0001-01-01')
     A            DVDTHV          L         COLHDG('DIVERTED' 'DATE')
     A                                      DFT('0001-01-01')
     A            OEMTHV         7  0       COLHDG('ORIGINAL' 'MT DATE')
     A            MBOLHV        12          COLHDG('MANF' 'BOL#')
     A            JULDHV         5  0       COLHDG('CONTROL' 'JULIAN DATE')
     A            TERMHV         2          COLHDG('CONTROL' 'TERMINAL#')
     A*
     A*
     A**********************************************************************
     A*           HDXV    -    XV      THD BILLING EXCEL WORKFILE MAERSK
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R HDXVFM
     A*
     A            FRWKXV         3  0       COLHDG('FW')
     A            MTDTXV        10          COLHDG('Date Worked')
     A            INVTXV        20          COLHDG('Invoice Type')
     A            SDESXV        25          COLHDG('Short Description')
     A            INV#XV         7  0       COLHDG('Invoice')
     A            TL##XV         4          COLHDG('Transload')
     A            PO10XV        12          COLHDG('PO')
     A            CT11XV        19          COLHDG('Equipment')
     A            BOL#XV        20          COLHDG('BOL')
     A            QTYAXV        10  2       COLHDG('IB CBM')
     A            CTACXV         8  0       COLHDG('Cartons')
     A            RECPXV         8  0       COLHDG('Splits')
     A            CATGXV         2  0       COLHDG('Tier')
     A            RATEXV         8  4       COLHDG('CBM Rate')
     A            SCRGXV         8  4       COLHDG('Surcharge Rate')
     A            TOTRXV         8  4       COLHDG('Total Rate')
     A            TOTAXV        10  2       COLHDG('Total')
     A*
     A*
     A**********************************************************************
     A*           WKMK    -    WQ      THD MAERSK WORK FILE FOR MANF NO BOL#
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00010
     A*         R WKMKFM
     A*
     A            TRLRWQ         8          COLHDG('O/B TRAILER')
     A            BOL#WQ        12          COLHDG('SYSTEM' 'GENERATED BOL#')
     A            MMONWQ         2S 0       COLHDG('MANF MONTH')
     A            MDAYWQ         2S 0       COLHDG('MANF DAY')
     A            MYEAWQ         2S 0       COLHDG('MANF YEAR')
     A*
     A*
     A**********************************************************************
     A*           HDXW    -    XW      THD BILLING IMPORT FILE FOR 850 856
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R HDXWFM
     A*
     A            CONTXW        11          COLHDG('CONTAINER')
     A            TRANXW          L         COLHDG('TRANSACTION' 'DATE')
     A                                      DFT('0001-01-01')
     A            SEALXW        15          COLHDG('SEAL')
     A            AFLGXW         1          COLHDG('ASN' 'FLAG')
     A            PFLGXW         1          COLHDG('PO' 'FLAG')
     A*
     A**********************************************************************
     A*           TASD    -    TD      TARGET BUILDING S DOOR SCHEMA
     A*           TXHD    -    TD      TJX BUILDING H DOOR SCHEMA
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R TASDFM
     A*
     A            RSTSTD         1          COLHDG('BUILDING' 'CODE')
     A            OUTDTD         3  0       COLHDG('OUTBOUND' 'DOOR')
     A            DCIDTD         4          COLHDG('DC' 'ID')
     A            INBDTD         3  0       COLHDG('OPPOSITE' 'INB DOOR')
     A            USERTD        10          COLHDG('USER')
     A            DATETD          L         COLHDG('DATE') DFT('0001-01-01')
     A            TIMETD         4  0       COLHDG('TIME')
     A*
     A**********************************************************************
     A*           WKMT    -    WM      WORK FILE FOR MANIFEST REPORT GT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00010
     A*         R WKMTFM
     A*
     A            FAMGWM         2          COLHDG('FAMILY GROUP')
     A            FSGRWM         4          COLHDG('FAMILY SUB-GROUP')
     A            ACCTWM         5  0       COLHDG('ACCOUNT#')
     A            NAMEWM        25          COLHDG('ACCOUNT NAME')
     A            TCNTWM         7  0       COLHDG('TRAILER COUNT')
     A            CQTYWM         7  0       COLHDG('CARTON QTY')
     A            WGTTWM         7  0       COLHDG('WEIGHT')
     A            GOHTWM         7  0       COLHDG('GOH')
     A            MANDWM          L         COLHDG('MANIFEST' 'DATE')
     A                                      DFT('0001-01-01')
     A            WMANWM         7  0       COLHDG('WALSH MANIFEST #')
     A*
     A**********************************************************************
     A*           WKRC    -    WR      WORK FILE FOR RECEIPT REPORT GT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 000100 00010
     A*         R WKRCFM
     A*
     A            FAMGWR         2          COLHDG('FAMILY GROUP')
     A            FSGRWR         4          COLHDG('FAMILY SUB-GROUP')
     A            ACCTWR         5  0       COLHDG('ACCOUNT#')
     A            NAMEWR        25          COLHDG('ACCOUNT NAME')
     A            CQTYWR         7  0       COLHDG('COLL QTY')
     A            CWGTWR         8  0       COLHDG('COLL WGT')
     A            CGOHWR         7  0       COLHDG('COLL GOH')
     A            PQTYWR         7  0       COLHDG('PPD QTY')
     A            PWGTWR         8  0       COLHDG('PPD WGT')
     A            PGOHWR         7  0       COLHDG('PPD GOH')
     A            IQTYWR         7  0       COLHDG('IMP QTY')
     A            IWGTWR         8  0       COLHDG('IMP WGT')
     A            IGOHWR         7  0       COLHDG('IMP GOH')
     A            OQTYWR         7  0       COLHDG('O/S QTY')
     A            OWGTWR         8  0       COLHDG('O/S WGT')
     A            OGOHWR         7  0       COLHDG('O/S GOH')
     A            TQTYWR         8  0       COLHDG('TOT QTY')
     A            TWGTWR         9  0       COLHDG('TOT WGT')
     A            TGOHWR         8  0       COLHDG('TOT GOH')
     A            RECDWR          L         COLHDG('RECEIPT' 'DATE')
     A                                      DFT('0001-01-01')
     A            WRECWR         7  0       COLHDG('INT. WALSH RECEIPT#')
     A*
     A*
     A**********************************************************************
     A*           DDPW    -    D3      DDP BILLING WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R DDPWFM
     A*
     A            ARECD3         1          COLHDG('ACTIVE' 'RECORD')
     A            TERMD3         2          COLHDG('TERMINAL ID')
     A            EXCOD3         3          COLHDG('COMPANY')
     A            EXKND3         9  0       COLHDG('KEY' 'INDEX')
     A            EXKSD3         9  0       COLHDG('KEY' 'SEQUENCE')
     A            EXTPD3        15          COLHDG('TRADING' 'PARTNER')
     A            EXSHD3        25          COLHDG('SHIPMENT' 'ID')
     A            CONTD3        11          COLHDG('CONTAINER')
     A            PO##D3        22          COLHDG('PURCHASE' 'ORDER')
     A            CBM#D3         5  3       COLHDG('CUBIC' 'MEASURMENT')
     A            QTYRD3         5  0       COLHDG('QUANTITY' 'RECEIVED')
     A            WGTRD3         5  0       COLHDG('WEIGHT' 'RECEIVED')
     A            ACCTD3         5  0       COLHDG('ACCOUNT#')
     A            DCIDD3        10          COLHDG('DC#')
     A            CBMRD3         5  3       COLHDG('CBM' 'RATE')
     A            EMTDD3         7  0       COLHDG('EMPTY' 'DATE')
     A            ITM#D3        20          COLHDG('ITEM' 'NUMBER')
     A            VPRTD3        48          COLHDG('VENDOR' 'PART#')
     A            MSDCD3         8  0       COLHDG('MSD' 'CODE')
     A            WRECD3         7  0       COLHDG('INTERNAL' 'W.REC#')
     A            PICDD3          L         COLHDG('PICKUP' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            NYKPD3         7  0       COLHDG('NYK PRO#')
     A            VESSD3        28          COLHDG('VESSEL')
     A            VOYAD3        10          COLHDG('VOYAGE')
     A            MANFD3         7  0       COLHDG('CUSTOMER' 'MANIFEST')
     A            OBTRD3         8          COLHDG('OUTBOUND' 'TRAILER')
     A*
     A**********************************************************************
     A*           DDPF    -    D1      DDP CONTAINER SUMMARY RATE WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R DDPFFM
     A*
     A            TERMD1         2          COLHDG('TERMINAL ID')
     A            EMTDD1         7  0       COLHDG('EMPTY DATE')
     A            CONTD1        11          COLHDG('CONTAINER')
     A            QTYTD1         7  0       COLHDG('QUANTITY' 'TOTAL')
     A            RATCD1         8  4       COLHDG('CBM' 'RATE')
     A            PICDD1          L         COLHDG('PICK-UP' 'DATE')
     A                                      DFT('0001-01-01')
     A            CAMTD1         7  2       COLHDG('CONTAINER' 'AMOUNT')
     A            TCBMD1        10  4       COLHDG('TOTAL CBM')
     A            WGTTD1         7  0       COLHDG('WEIGHT' 'TOTAL')
     A*
     A**********************************************************************
     A**********************************************************************
     A*           TJRG    -    RG      TJX ROUTING GUIDE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 001000 00010
     A*         R TJRGFM
     A*
     A            TERMRG         2          COLHDG('TERMINAL ID')
     A            ORIGRG        15          COLHDG('ORIGIN' 'CODE')
     A            DESTRG        15          COLHDG('DEST' 'CODE')
     A            SCACRG         4          COLHDG('SCAC' 'CODE')
     A            SVIDRG        20          COLHDG('SERVICE ID')
     A            STRDRG          L         COLHDG('START' 'DATE')
     A                                      DFT('0001-01-01')
     A            ENDDRG          L         COLHDG('ENDING' 'DATE')
     A                                      DFT('0001-01-01')
     A*
     A**********************************************************************
     A*           TJPL    -    PF      TJMAXX PALLETS ON HAND REPORT FF.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0020000 001000 00010
     A*         R TJPLFM
     A*
     A            CCODPF        30          COLHDG('client_code')
     A            SCODPF        30          COLHDG('site_code')
     A            SNAMPF        30          COLHDG('site_name')
     A            DESTPF        30          COLHDG('destination')
     A            DNAMPF        30          COLHDG('destination_name')
     A            QTYPPF        30          COLHDG('qty')
     A            PALLPF        30          COLHDG('tn')
     A            CDATPF        30          COLHDG('CREATE_DATE')
     A*
     A**********************************************************************
     A*           TJDW    -    DF      TJMAXX DWELL REPORT FF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0020000 001000 00010
     A*         R TJDWFM
     A*
     A            SITEDF        30          COLHDG('site')
     A            SNAMDF        30          COLHDG('site_name')
     A            TRIPDF        30          COLHDG('trip_id')
     A            PALLDF        30          COLHDG('tn')
     A            DTIMDF        30          COLHDG('deliver_time')
     A            LTIMDF        30          COLHDG('load_time')
     A            CTIMDF        30          COLHDG('created_at')
     A            DCODDF        30          COLHDG('destination')
     A            DNAMDF        30          COLHDG('destination_name')
     A*
