      *%METADATA                                                       *
      * %TEXT field reference OLPGM5D                                  *
      *%EMETADATA                                                      *
     A*------------------------------------------------------------------------*
     A*N FILE NAME - FLDREF                                                    *
     A*M             ONLINE SYSTEM VERSION 5
     A*------------------------------------------------------------------------*
     A*D DATA BASE FIELD REFERENCE                                             *
     A*M ----------------------------------------------------------------------*
     A*M TASK       DATE   ID  DESCRIPTION                                     *
     A*M ----     -------- --  ----------------------------------------        *
     * NO MARKS  05/15/07 ML  FILES FROM OLFILE5 & OLFILE HAVE BEEN
     *                        CONSOLIDATED AND TERMINALS ARE CHANGED TO 4 BYTES
      *
NXTC *  ALWAYS CHECK FOR NXTC FOR NEXT COMPILE
      *
      *
NC01  *  NC01  NCHANG  A/P COMP ADDED TO COMP
NC01  *  NC01  NCHANG  NAIT ACCOUNT ADDED TO COMP
NC02  *  NC02  NCHANG  TRFM ACTIVE/INACTIVE CODE
NC03  *  NC03  NCHANG  ADDED TL RATE CODE IN SHCO FILE
NC04  *  NC04  NCHANG  SH RATE FIELDS IN DRIV FILE SHOULD NOT BE USED
NC05  *  NC05  NCHANG  SH DIV FILE FOR SH SETTLEMENT RATES
NC06  *  NC06  NCHANG  SH DIV FIELD ADDED TO SHOP
NC07  *  NC07  NCHANG  SH COMP SETTLEMENT RATE MOVED TO SHDV
NC08  *  NC08  NCHANG  ADDED TRIAL APPROVAL CREDENTIAL FLD
NC09  *  NC09  NCHANG  ADDED TRIAL APPROVAL PROCESS FILES (STAP, SHAP, STAT)
NC10  *  NC10  NCHANG  MODIFIED PRW1 TO ACCOMMODATE CLASS
NC11  *  NC11  NCHANG  MODIFIED PUDT TO ACCOMMODATE CLASS
NC12  *  NC12  NCHANG  CUST MILE TOOL FLAG,USID DISPATCH GROUP
NC12  *                USRCLS S/B USED FOR IN/OUT COMPANY BROWSE LEVEL
NC13  *  NC13  NCHANG  ONDOCK TERMINAL CODE ADDED TO MNAF
NC14  *  NC14  NCHANG  TWO COST CENTER FLDS ADDED TO BLHD
NC16  *  NC16  NCHANG  ACTIVE FLD IN STOP FILE UPDATES 'T'
NC17  *  NC17  NCHANG  AUTORATE FLAG(Y/N)
NC18  *  NC18  NCHANG  BLHD STOP SEQ#
NC19  *  NC19  NC      DRIVER DISP GROUP
NC20  *  NC20  NC      ORIGINAL TRAILER IN ORDER FILE
NC21  *  NC21  NC      ADD SCAC & TRAILER IN MANF
NC22  *  NC22  NC      ADD ARRIVE/START/DEPART FIELDS IN CALL
NC24  *  NC24  NC      ADD AIRPORT/PIER IN LOCT FILE
NC25  *  NC25  NC      ADD ORIGINAL WGT/CTN/GOH IN  PUDT
NC26  *  NC26  NC      ADD SPECIAL PREPAID RATE IN LOCT
NC28  *  NC28  NC      ADD ITM DRIVER ID
NC29  *  NC29  NC      ADD AIR/PIER IN LOCT
NC30  *  NC30  NC      ADD PRE-PLAN DATE AND CODE IN PUHD
NXTC  *  ????  NC      PU REFUSED WHEN VENDOR WAS NOT READY
GP01  *  GP01  03/20/09 ADDED FILEDS IN T53H AND T53D
NC32  *  NC32  03/30/09 ADDED HAZMAT (Y/N)
GP33  *  GP33  04/14/09 ADDED SEQ#   IN T54H AND T54D  T54P
      *                 SINCE IN THE NEW TARGET I2 SYSTEM
      *                 WE CAN HAVE SAME DISPATHC#,OUR REF# COMBINATION
      *                 KEY IN THE T54H,T54D, T54P FILES
      *                  WHEN WE HAVE TARGET LOADS WITH NRTR P/U SCAC
      *                  (THESE HAVE MULTI-PICK UP STOPS)
      *                  -- WE WILL BE CREATING ONE ORDER# FOR
      *                     THESE LOADS IN OUR OL5 SYSTEM
      *                     AND WILL BE SENDING BACK 1 754 FOR
      *                     EACH P/U STOP FOR THIS TARGET LOAD
NC34  *  NC34  06/15/09 ADDED DISP END DATE/TIME
NC35  *  NC35  06/23/09 ADDED ORDR.EDIDOCOR (SEND EDI)
PR02  *  PR02  08/14/09 ADD FILES FOR EXPORT CONTAINER SYSTEM.
NC37  *  NC37  09/08/09 IMPORT/EXPORT FLAG
NC38  *  NC38  09/17/09 BB DUE DATE & TIME
NC39  *  NC39  09/21/09 DIVI - MIN DAILY PAY
NC39  *  NC39  09/21/09 DIVI - MAX % MILE INCREASE
NC40  *  NC40  01/01/10 LRDL - LATE REASON DELAY LIMIT
NC40  *  NC40  01/01/10 LRCX - EDI LATE REASON CODE XREF
GP02  *  GP02  02/18/10 DOCID MADE 15 LENGTH
GP03  *  GP03  02/18/10 MERGED LRDL AND LRVS INTO LRDL
      *                           LRVS WILL NOT BE USED ANYMORE
NC41  *  NC41  03/25/10 CTDT - CHASSIS
GP04  *  GP04  03/25/10 ADDED FIELDS TO FSCP
PR05  *  PR05  04/10/10 NEW CTDT FIELDS
NC42  *  NC42  04/14/10 CONR - ADD ZIP CODE FOR SPECIFIC ZIP RATE
      *
TRIP  *  TRIP & TRIP1 DONE BY NC
TRIP  *  TRIP  04/21/10 TRIP# FIELD EXPANSION FROM 5/0 TO 7/0
GP05  *  09/18/10  ADDED FLDS TO T53D AND T53P
GP06  *  09/23/10  INCREASED LENGTH OF NOTES IN RTSN
NC43  *  NC43  02/11/11 IDSX - PAID FLAG ADDED
GP07  *  05/08/11  ADDED FLDS TO T53H, T53D, T53P -- EDI WORK FILES USED
      *                   FOR RTS753-- I WILL USE IT FOR THE 204 OF RTS WHICH
      *                    WILL REPLACE 753
      *            ADDED FILE T53N SINCE HAVE NTE SEGMENT COMING IN HEADER OF TH
      *                      THE 204
      * 05/13/11   ADDED NEW FILE T990 FOR RTS TARGET 990 (5010) VERSION
GP08  *  06/15/11  ADDED FILED TO RTSF
      *             SICE WE WILL GET 204 INSTEAD OF 753 WITH EDI CODES
      *                 00  - ORIGINAL , 04 -- UPDATE , 01 - CANCEL
NC44  *  NC44  07/26/11 TGRP - TERMTG CJHANGED TO 120 FROM 80
GC01  *  GC01  03/25/12 ORDR - ADDED PREPLANNED POD,TERM GRP, CUBE
GC01  *  GC01  03/25/12 PUHD - ADDED PREPLANNED POD AND SERVICE TRM AND
GC01  *  GC01  03/25/12 PUHD - PREPLANNED PREPLANNED TERM GROUP
PR01  *  PR01  01/29/13 POEC - PORT OF ENTRY CONSIGNEE.
GC03  *  GC03  06/06/15 NEW SICK PAY FIELDS & CTHD CUSTOM INSP FLAG
GP09  *  GP09  03/09/16 ADDED FILE IKTX -- IKEA TRANSLOADS
GP10  *  GP10  04/21/16 ADDED FILE TJWN -- TJM WINNERS LTL EDI LOG
      *                        FOR ONES WE DO NOT CREATE PICKUPS
GC04  *  GC04  07/10/16 TJX POE MILESTONE FLAGS
PR07  *  PR07  03/01/17 NEW CONSIGNEE CALC METHOD
GC05  *  GC05  07/15/18 NEW FIELDS FOR ENHANCEMENTS
GC04  *  GC04  07/04/19 NEW FIELDS FOR SPECIAL PAY
     A**********************************************************************
     A*           FLDREF  -  FIELD REFERENCE FILE FOR ALL NRT  FILES
     A**********************************************************************
     A*
     A*  ALL FILES IN ALPHABETICAL ORDER
     A*
     A*           ASND    -    AD      LNT ASN DETAIL
     A*           ASNE    -    AE      LNT ASN EXCEPTION FILE
     A*           ASNH    -    AH      LNT ASN HEADER
     A*           ASNP    -    AP      LNT ASN PO LEVEL INFO
     A*           ASN2    -    2D      LNT SORTER 2 OUTPUT
     A*           BACT    -    BA      SPECIAL BILLING - LIST OF ACTIONS
     A*           BLDT    -    D       B/L DETAIL FILE
     A*           BLHD    -    H       B/L HEADER
     A*           BLH$    -    $       B/L HEADER TRANSFER FILE
     A*           BLPO    -    O       B/L PURCHASE ORDER FILE
     A*           BLSI    -    Q       B/L SPECIAL INSTRUCTIONS
     A*           CALL    -    K       CHECK-IN CALL FILE
     A*           CAGR    -    88      CONS AGGREGATE GROUP CODE
     A*           CARL    -    CR      CA 10/34 HOURS RULES IGNORED - LOG
     A*           CIER    -    C3      CHECK-IN ERROR CODE TABLE FILE
     A*           CLAS    -    CA      GOODS CLASS FILE
     A*           CNNA    -    OX      CONTAINER NOT AVAILABLE
     A*           COMP    -    CO      COMPANY MASTER FILE
     A*           COND    -    DP      CONSIGNEE BAD DEPT FILE
     A*           CONG    -    CG      CONSIGNEE GROUP FILE
     A*           CONM    -    CM      CONSIGNEE MESSAGE FILE (DISPATCH)
     A*           CONR    -    J       CONSOLIDATION RATE FILE
     A*           CONS    -    9       CONSIGNEE FILE (DISPATCH)
     A*           COXF    -    9X      CONSIGNEE/TERMINAL CROSS REF FILE
     A*           CSBE    -    ER      SHIPPER/CONS EXCEPT CONS RATES
     A*           CSDB    -    DB      CONTAINER STATUS MESSGES
     A*           CSPF    -    C#      CPYSPLF FILE.
     A*           CTBL    -    CC      CONTAINER BOL FILE
     A*           CTBR    -    CB      CONTAINER BROKER FILE
     A*           CTCM    -    CM      CONTAINER COMMENTS FILE
     A*           CTDT    -    CD      CONTAINER DETAIL FILE
     A*           CTHD    -    CH      CONTAINER CONTROL FILE
     A*           CTLO    -    CL      CONTAINER LOCATION FILE
     A*           CTSH    -    CS      CONTAINER STATUS HOLD
     A*IN NEW FRF CTSL    -    CY      CONTAINER STATUS CHANGE LOG
     A*           CTWB    -    WB      THIRD PARTY MT CONTAINER WEB
     A*           CTWF    -    WF      CONTAINER FLASH HISTORY WORKFILE
     A*           CTWR    -    WR      TJMAXX CONTAINER WORKFILE RAY JR
     A*           CTXR    -    CR      CONTAINER CROSS-REFERENCE 317
     A*           CUST    -    A       ACCOUNT MASTER FILE
     A*           DCH1    -    C1      DRIVER CHECK-IN FILE (HEADER)
     A*           DCH2    -    C2      DRIVER CHECK-IN FILE (SUB-HEADER)
     A*           DCHW    -    CW      DRIVER CHECK-IN FILE (WORK)
     A*           DCHX    -    CX      DRIVER CHECK-IN FILE (EOT W/O CHECK-IN)
     A*           DESC    -    C       DESCRIPTION FILE
     A*           DGRP    -    DG      DRIVERS GROUP FILE
     A*           DISP    -    DI      DISPATCH FILE
     A*           DIST    -    B       DISTRIBUTION MASTER FILE
     A*           DIVI    -    1A      DIVISION MASTER FILE
     A*           DRIV    -    DR      DRIVER MASTER FILE
     A*           DSTR    -    SD      STORE DISTRIBUTION TABLE
     A*           DSWL    -    DS      DSW LOADS
     A*           DSWP    -    DP      DSW PO
     A*           DSWB    -    DB      DSW BOL INFO
     A*           DSWU    -    DU      DSW PU# TO REUSE FILE(FOR EDI UPD)
     A*           DSVC    -    DC      DSW VENDOR XREF (AND BEALLS XREF)
     A*           DTFD    -    FD      FEDERATED TRIP DETAIL FILE
     A*           DW019RWK -   WK      DW019R WORK FILE
     A*           EDIX    -    EX      204/211 EDI/NRS LOCATION X-REF
     A*           EFLM    -    N       WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*           EFLP    -    V       PO FILE FOR 212 FORMAT DETAIL
     A*           EFLR    -    U       WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*           EPFD    -    V       PO FILE FOR 214 FORMAT DETAIL
     A*           ERT7    -    T7      EDI DETAIL FOR 997 FROM TARGET
     A*           ETDT    -    TD      DET FILE FOR 204 FORMAT DETAIL
     A*           ETHD    -    TH      HDR FILE FOR 204 FORMAT DETAIL
     A*           ETIN    -    TN      INSTRUCTIONS 204 FORMAT DETAIL
     A*           ETPO    -    TP      PO FILE FOR 204 FORMAT DETAIL
     A*           EWFD    -    U       WORK FILE FOR AF-AD SEGMENT BEING CREATED
     A*           EXBR    -    XB      EXPORT CONTAINER BROKER FILE
     A*           EXCM    -    XC      EXPORT CONTAINER COMMENTS FILE
     A*           EXPD    -    XD      EXPORT CONTAINER FILE
     A*           FSCD    -    F2      FUEL SURCHARGE PROFILE DET
     A*           FSCH    -    F1      FUEL SURCHARGE PROFILE HDR
     A*           FSCP    -    FP      FUEL SURCHARGE FUEL PEG
     A*           GRUP    -    11      ACCOUNT GROUP MASTER FILE
     A*           HBNP    -    HP      HUB GROUP NART P/U PO#   FOR LNT
     A*           HBNS    -    HS      HUB GROUP NART FILE
     A*           HBVC    -    HC      HUB GROUP VENDOR XREF FILE
     A*           HDFD    -    FH      FEDERATED TRIP HEADER FILE
     A*           HLDY    -    HD      HOLIDAY FILE
     A*           HLXF    -    HX      HOLIDAY/TERMINAL CROSS REF
     A*           ILCA    -    I       INTERLINE CARRIERS
     A*           ILCX    -    IX      INTERLINE CARRIERS EXTENSION
     A*           ILXF    -    F       PRELIMINARY I/L LIABILITY ENTRY
GP09 A*           IKTX    -    IK      PRELIMINARY I/L LIABILITY ENTRY
     A*           ITRT    -    IT      INTRA-TERMINAL RATE FILE
     A*           LHRT    -    LH      LINEHAUL FROM NART RATE FILE
     A*           LNTS    -    LS      LNT STORE - DC FILE
     A*           LOCT    -    8       LOCATION
     A*           LOCX    -    8X      LOCATION EXTENSION
     A*           LODT    -    L       LOAD DETAIL FILE (STERNS)
     A*           LOHD    -    CK      LOAD HEADER FILE (STERNS)
     A*           LXRF    -    LX      LOCATION OLD/NEW CODE X-REF
     A*           MANF    -    M       MANIFEST FILE
     A*           MFAX    -    MF      MANIFESTS FAX INFORMATION
     A*           MILE    -    MI      KEEP ALREADY CALCULATED DISTANCE
     A*           SMIL    -    SI      STATE DISTANCES
     A*           MODE    -    13      OZ MODE ANALYSIS
     A*           MOVE    -    N       MOVEMENT FILE
     A*           MTLC    -    MT      CONTAINER EMPTY LOCATION FILE
     A*           M3PT    -    M3      MARMAXX 3RD PARTY BILLING ACCOUNTS
     A*           NAIC    -    C       NAIT INSURANCE CONTROL
     A*           NAID    -    ND      NAIT DETAIL FILE
     A*           NAIH    -    NH      NAIT HEADER FILE
     A*           NAIT    -    N       NAIT INSURANCE
     A*           NOTW    -    NW      NOTIFICATION WORK FILE
     A*           NUM#    -    O#      GET NUMBER STATISTICAL FILE
     A*           ONTC    -    TC      STORES ON-TIME - CUSTOMER FILE
     A*           ONTS    -    TS      STORES ON-TIME - STORE FILE
     A*           ORDC    -    OC      ORDER COMMENTS
     A*           ORDM    -    MO      MASTER ORDERS (TEMPLATES)
     A*           ORDR    -    OR      ORDER FILE
     A*           OSDR    -    7       OS&D FILE
     A*           PFND    -    PD      1964 PENSION FUND ACCUMULATION BY DRIVER
     A*           PFNT    -    PT      1964 PENSION FUND CALCULATION VARIABLES
     A*           PFN1    -    P1      509 PENSION FUND ACCUMULATION BY DRIVER
     A*           PFN2    -    P2      509 PENSION FUND ACCUMULATION BY DRIVER M
     A*           POEC    -    PC      PO OVERRIDE
     A*           POOV    -    OV      PO OVERRIDE
     A*           PORJ    -    PR      REJECTED PO FILE
     A*           PRW1    -    W1      AUTO-PU-PRO FILE
     A*           PRW2    -    W2      AUTO-PU-PRO FILE
     A*           PSOR    -    PS      PRIMARY/SECONDARY ORDER FILE
     A*           PUDT    -    2       PICK UP DETAIL (DISPATCH)
     A*           PUHD    -    1       PICK UP HEADER FILE
     A*           PUPO    -    0       PO DETAIL FILE (DISPATCH)
     A*           PUHS    -    PH      PICK UP PO DETAIL VENDOR UPDATES
     A*           PUPS    -    2P      MATCH 2 PUPS RUNNING SIMULTANEOUSLY
     A*           PUTL    -    PL      PICK UP TRANSFER LOG FILE
     A*           RATE    -    E       RATE FILE
     A*           REDT    -    G       RECEIVING DETAIL
     A*           REHD    -    F       RECEIVING HEADER
     A*           REVT    -    RT      MARMAXX PRO'S REVENUE TYPE TABLE
     A*           RLDX    -    R       ROLLODEX FILE
     A*           ROUT    -    4       ROUTE FILE (DISPATCH)
     A*           RREX    -    RE      REVENUE RE-ALLOCATION EXCEPTION TABLE
     A*           RTEL    -    4M      MARMAXX LAS VEGAS ROUTE FILE
     A*           RTSC    -    RC      TARGET RTS CARRIER MASTER FILE
     A*           RTSD    -    RD      TARGET RTS CARRIER BY DC FILE
     A*           RTSF    -    RT      TARGET RTS FILE
     A*           RTSN    -    RN      TARGET RTS NOTES FILE
     A*           RTSR    -    RR      RESPONSE FROM CARRIERS
     A*           RTSV    -    RV      TARGET RTS VENDOR FILE
     A*           RTSX    -    RX      TARGET RTS VENDOR XREF FILE
     A*           SEAL    -    S1      SEAL
     A*           SCAN    -    SC      LNT SCANNED CARTONS
     A*           SHBK    -    SH      EASY SHUTTLE BOOKING TERMINAL
     A*           SHCO    -    SC      SUB HAULER COMPANY
     A*           SHIX    -    IX      SUB HAULER INVOICE (WORK FILE)
     A*           SHIY    -    IY      SUB HAULER INVOICE (WORK FILE)
     A*           SHI1    -    I1      SUB HAULER INVOICE (LEVEL 1)
     A*           SHI2    -    I2      SUB HAULER INVOICE (LEVEL 2)
     A*           SHI3    -    I3      SUB HAULER INVOICE (LEVEL 3)
     A*           SHJB    -    SH      JOBS ASSIGNED TO SUB-HAULERS
     A*           SHMI    -    MX      S/H LTL RATE PER MILE
     A*           SHOP    -    SO      WMX OPERATION CODE
     A*           STOP    -    ST      ORDER STOP OFF FILE
     A*           STOR    -    S       DISTRIBUTION STORE MASTER
     A*           STPM    -    SM      MASTER ORDER STOP OFF FILE
     A*           T990    -    9H      RTS 990 TO SEND TO TARGET
     A*           TGRP    -    TG      TERMINAL GROUP FILE
     A*           TJAA    -    AA      TJMAX ACCOUNT#
     A*           TJAX    -    AX      TJMAX ACCOUNT# X-REF
     A*           TJLX    -    LX      TJMAX LOCATION X-REF
GP10 A*           TJWN    -    WN      TJMAX WINNERS LTL EDI LOG
     A*           TJTX    -    TX      TJMAX TERMINAL X-REF
     A*           TLAD    -    AD      TARGET TRUCKLOAD ADVANCE TO NART
     A*           TRFD    -    DF      TARIFF DETAIL FILE
     A*           TRFM    -    FF      TARIFF HEADER FILE
     A*           TRIN    -    TI      TRINIUM FILE
     A*           TRIP    -    T       TRIP MASTER FILE
     A*           TRIX    -    IX      TRINIUM FILE - WEEKLY DRTAILS
     A*           TRPD    -    T2      MARMAXX LAS VEGAS TRIP DETAIL
     A*           TRPH    -    T1      MARMAXX LAS VEGAS TRIP HEADER
     A*           T53D    -    3D      EDI RTS 753 DETAIL
     A*           T53H    -    3H      EDI RTS 753 HEADER
     A*           T53N    -    3N      EDI RTS 753/204 HEADER
     A*           T53P    -    3P      EDI RTS 753 PO DETAIL
     A*           T54D    -    4D      EDI RTS 754 DETAIL
     A*           T54H    -    4H      EDI RTS 754 HEADER
     A*           T54P    -    4P      EDI RTS 754 PO DETAIL
     A*           USID    -    Y       USER PROFILE
     A*           USPG    -    UP      USER/PROGRAM AUTHORIZATION
     A*           VENP    -    8P      VENDOR PASSWORDS
     A*           VEXF    -    8X      VENDOR CROSS REFERENCE FILE
     A*           VLDX    -    #X      VENDOR LOAD FILE (RTS)
     A*           VLXR    -    VX      EDI CODE / LOCATION X-REF
     A*           VTLR    -    R1      TARGET VENDOR TRUCKLOAD ROUTING
     A*           WGHT    -    WT      WEIGHT DISTRIBUTION FOR RECONCILIATION
     A*           WKOO    -    WO      WORK FILE FOR OPEN OPRDERS      IATION
     A*           ZCNT    -    CT      COUNTY FILE
     A*           ZCTY    -    ZC      ZIP / CITY FILE
     A*           ZIPS    -    5       ZIP CODE FILE (DISPATCH)
     A**********************************************************************
     A*
     A*  ALL FILES IN ORDER BY SUFFIX
     A*
     A*           VLDX    -    #X      VENDOR LOAD FILE (RTS)
     A*           BLH$    -    $       B/L HEADER TRANSFER FILE
     A*           CUST    -    A       ACCOUNT MASTER FILE
     A*           TJAA    -    AA      TJMAX ACCOUNT#
     A*           ASND    -    AD (!)  LNT ASN DETAIL
     A*           TLAD    -    AD (!)  TARGET TRUCKLOAD ADVANCE TO NART
     A*           ASNE    -    AE      LNT ASN EXCEPTION FILE
     A*           ASNH    -    AH      LNT ASN HEADER
     A*           ASNP    -    AP      LNT ASN PO LEVEL INFO
     A*           TJAX    -    AX      TJMAX ACCOUNT# X-REF
     A*           DIST    -    B       DISTRIBUTION MASTER FILE
     A*           BACT    -    BA      SPECIAL BILLING - LIST OF ACTIONS
     A*           NAIC    -    C       NAIT INSURANCE CONTROL
     A*           DESC    -    C       DESCRIPTION FILE
     A*           CSPF    -    C#      CPYSPLF FILE.
     A*           CLAS    -    CA      GOODS CLASS FILE
     A*           CTBR    -    CB      CONTAINER BROKER FILE
     A*           CTBL    -    CC      CONTAINER BOL FILE
     A*           CTDT    -    CD      CONTAINER DETAIL FILE
     A*           CONG    -    CG      CONSIGNEE GROUP FILE
     A*           CTHD    -    CH      CONTAINER CONTROL FILE
     A*           CTLO    -    CL      CONTAINER LOCATION FILE
     A*           LOHD    -    CK      LOAD HEADER FILE (STERNS)
     A*           CONM    -    CM (!)  CONSIGNEE MESSAGE FILE (DISPATCH)
     A*           CTCM    -    CM (!)  CONTAINER COMMENTS FILE
     A*           COMP    -    CO      COMPANY MASTER FILE
     A*           CARL    -    CR (!)  CA 10/34 HOURS RULES IGNORED - LOG
     A*           CTXR    -    CR (!)  CONTAINER CROSS-REFERENCE 317
     A*           CTSH    -    CS      CONTAINER STATUS HOLD
     A*           ZCNT    -    CT      COUNTY FILE
     A*           DCHW    -    CW      DRIVER CHECK-IN FILE (WORK)
     A*           DCHX    -    CX      DRIVER CHECK-IN FILE (EOT W/O CHECK-IN)
     A*IN NEW FRF CTSL    -    CY      CONTAINER STATUS CHANGE LOG
     A*           DCH1    -    C1      DRIVER CHECK-IN FILE (HEADER)
     A*           DCH2    -    C2      DRIVER CHECK-IN FILE (SUB-HEADER)
     A*           CIER    -    C3      CHECK-IN ERROR CODE TABLE FILE
     A*           BLDT    -    D       B/L DETAIL FILE
     A*           CSDB    -    DB      CONTAINER STATUS MESSGES
     A*           TRFD    -    DF      TARIFF DETAIL FILE
     A*           DGRP    -    DG      DRIVERS GROUP FILE
     A*           DISP    -    DI      DISPATCH FILE
     A*           COND    -    DP      CONSIGNEE BAD DEPT FILE
     A*           DRIV    -    DR      DRIVER MASTER FILE
     A*           DSWL    -    DS      DSW LOADS
     A*           DSWP    -    DP      DSW PO
     A*           DSWB    -    DB      DSW BOL INFO
     A*           DSWU    -    DU      DSW PU# TO REUSE FILE(FOR EDI UPD)
     A*           DSVC    -    DC      DSW VENDOR XREF (AND BEALLS XREF)
     A*           RATE    -    E       RATE FILE
     A*           CSBE    -    ER      SHIPPER/CONS EXCEPT CONS RATES
     A*           EDIX    -    EX      204/211 EDI/NRS LOCATION X-REF
     A*           ILXF    -    F  (!)  PRELIMINARY I/L LIABILITY ENTRY
     A*           REHD    -    F  (!)  RECEIVING HEADER
     A*           DTFD    -    FD      FEDERATED TRIP DETAIL FILE
     A*           TRFM    -    FF      TARIFF HEADER FILE
     A*           HDFD    -    FH      FEDERATED TRIP HEADER FILE
     A*           FSCP    -    FP      FUEL SURCHARGE FUEL PEG
     A*           FSCH    -    F1      FUEL SURCHARGE PROFILE HDR
     A*           FSCD    -    F2      FUEL SURCHARGE PROFILE DET
     A*           REDT    -    G       RECEIVING DETAIL
     A*           BLHD    -    H       B/L HEADER
     A*           HBVC    -    HC      HUB GROUP VENDOR XREF FILE
     A*           HLDY    -    HD      HOLIDAY FILE
     A*           HBNP    -    HP      HUB GROUP NART P/U PO#   FOR LNT
     A*           HBNS    -    HS      HUB GROUP NART FILE
     A*           HLXF    -    HX      HOLIDAY/TERMINAL CROSS REF
     A*           ILCA    -    I       INTERLINE CARRIERS
GP09 A*           IKTX    -    IK      PRELIMINARY I/L LIABILITY ENTRY
     A*           ITRT    -    IT      INTRA-TERMINAL RATE FILE
     A*           ILCX    -    IX (!)  INTERLINE CARRIERS EXTENSION
     A*           SHIX    -    IX (!)  SUB HAULER INVOICE (WORK FILE)
     A*           TRIX    -    IX (!)  TRINIUM FILE - WEEKLY DRTAILS
     A*           SHIY    -    IY      SUB HAULER INVOICE (WORK FILE)
     A*           SHI1    -    I1      SUB HAULER INVOICE (LEVEL 1)
     A*           SHI2    -    I2      SUB HAULER INVOICE (LEVEL 2)
     A*           SHI3    -    I3      SUB HAULER INVOICE (LEVEL 3)
     A*           CONR    -    J       CONSOLIDATION RATE FILE
     A*           CALL    -    K       CHECK-IN CALL FILE
     A*           LODT    -    L       LOAD DETAIL FILE (STERNS)
     A*           LHRT    -    LH      LINEHAUL FROM NART RATE FILE
     A*           LNTS    -    LS      LNT STORE - DC FILE
     A*           LXRF    -    LX (!)  LOCATION OLD/NEW CODE X-REF
     A*           TJLX    -    LX (!)  TJMAX LOCATION X-REF
     A*           MANF    -    M       MANIFEST FILE
     A*           MFAX    -    MF      MANIFESTS FAX INFORMATION
     A*           MILE    -    MI      KEEP ALREADY CALCULATED DISTANCE
     A*           SMIL    -    SI      KEEP ALREADY CALCULATED DISTANCE
     A*           ORDM    -    MO      MASTER ORDERS (TEMPLATES)
     A*           MTLC    -    MT      CONTAINER EMPTY LOCATION FILE
     A*           SHMI    -    MX      S/H LTL RATE PER MILE
     A*           M3PT    -    M3      MARMAXX 3RD PARTY BILLING ACCOUNTS
     A*           EFLM    -    N (!)   WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*           MOVE    -    N (!)   MOVEMENT FILE
     A*           NAIT    -    N       NAIT INSURANCE
     A*           NAID    -    ND      NAIT DETAIL FILE
     A*           NAIH    -    NH      NAIT HEADER FILE
     A*           NOTW    -    NW      NOTIFICATION WORK FILE
     A*           BLPO    -    O       B/L PURCHASE ORDER FILE
     A*           NUM#    -    O#      GET NUMBER STATISTICAL FILE
     A*           ORDC    -    OC      ORDER COMMENTS
     A*           ORDR    -    OR      ORDER FILE
     A*           POOV    -    OV      PO OVERRIDE
     A*           CNNA    -    OX      CONTAINER NOT AVAILABLE
     A*           POEC    -    PC      PO OVERRIDE
     A*           PFND    -    PD      1964 PENSION FUND ACCUMULATION BY DRIVER
     A*           PUHS    -    PH      PICK UP PO DETAIL VENDOR UPDATES
     A*           PUTL    -    PL      PICK UP TRANSFER LOG FILE
     A*           PORJ    -    PR      REJECTED PO FILE
     A*           PSOR    -    PS      PRIMARY/SECONDARY ORDER FILE
     A*           PFNT    -    PT      1964 PENSION FUND CALCULATION VARIABLES
     A*           PFN1    -    P1      509 PENSION FUND ACCUMULATION BY DRIVER
     A*           PFN2    -    P2      509 PENSION FUND ACCUMULATION BY DRIVER M
     A*           BLSI    -    Q       B/L SPECIAL INSTRUCTIONS
     A*           RLDX    -    R       ROLLODEX FILE
     A*           RTSC    -    RC      TARGET RTS CARRIER MASTER FILE
     A*           RTSD    -    RD      TARGET RTS CARRIER BY DC FILE
     A*           RREX    -    RE      REVENUE RE-ALLOCATION EXCEPTION TABLE
     A*           RTSN    -    RN      TARGET RTS NOTES FILE
     A*           RTSR    -    RR      RESPONSE FROM CARRIERS
     A*           REVT    -    RT      MARMAXX PRO'S REVENUE TYPE TABLE
     A*           RTSF    -    RT      TARGET RTS FILE
     A*           RTSV    -    RV      TARGET RTS VENDOR FILE
     A*           RTSX    -    RX      TARGET RTS VENDOR XREF FILE
     A*           VTLR    -    R1      TARGET VENDOR TRUCKLOAD ROUTING
     A*           STOR    -    S       DISTRIBUTION STORE MASTER
     A*           SCAN    -    SC      LNT SCANNED CARTONS
     A*           DSTR    -    SD      STORE DISTRIBUTION TABLE
     A*           SHBK    -    SH      EASY SHUTTLE BOOKING TERMINAL
     A*           STPM    -    SM      MASTER ORDER STOP OFF FILE
     A*           STOP    -    ST      ORDER STOP OFF FILE
     A*           SEAL    -    S1      SEAL
     A*           TRIP    -    T       TRIP MASTER FILE
     A*           ONTC    -    TC      STORES ON-TIME - CUSTOMER FILE
     A*           ETDT    -    TD      DET FILE FOR 204 FORMAT DETAIL
     A*           TGRP    -    TG      TERMINAL GROUP FILE
     A*           ETHD    -    TH      HDR FILE FOR 204 FORMAT DETAIL
     A*           TRIN    -    TI      TRINIUM FILE
     A*           ETIN    -    TN      INSTRUCTIONS 204 FORMAT DETAIL
     A*           ETPO    -    TP      PO FILE FOR 204 FORMAT DETAIL
     A*           ONTS    -    TS      STORES ON-TIME - STORE FILE
     A*           TJTX    -    TX      TJMAX TERMINAL X-REF
     A*           TRPH    -    T1      MARMAXX LAS VEGAS TRIP HEADER
     A*           TRPD    -    T2      MARMAXX LAS VEGAS TRIP DETAIL
     A*           ERT7    -    T7      EDI DETAIL FOR 997 FROM TARGET
     A*           EFLR    -    U (!)   WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*           EWFD    -    U (!)   WORK FILE FOR AF-AD SEGMENT BEING CREATED
     A*           USPG    -    UP      USER/PROGRAM AUTHORIZATION
     A*           EFLP    -    V (!)   PO FILE FOR 212 FORMAT DETAIL
     A*           EPFD    -    V (!)   PO FILE FOR 214 FORMAT DETAIL
     A*           VLXR    -    VX      EDI CODE / LOCATION X-REF
     A*           DW019RWK -   WK      DW019R WORK FILE
     A*           WGHT    -    WT      WEIGHT DISTRIBUTION FOR RECONCILIATION
     A*           PRW1    -    W1      AUTO-PU-PRO FILE
     A*           PRW2    -    W2      AUTO-PU-PRO FILE
     A*           CTWB    -    WB      THIRD PARTY MT CONTAINER WEB
     A*           CTWF    -    WF      CONTAINER FLASH HISTORY WORKFILE
GP10 A*           TJWN    -    WN      TJMAX WINNERS LTL EDI LOG
     A*           WKOO    -    WO      WORK FILE FOR OPEN OPRDERS      IATION
     A*           CTWR    -    WR      TJMAXX CONTAINER WORKFILE RAY JR
     A*           EXBR    -    XB      EXPORT CONTAINER BROKER FILE
     A*           EXCM    -    XC      EXPORT CONTAINER COMMENTS FILE
     A*           EXPD    -    XD      EXPORT CONTAINER FILE
     A*           USID    -    Y       USER PROFILE
     A*           ZCTY    -    ZC      ZIP / CITY FILE
     A*           PUPO    -    0       PO DETAIL FILE (DISPATCH)
     A*           PUHD    -    1       PICK UP HEADER FILE
     A*           DIVI    -    1A      DIVISION MASTER FILE
     A*           GRUP    -    11      ACCOUNT GROUP MASTER FILE
     A*           MODE    -    13      OZ MODE ANALYSIS
     A*           PUDT    -    2       PICK UP DETAIL (DISPATCH)
     A*           ASN2    -    2D      LNT SORTER 2 OUTPUT
     A*           PUPS    -    2P      MATCH 2 PUPS RUNNING SIMULTANEOUSLY
     A*           T53D    -    3D      EDI RTS 753 DETAIL
     A*           T53H    -    3H      EDI RTS 753 HEADER
     A*           T53N    -    3N      EDI RTS 753/204 HEADER
     A*           T53P    -    3P      EDI RTS 753 PO DETAIL
     A*           ROUT    -    4       ROUTE FILE (DISPATCH)
     A*           T54D    -    4D      EDI RTS 754 DETAIL
     A*           T54H    -    4H      EDI RTS 754 HEADER
     A*           RTEL    -    4M      MARMAXX LAS VEGAS ROUTE FILE
     A*           T54P    -    4P      EDI RTS 754 PO DETAIL
     A*           ZIPS    -    5       ZIP CODE FILE (DISPATCH)
     A*           OSDR    -    7       OS&D FILE
     A*           LOCT    -    8       LOCATION
     A*           VENP    -    8P      VENDOR PASSWORDS
     A*           VEXF    -    8X      VENDOR CROSS REFERENCE FILE
     A*           LOCX    -    8X      LOCATION EXTENSION
     A*           CAGR    -    88      CONS AGGREGATE GROUP CODE
     A*           CONS    -    9       CONSIGNEE FILE (DISPATCH)
     A*           T990    -    9H      RTS 990 TO SEND TO TARGET
     A*           COXF    -    9X      CONSIGNEE/TERMINAL CROSS REF FILE
     A**********************************************************************
     A          R FLDREFFM
     A**********************************************************************
     *
     *
     *         FILES FROM *** OLFILE5 ***
     *
     *
     A**********************************************************************
TRIP A*           BLHD      -                B/L HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 030000 00010
     A*         R BLHDFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_BLHD1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_BLHD2
     A*
     A            ACRECH         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##H         7  0       COLHDG('PRO #')
     A            COMP#H         3          COLHDG('COMPANY')
     A            PRODTH          L         COLHDG('DATE')
     A*
     A* DATE PRO HIT SYSTEM
     A            ENTDTH          L         COLHDG('ENTRY' 'DATE')
     A            ACCT#H         5  0       COLHDG('BILL TO #')
     A            BILLNH        25          COLHDG('3RD PARTY BILL TO')
     A* SHIPPER
     A            SHIPNH        25          COLHDG('SHIPPER NAME')
     A            SHAD1H        25          COLHDG('SHIPPER ADD1')
     A            SHAD2H        16          COLHDG('SHIPPER CITY')
     A            SHSTAH         2          COLHDG('SHIPPER STATE')
     A            SHZIPH         5  0       COLHDG('SHIPPER ZIP')
     A            SHCODH         6          COLHDG('SHP LOC' 'CODE')
     A            SHBLTH         5  0       COLHDG('SHP' 'BILLTO')
     A            TRAC#H         8  0       COLHDG('TRACKING #')
     A* CONSIGNEE
     A            CONS#H         5  0       COLHDG('CONSIGNEE #')
     A            CONSNH        25          COLHDG('CONSIGNEE NAME')
     A            COAD1H        25          COLHDG('CONSIGNEE ADD1')
     A            COAD2H        16          COLHDG('CONSIGNEE CITY')
     A            CONSTH         2          COLHDG('CONSIGNEE STATE')
     A            COZIPH         5  0       COLHDG('CONSIGNEE ZIP')
     A            COCODH         6          COLHDG('CON LOC' 'CODE')
     A            COBLTH         5  0       COLHDG('CON' 'BILLTO')
     A* TERMINALS
     A            ORIGNH         4          COLHDG('ORIGIN')
     A            DESTNH         4          COLHDG('DESTINATION')
     A*  PRO TOTALS
     A            TOTALH         9  2       COLHDG('TOTAL AMOUNT')
     A            TOQTYH         6  0       COLHDG('TOTAL QTY')
     A            TOWGTH         6  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A            PAYCOH         1          COLHDG('PREPAID/COLLECT')
     A*                                        P = PREPAID
     A*                                        C = COLLECT
     A* PERSONNEL
     A            BILLIH         2          COLHDG('CODERS' 'ID')
     A            RATEIH         2          COLHDG('RATERS' 'ID')
     A            OPERAH         2          COLHDG('ENTRY' 'ID')
     A*
     A*  MOVEMENT
     A            MOVE#H         7  0       COLHDG('MANIFEST#')
     A            MOVFRH         4          COLHDG('MOVE FROM')
     A            MOVTOH         4          COLHDG('MOVE TO')
     A*
     A*  INTERLINE CARRIER INFORMATION
     A            ILCODH         4          COLHDG('I/L' 'CARRIER')
     A            ILPROH        10          COLHDG('I/L PRO#')
     A            ILAMTH         7  2       COLHDG('I/L AMT')
     A*                                        I/L'S PORTION
     A            ILNRTH         7  2       COLHDG('I/L NRT')
     A*                                        NRT'S PORTION
     A            ILTOTH         7  2       COLHDG('I/L TOT')
     A* NOTE: ILAMT + ILNRT = ILTOT            I/L TOTAL AMT
     A            ILFRMH         1          COLHDG('FROM OR TO')
     A*                                        F=FROM T=TO
     A*  DELIVERY INFORMATION
     A            ROUTEH         7          COLHDG('DELIVERY ROUTE')
     A            DELVYH         1          COLHDG('DELIVERY CODE')
GP   A*                                        X = MANUAL CODE FOR
GP   A*                                              DELIVERED (DONE)
     A*                                        D = DELIVERED (DONE)
     A            PAAMTH         9  2       COLHDG('AMOUNT COLLECTED')
     A            PATYPH         1          COLHDG('FORM OF PAYMENT')
     A*                                        $ = CASH  C = CHECK
     A*
     A*  C.O.D.'S
     A            CODCDH         1          COLHDG('C.O.D. CODE')
     A*                                         = NOT A C.O.D.
     A*                                       C = COMPANY CHECK ACCPTED
     A*                                       $ = CASH OR CERTIFIED CHK*****
     A            CDAMTH         7  2       COLHDG('C.O.D. AMOUNT')
     A*
     A*  STATUS FLAGS:
     A            SKLPTH         1          COLHDG('SKELETON' 'PRT')
     A*                                        P = PRINTED
     A            DELPTH         1          COLHDG('DELIVERY' 'PRT')
     A*                                        P = PRINTED
     A            DOCKDH         1          COLHDG('DOCK' 'DELIVERY')
     A*                                        D = DOCK DELIVERED
     A            AIRPRH         1          COLHDG('AIRPORT/PIER' 'CODE')
     A*                                          = REGULAR
     A*                                        A = AIRPORT PICKUP
     A*                                        P = PIER PICKUP
     A            CONPUH         1          COLHDG('CONS' 'P/U')
     A*                                        Y = CONSOLIDATION P/U
     A* FROM 5/30/23 NOT USED ==================================================
     A            OSDCOH         1          COLHDG('OS&D CODE')
     A*                                        O = OVERAGE
     A*                                        S = SHORTAGE
     A*                                        D = DAMAGE
     A* ========================================================================
     A            SIEXTH         1          COLHDG('SPEC INS' 'EXIST')
     A*                                        Y = SPECIAL INSTR EXIST
     A            POEXTH         1          COLHDG('PO''S' 'EXIST')
     A*                                        Y = PO'S EXIST
     A            EDISTH         2          COLHDG('EDI' 'STATUS')
     A*                                        AF = AF TRANSACTION SENT
     A*                                        AD = AD TRANSACTION SENT
     A            STAT1H         1          COLHDG('A/R' 'STATUS')
     A*                                          = ENTERED
     A*                                        C = PENDING CHASSIS FEE
     A*                                        P = PRE-ASSIGNED
     A*                                        R = COPIED TO A/R
     A            STAT2H         1          COLHDG('SPEC' 'STATUS')
     A*                                        V = VOIDED PRO
     A*                                        F = NON-REVENUE PRO
     A            STAT3H         1          COLHDG('SPARE' 'FLAG3')
     A*                                     NOT USED AT THIS TIME
     A            BILLRH        10          COLHDG('BILLER' 'PROFILE')
     A            AGGGRH         4          COLHDG('AGG-GROUP' 'CODE')
     A            PROTPH         1          COLHDG('PRO' 'TYPE')
     A*                                        T = TRANSPORTATION
     A*                                        N = NON-TRANSPORTATION
     A            PROSTH         3          COLHDG('PRO' 'SUB-TYPE')
     A*                                        LTL, TL, CNT (CONTAINER),
     A*                                        DDL (DOCK DELIVERY),
     A*                                        DST (DISTRIBUTION),
     A*                                        OTHERS TBD...
     A            VOLUMH         5  3       COLHDG('VOLUME' 'IN CBM')
     A            MILESH         5  0       COLHDG('MILEAGE')
     A            TRDSTH         6          COLHDG('TARIFF/DIST')
     A            TRDSTCH        1          COLHDG('TARIFF/DIST' 'CHG')
     A            DRVTYPH        1          COLHDG('DRIVER TYPE')
     A*                                      'H' = HOUSE DRIVER
     A*                                      'O' = OWNER OPERATOR
     A*                                      'S' = SUB-HAULER
     A            TRAILH         7          COLHDG('TRAIL#')
     A            SCACH          4          COLHDG('SCAC')
     A            ORDERH         7  0       COLHDG('ORDER#')
TRIP A            TRIP#H         7  0       COLHDG('TRIP#')
     A            DELVDH          L         COLHDG('DLVR' 'DATE')
     A*
     A            STRIPH         1          COLHDG('STRIPPED' 'FLAG')
     A*                                      ' ' = NOT STRIPPED
     A*                                      'S' = STRIPPED
NC14 A            CCTR1H         4          COLHDG('COST' 'CENTER1')
NC14 A            CCTRWH         4          COLHDG('COST' 'CENTER2')
NC18 A            STOP#H         2  0       COLHDG('STOP' 'SEQ#')
     A*
GC   A            HOURSH         5  2       COLHDG('HOURS' 'RUN')
     A*  LOAD TYPE:  DRIVER TYPE FOR 1ST DISPATCH
GC   A            REVTYH         1          COLHDG('REV' 'TYPE')
     A*                                          = N/A
     A*                                        H = HOUSE DRIVER
     A*                                        O = OWNER OPERATOR
     A*                                        A = AFFILIATED COMP (WMX
     A*                                        S = SUBHAULER
     A**********************************************************************
     A*           BLDT      -                B/L DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1500000 030000 00010
     A*         R BLDTFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO BLDTWK
     A*
     A            ACRECD         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##D         7  0       COLHDG('PRO #')
     A            COMP#D         3          COLHDG('COMPANY')
     A            LINE#D         2  0       COLHDG('PRO' 'LINE#')
     A            PTYPED         1          COLHDG('PRO' 'TYPE')
     A*                                       1 = COMMODITY LINE
     A*                                       2 = MESSAGE LINE
     A*
     A* COMMODITY
     A            QTYL1D         6  0       COLHDG('QTY')
     A            DESCRD        25          COLHDG('DESCRIPTION')
     A            SDESCD         4          COLHDG('STANDARD' 'DESCR')
     A* RATE & WGTS
     A            WGTACD         5  0       COLHDG('WEIGHT' 'ACTUAL')
     A            AMTASD         5  0       COLHDG('AS' 'WGT/QTY')
     A            RATESD         6  3       COLHDG('RATE')
     A            RBASED         1          COLHDG('RATE' 'BASE')
     A*                                      G = GOH
     A*                                      C = CTN
     A*                                      M = MISC
     A            GOHTYD         1          COLHDG('GOH' 'TYPE')
     A            TOTALD         9  2       COLHDG('EXTENDED' 'AMT')
     A* RATE CODE
     A            RATECD         1          COLHDG('RATE' 'CODE')
     A*                                      D = DISTANCE/MILEAGE
     A*                                      F = FLAT RATE
     A*                                      W = WEIGHT
     A*                                      Q = QUANTITY
     A*                                      M = MINIMUM CHARGE
     A* NEW 2/09                             T = TIME CHARGE(USE HOURS)
     A* GOODS CLASS
     A            CLASCD         4          COLHDG('GOODS' 'CLASS')
     A**********************************************************************
TRIP A*           CALL      -                CALL CHECK-IN FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0250000 010000 00005
     A*         R CALLFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CALL_MF02
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CALL_MF03
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CALL_MF04
    * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CLONE FILE CCAL
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CALL_CCAL
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CALL_CCAL2
     A*
     A            ACTVCK         1          COLHDG('ACTIVE' 'CODE')
     A            DIV##K         4          COLHDG('DIVISION' 'NUMBER')
TRIP A            TRIP#K         7  0       COLHDG('TRIP' 'NUMBER')
     A            TRNCDK         2          COLHDG('TRANS.' 'TYPE')
     A*                                       AV=ADVANCE
     A*                                       CC=CHECKCALL
     A*                                       DL=DELIVERY
     A*                                       DH=DROP&HOOK
     A*                                       EX=EXPENSE
     A*                                       LD=LOADED
     A*                                       MS=MISC
     A*                                       PU=PICKUP
     A*                                       RH=RETURN HOME
     A*                                       RT=ROUTING STOP
     A*                                       SP=SPOT
     A*                                       T =TCALL
     A            LOCCDK         6          COLHDG('LOCATION')
     A            CTYCDK         4          COLHDG('CITY CDOE')
     A            STACDK         2          COLHDG('STATE CDOE')
     A            PLACEK        20          COLHDG('LOCATION')
     A            CALDTK          L         COLHDG('CALL' 'DATE')
     A            CALTMK         4  0       COLHDG('CALL' 'TIME')
     A            AMOUNK         7  2       COLHDG('AMOUNT')
     A            ENTDTK          L         COLHDG('ENTRY' 'DATE')
     A            ENTTMK         4  0       COLHDG('ENTRY' 'TIME')
     A            COMMTK        45          COLHDG('COMMENTS')
     A            ARVTMK         4  0       COLHDG('ARRIVAL' 'TIME')
     A            STRTMK         4  0       COLHDG('START' 'TIME')
     A            DPTTMK         4  0       COLHDG('DEPART' 'TIME')
     A            SCAC1K         4          COLHDG('SCAC1')
     A            SCAC2K         4          COLHDG('SCAC2')
     A            EQIP1K         8          COLHDG('TRAILER1')
     A            EQIP2K         8          COLHDG('TRAILER2')
     A            DSCAC1K        4          COLHDG('DROP' 'SCAC1')
     A            DSCAC2K        4          COLHDG('DROP' 'SCAC2')
     A            DEQIP1K        8          COLHDG('DROP' 'TRAILER1')
     A            DEQIP2K        8          COLHDG('DROP' 'TRAILER2')
     A            ORDERK         7  0       COLHDG('ORDER#')
     A            LTRSNK         3          COLHDG('LATE REASON' 'CODE')
NC22 A            ARVDTK          L         COLHDG('ARIV' 'DATE')
NC22 A            STRDTK          L         COLHDG('START' 'DATE')
NC22 A            DPTDTK          L         COLHDG('DEPART' 'DATE')
     A**********************************************************************
     A*           COMP      -                COMPANY MASTER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002000 001000 00010
     A*         R COMPFM
     A*
     A            ACRECCO        1          COLHDG('ACTIVE' 'CODE')
     A            COMP#CO        3          COLHDG('COMPANY')
     A            CONAMCO       66          COLHDG('NAME')
     A            ADDR1CO       35          COLHDG('ADDRESS')
     A            CCITYCO       16          COLHDG('CITY')
     A            STATECO        2          COLHDG('STATE')
     A            ZIPCDCO        5  0       COLHDG('ZIP')
NC01 A            APCOMPO        1  0       COLHDG('AP COMP')
NC01 A            NAITACO        5  0       COLHDG('NAIT' 'ACCT')
ML   A* FUEL SURCHARGE CUST PROFILE CODE(3/2005)
ML   A            FSCPRFO        4          COLHDG('DEFAULT' 'FSC PROFILE')
     A**********************************************************************
     A*           CONS      -                CONSIGNEE FILE (DISPATCH)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0015000 001000 00005
     A*         R CONSFM
     A*
     A            ACREC9         1          COLHDG('ACTIVE' 'CODE')
     A            CONS#9         5  0       COLHDG('CONS #')
     A            ACCT#9         5  0       COLHDG('BILL TO' 'ACCT')
     A            CONSN9        25          COLHDG('CONSIGNEE NAME')
     A            ADDRC9        25          COLHDG('STREET' 'ADDRESS')
     A            CITYC9        16          COLHDG('CITY')
     A            STATE9         2          COLHDG('STATE')
     A            ZIPCD9         5  0       COLHDG('ZIP')
     A*
     A* SPECIAL OPTIONS FOR DISPATCH CONSIGNEES
     A            DISPA9         1          COLHDG('DISP' 'CONS')
     A*                                        Y = YES
     A*                                        E = EXCLUSIVE (N/A WEB)
     A            VERPO9         1          COLHDG('VERIFY' 'PO')
     A*                                        Y = YES
     A            PPDCO9         1          COLHDG('PPD/COL')
     A*                                        P = PREPAID, C = COLLECT
     A            CDACT9         1          COLHDG('CONSOL' 'ACCT')
     A*                                        Y = YES
     A* FOLOWING CODE ALLOWS ONLINE CONSOLIDATION
     A            ONLIN9         1          COLHDG('ONLINE' 'CONS')
     A*                                        Y = YES
     A* FOLOWING CODE ALLOWS CONSOLIDATION P/U'S
     A            CONPU9         1          COLHDG('CONS' 'P/U')
     A*                                        Y = YES
     A* VALID GOH CODES FOR CONSOLIDATION P/U'S
     A            VALID9        10          COLHDG('VALID' 'CODES')
     A* BUILDING CODE FOR TERMINAL LOCAL DISPATCH
     A            BUILD9         1          COLHDG('BLDG' 'CODE')
     A*
     A* NOT IN USE SINCE 3/05/08 ML - USE CUST / COMP ¬¬¬¬¬¬¬¬¬¬¬¬¬
     A* FUEL SURCHARGE PCT (2/2000)
     A            FSCPC9         3  3       COLHDG('FUEL' 'SURCHG%')
     A* ¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     A* NEW FIELDS ADDED 4/2003 FOR ENHANCEMENTS TO PICK UP SYSTEM
     A* PURCHASE ORDER MAX LENGTH
     A            POLEN9         2  0       COLHDG('PO' 'MAX LEN')
     A* PO SHIP AND CANCEL DATE ALLOWANCE
     A            SHDTA9         2  0       COLHDG('SHIP' 'DATE ALOW')
     A            CADTA9         2  0       COLHDG('CNCL' 'DATE ALOW')
     A* AUTHORIZATION #
     A            AUTH#9         1          COLHDG('AUTHORIZATION#')
     A*                                        N = NOT ALLOWED
     A*                                        R = REQUIRED
     A*                                        O = OPTIONAL
     A* DEPT # REQUIRED
     A            DEPT#9         1          COLHDG('DEPT#' 'REQ')
     A*                                        Y = DEPARTMENT # REQUIRED
     A* DEPARTMENT STORE CORP GROUP CODE
     A            GROUP9         4          COLHDG('GROUP' 'CODE')
     A* FEDERATED SUB-GROUP CODE  - FEDERATED ONLY
     A            FEDGR9         8          COLHDG('FED-GROUP' 'CODE')
     A* SUB GROUP CODE - TJ MAX DIVISIONS ONLY
     A            SUBGR9         1          COLHDG('SUB-GROUP' 'CODE')
     A*                                        W = WINNERS
     A*                                        H = HOME GOOODS
     A*                                        A = AJ WRIGHT
     A*                                        T = TJMAX
     A*                                        M = MARSHALLS
     A* PURCHASE ORDER POSTIONAL DIGIT EDIT - IF NON-BLANK
     A            POVAL9        15          COLHDG('PO DIGIT CHK')
     A* AGGREGATE GROUP CODE - WHAT COMBINES ON ONE PRO FOR RATING
     A            AGGGR9         4          COLHDG('AGG-GROUP' 'CODE')
     A* CONSIGNEE DESTINATION TERMINAL CODE -
     A            DTERM9         4          COLHDG('DEST' 'TERMINAL')
     A* FOLLOWING FIELDS USED FOR IMPORT CONTAINER CHARGES -
     A            IMPRT9         1          COLHDG('IMPORT' 'CONS')
     A*                                        Y = YES
     A            STAT19         2          COLHDG('STATE' 'CODE1')
     A            RATE19         7  2       COLHDG('RATE' 'CODE1')
     A            STAT29         2          COLHDG('STATE' 'CODE2')
     A            RATE29         7  2       COLHDG('RATE' 'CODE2')
     A*
     A* FIELDS REASSIGNED - USED FOR CONT CLEAN TRUCK FEE - 10/22/10
     A* AND NUMBER OF DAYS FROM PU TO RETURN IF NOT DEFAULT
     A            STAT39         2          COLHDG('NUM' 'DAYS')
     A            RATE39         7  2       COLHDG('CTF' 'FEE')
     A* PO BREAKDOWN NOT REQUIRED -
     A            BRKPO9         1          COLHDG('PO' 'BREAKDWN')
     A*                                        N = NOT REQUIRED
     A* FOLLOWING FIELDS USED FOR IMPORT CONTAINER CHARGES -
     A* THESE ARE USED FOR THE RATES FOR CORESPONDING STATE FOR POE'S
     A            RATP19         7  2       COLHDG('RATE' 'CODE1P')
     A            RATP29         7  2       COLHDG('RATE' 'CODE2P')
     A* FIELD REASSIGNED - USED FOR CONT OFF PEAK CHARGE - 10/22/10
     A            RATP39         7  2       COLHDG('OFF PEAK' 'FEE')
     A* FOLLOWING FIELDS USED FOR CONTAINER CONSOLIDATION RATE -
     A            RATCO9         7  3       COLHDG('RATE' 'CONS')
     A            CAP$$9         7  2       COLHDG('MAX' 'CHARGE')
     A            CALCM9         1          COLHDG('CALC' 'METHOD')
     A*                                       ' '= NO CONS CHARGE
     A*                                        C = BY CTN
     A*                                        W = BY WGT   (WGT/100)
     A*                                        M = BY METER (CUBIC)
PR07 A*                                        T = TRANSLOAD ON DRAY BILL
     A* NC: FSC FIELDS ARE OBSOLETE
     A* NOT IN USE SINCE 3/05/08 ML - USE CUST / COMP ¬¬¬¬¬¬¬¬¬¬¬¬¬
     A* FUEL SURCHARGE CUST PROFILE CODE(3/2005)
     A            FSCRP9         4          COLHDG('REG.FUEL' 'PROFILE')
     A            FSCCP9         4          COLHDG('CONT.FUEL' 'PROFILE')
     A* ¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     A            LOCAT9         6          COLHDG('LOCATION' 'CODE')
     A*
     A* NON CONSOLIDATE RATE CODE (NEW FIELD DEF IS PRE-PAID CODE)
     A            NCRCD9         3  0       COLHDG('NCR' 'CODE')
     A* INDIVIDUAL PU PRO
     A            INDPRO9        1          COLHDG('IND' 'PU PRO')
     A*                                        Y = YES
     A* CONTAINER PRE-PULL LOCATION AND RATE
     A            PRPLLO9        6          COLHDG('PREPULL' 'LOCAT')
     A            PRPRAT9        7  2       COLHDG('PREPULL' 'RATE')
     A*
     A* ADDITIONAL SSL PRO
     A            SSLPRO9        1          COLHDG('SSL' 'PRO')
     A*                                        Y = YES
     A* APPOINTMENT CHARGE
     A            APTCHG9        5  2       COLHDG('APPT' 'CHARGE')
     A*                                        Y = YES
     A* APPOINTMENT CHARGE
     A            CONCHG9        5  2       COLHDG('CONGESTION' 'CHARGE')
     A* CUSTOMER CODE FOR YARD SYSTEM
     A            YRDCUS9        2          COLHDG('YARD' 'CUST' 'CODE')
     A* WEEKEND/ HOLIDAY SURCHARGE
     A            WKECHG9        5  2       COLHDG('WEEKEND' 'CHARGE')
     A**********************************************************************
     A*           CUST      -                CUSTOMER MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R CUSTFM
     A*
     A            ACRECA         1          COLHDG('UPDATE' 'CODE')
     A            ACCT#A         5  0       COLHDG('ACCOUNT #')
     A            NAMEAA        25          COLHDG('NAME')
     A            ADDR1A        25          COLHDG('ADDRESS 1')
     A            ADDR2A        25          COLHDG('ADDRESS 2')
     A            ADDR3A        25          COLHDG('ADDRESS 3')
     A            STATEA         2          COLHDG('STATE')
     A            ZIPCDA         5          COLHDG('ZIP' 'CODE')
     A* CONTACT
     A            CNAMEA        22          COLHDG('CONTACT' 'NAME')
     A            CPHN1A         3  0       COLHDG('CONTACT' 'PHONE#' 'AREA CD')
     A            CPHN2A         3  0       COLHDG('CONTACT' 'PHONE#' 'PREFIX')
     A            CPHN3A         4  0       COLHDG('CONTACT' 'PHONE#' 'SUFFIX')
     A            FAXPHA        10          COLHDG('FAX NUMBER')
     A* BALANCES
     A            YTDSLA         9  2       COLHDG('Y-T-D' 'SALES')
     A            MTDSLA         9  2       COLHDG('M-T-D' 'SALES')
     A            ARBALA         9  2       COLHDG('A/R' 'BALANCE')
     A* A/R AGING
     A            ARB00A         9  2       COLHDG('CURRENT' 'BALANCE')
     A            ARB30A         9  2       COLHDG('OVER/30' 'BALANCE')
     A            ARB45A         9  2       COLHDG('OVER/45' 'BALANCE')
     A            ARB60A         9  2       COLHDG('OVER/60' 'BALANCE')
     A            ARB90A         9  2       COLHDG('OVER/90' 'BALANCE')
     A            ATBSEA         1          COLHDG('SELECTED' 'FOR AGE' 'TRIAL')
     A* COLLECTIONS CODES
     A            DUNNGA         1          COLHDG('PREVENT' 'DELETE')
     A*                                        Y = DO NOT DELETE CUST
     A            REPINA         1          COLHDG('INTERNAL' 'COLLECTION REP')
     A            GEOGRA         1          COLHDG('GEOGRAPHICAL AREA')
     A            STREPA         1  0       COLHDG('STATE REPRESENATIVE')
     A            REPEXA         2  0       COLHDG('EXTERNAL' 'COLLECTION REP.')
     A            ORIGNA         2          COLHDG('GROUP' 'CODE')
     A            GROUPA         4          COLHDG('SUB' 'GROUP')
     A* SALESMAN FIELDS
     A            SLSM#A         2  0       COLHDG('SALESMAN' 'NUMBER')
     A            SLSTPA         1  0       COLHDG('SALESMAN' 'TYPE')
     A            SLSRGA         1  0       COLHDG('SALESMAN' 'REGION')
     A            SLSMSA         1          COLHDG('SALESMAN' 'MISC.')
     A*                                     TO BE USED AT LATER DATE
     A* TERMS OF COLLECTION
     A            CRBALA         9  2       COLHDG('CREDIT' 'LIMIT')
     A            CRSTSA         1          COLHDG('STOP' 'CREDIT' 'FLAG')
     A*                                        Y = STOP CREDIT
     A            COLTRA         1          COLHDG('COLLECTION' 'TERMS')
     A*                                          = NORMAL STATUS
     A*                                        C = COLLECTION AGENCY
     A*                                        L = LEGAL LETTER
     A*                                        P = PROBLEM ACCOUNT
     A            COLCCA         1S 0       COLHDG('STATUS' 'CENT')
     A            COLYYA         2S 0       COLHDG('STATUS' 'YEAR')
     A            COLMMA         2S 0       COLHDG('STATUS' 'MONTH')
     A            COLDDA         2S 0       COLHDG('STATUS' 'DAY')
     A*
     A* MISC. ACCOUNT STATUS INFORMATION
     A            INTERA         1          COLHDG('INTER-COMPANY' 'ACCOUNT')
     A*                                        I = INTER-COMPANY ACCOUNT
     A            DONOTA         1          COLHDG('DO NOT USE' 'CODE')
     A*                                        N = DO NOT USE
     A            PODRQA         1          COLHDG('POD' 'CODE')
     A*                                        P = POD REQUIRED
     A*                                        S = SPECIAL
     A            PODETA         1          COLHDG('PO' 'CODE')
     A            EDICDA         1          COLHDG('EDI' 'CODE')
     A*                                        S = SPECIAL
     A* ADDED 11/02 FOR LAWSON INTERFACE - INTERCOMPANY ACCOUNTS ONLY
     A* INTERCOMPANY G/L AND COMPANY GROUP CODE (IE. KEY,NRT)
     A            INTGLA         6  0       COLHDG('G/L' 'CODE')
     A            INTCOA         3          COLHDG('COMP' 'CODE')
     A* FUEL SURCHARGE CUST PROFILE CODE (3/2005)
     A            FSCRPA         4          COLHDG('REG.FUEL' 'PROFILE')
     A            FSCCPA         4          COLHDG('CONT.FUEL' 'PROFILE')
     A* CUST CODE FOR STORE ASSOCIATION
     A            CCODEA         2          COLHDG('CUST' 'CODE')
     A* FLAG TO USE / NOT USE CLASS MULTIPLIER
     A            MLTFLA         1          COLHDG('MULT' 'FLAG')
     A*                                        Y = USE CLASS MULTIPLIER
     A* MILER CALCULATOR TOOL ID
NC12 A            MILERA         1          COLHDG('MILER' 'TOOL ID')
     A            FPRODA          L         COLHDG('FIRST PRO' 'DATE')
     A                                      DFT('0001-01-01')
     A            PCMVRA         2          COLHDG('PCM' 'VERSION')
     A            PCMOPA         1          COLHDG('PCM' 'OPTION')
     A**********************************************************************
TRIP A*           DISP      -                DISPATCH FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R DISPFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DISPWORK
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DISP_MF1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DISP_MF2
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DISP21 (???)
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO OL826WF
     A*
     A            ACRECDI        1          COLHDG('ACTIVE' 'CODE')
     A            ORDERDI        7  0       COLHDG('ORDER')
     A            DISP#DI        1S 0       COLHDG('DISP#')
     A            DIVI#DI        4          COLHDG('DIVISION')
TRIP A            TRIP#DI        7  0       COLHDG('TRIP#')
     A            DISDTDI         L         COLHDG('DISPATCH' 'DATE')
     A            DISTMDI        4  0       COLHDG('DISPATCH' 'TIME')
     A*
     A* DRIVER(S)
     A            DRIV1DI        6          COLHDG('DRIVER')
     A            DRIV2DI        6          COLHDG('DRIVER2')
     A*
     A* ROUTE INFO
     A            ROUTEDI       70          COLHDG('ROUTE LINE')
     A            LDSTSDI       10          COLHDG('MT/LD FLAGS')
     A*                                       E = EMPTY
     A*                                       L = LOADED
     A            ZIPCDDI       50          COLHDG('ROUTE ZIPS')
     A* USER'S MILES AND SETTLED STATUS
     A            MILESDI        5  0       COLHDG('TOTAL' 'USER MILES')
     A            EMPTYDI        5  0       COLHDG('EMPTY' 'USER MILES')
     A            MILIFDI        1          COLHDG('MILES' 'INTERFACE')
     A*                                       P = PC MILER, R=RAND MC
     A            SETSTDI        1          COLHDG('SETTLED' 'STATUS')
     A*                                       S = SETTLED
     A*
     A* EQUIPMENT
     A            UNIT#DI        6          COLHDG('UNIT#')
     A*
     A            STAT1DI        1          COLHDG('DISPATCH' 'STATUS')
     A*                                       D = DISPATCHED, E=EMPTIED
     A*                                       C = COMPLETED
     A            LOCNMDI       20          COLHDG('LOCATION' 'NAME')
     A* DRIVERS HOME DIVISION AT THE TIME OF DISPATCH
     A            HDIV1DI        6          COLHDG('1ST DRIVER' 'HOME DIVISION')
     A            HDIV2DI        6          COLHDG('2ND DRIVER' 'HOME DIVISION')
     A* ADDITIONAL MILES
     A            ADDMIDI        5  0       COLHDG('ADDITIONAL' 'MILES')
     A* FUEL/OIL USAGE
     A            FUELGDI        5  0       COLHDG('GALLONS' 'OF FUEL')
     A            FUELCDI        7  2       COLHDG('TOTAL' 'FUEL COST')
     A            OILQTDI        2  0       COLHDG('QUARTS' 'OF OIL')
     A            OILCSDI        7  2       COLHDG('TOTAL' 'OIL COST')
     A* HANDLED
     A            CTNCNDI        5  0       COLHDG('CTN' 'COUNT')
     A            WEIGHDI        5  0       COLHDG('WEIGHT')
     A* CALCULATED TOTAL MILES
     A            CALCMDI        5  0       COLHDG('TOTAL' 'CALCULATED MILES')
     A* SUGGESTED AMOUNT
     A            SUGAMDI        7  2       COLHDG('S/H SUGGESTED' 'AMOUNT')
NC34 A            DI1DTDI         L         COLHDG('1ST DISP' 'DATE')
NC34 A                                      DFT('0001-01-01')
NC34 A            DI1TMDI        4  0       COLHDG('1ST DISP' 'TIME')
NC34 A                                      DFT(0)
     A* CALCULATED ACTUAL MILES
     A            #LOADDI        5  0       COLHDG('ACTUAL' 'LOADED' 'MILES')
     A            #EMPTDI        5  0       COLHDG('ACTUAL' 'EMPTY' 'MILES')
     A* NIGHT JOB FLAGS
     A            #DATEDI        1          COLHDG('DATES' 'DONE')
     A*                                      '*' = DI1DTDI/DI1TMDI AND
     A*                                     DISDTDI/DISTMDI ARE ACCURATE...
     A            #MILEDI        1          COLHDG('MILES' 'DONE')
     A*                                      '*' = #LOADDI AND #EMPTDI
     A*                                     ARE ACCURATE...
     A            TOD##DI        7  0       COLHDG('TOUR' 'DUTY#')
     A**********************************************************************
TRIP A*           DISX      -                DISPATCH EXTENSION FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R DISXFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DISXWORK
     A*
     A            ACRECDX        1          COLHDG('ACTIVE' 'CODE')
     A            ORDERDX        7  0       COLHDG('ORDER')
     A            DISP#DX        1S 0       COLHDG('DISP#')
     A            DIVI#DX        4          COLHDG('DIVISION')
TRIP A            TRIP#DX        7  0       COLHDG('TRIP#')
     A            DRCODDX        6          COLHDG('DRIVER' 'CODE')
     A            EXP$$DX        7  2       COLHDG('EXPENSE' 'AMOUNT')
     A            EXPCDDX        4          COLHDG('EXPENSE' 'CODE')
     A***                                   REPR = REPAIR
     A***                                   MEAL = MEALS
     A***                                   MOTL = MOTEL
     A***                                   FUEL = FUEL
     A***                                   TOLL = TOLLS
     A***                                   UNLD = UNLOAD
     A***                                   FINE = FINES
     A***                                   MISC = MISCELLANEOUS
     A***                                   WASH = WASH
     A***                                   TIRE = TIRES
     A***                                   PERM = PERMIT
NC43 A            DISXPDX        1          COLHDG('PAID')
NC43 A***                                   'P' = PAID
NC43 A***                                   ' ' = NOT PAID
     A**********************************************************************
     A*           DIST      -                DISTRIBUTION MASTER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000300 00003
     A*         R DISTFM
     A*
     A            ACRECB         1          COLHDG('ACTIVE' 'CODE')
     A            DIST#B         6          COLHDG('DISTRIBUTION' 'ID')
     A            ORIGNB         4          COLHDG('ORIGIN' 'TERMINAL')
     A            SHIP#B         6          COLHDG('SHIPPER/' 'CONSIGNEE')
     A            ACCT#B         5  0       COLHDG('BILL TO' 'ACCT')
     A            PAYCOB         1          COLHDG('PPD/COL')
     A            FSCPCB         3  3       COLHDG('FUEL' 'SURCHG%')
     A*                                     % OF REV. IF FSCCCB = ' '
     A*                                     AMT BY CARTON IF FSCCCB='C'
     A*                                     AMT BY MILES  IF FSCCCB='M'
     A            ACCT2B         5  0       COLHDG('2ND BILL' 'ACCT')
     A            DUPBLB         1          COLHDG('DUP B/L' 'FLAG')
     A*                                       Y = ALLOW DUPLICATE B/L'S
     A            RECT#B         7  0       COLHDG('LAST' 'RECEIPT')
     A            KMSPEB         1          COLHDG('KMART  ' 'FLAG')
     A*                                       Y = PRINT CONSTANT SPECIAL
     A*                                           INSTRUCTIONS FOR KMART
     A            FSCCCB         1          COLHDG('FUEL' 'SURCHG CD')
     A*                                         = BY %
     A*                                       C = BY CARTONS
     A*                                       M = BY MILES
     A            LBL01B        10          COLHDG('SPECIAL' 'LABEL1')
     A            LBL02B        10          COLHDG('SPECIAL' 'LABEL2')
     A            LBL03B        10          COLHDG('SPECIAL' 'LABEL3')
     A*
     A            CONSCB         5  2       COLHDG('CONS' 'CHARGE')
     A            STOP$B         5  2       COLHDG('STOP' 'CHARGE')
     A            HAND$B         5  3       COLHDG('HANDLING' 'CHARGE')
     A*                                                                T
     A            PROPTB         1          COLHDG('PROCESS' 'OPTION')
     A*                                         = REGULAR PROCESS
     A*                                       Y = HANDLING CHARGE ONLY
     A* FUEL SURCHARGE DIST ID PROFILE CODE(04/2005)
     A            FSCRPB         4          COLHDG('DIST.FUEL' 'PROFILE')
     A            TIME1B         4  0       COLHDG('TIME1')
     A            TIME2B         4  0       COLHDG('TIME2')
     A            DTYPEB         1          COLHDG('DC CODE')
     A*                                          = STORE
     A*                                        W = WAREHOUSE
     A*                                        T = TERMINAL
     A            RATE1B         6  2       COLHDG('RATE CODE')
     A            RATE2B         6  2       COLHDG('RATE CODE')
     A            LUNLDB         1          COLHDG('LIVE' 'UNLOAD')
     A            DUNLDB         1          COLHDG('DRIVER' 'UNLOAD')
     A            CCODEB         2          COLHDG('CUST' 'CODE')
     A            SVCPCB         3  1       COLHDG('SERVICE' 'CHG%')
     A*                                     % OF 1ST BLDT LINE
     A**********************************************************************
TRIP A*           DIVI      -               DIVISION MASTER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000025 00002
     A*         R DIVIFM
     * NO CHANGES BUT RECOMPILATION REQUIRED FOR PUHD_LOCT1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO EFSC
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DIVI_EFSC
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO EZ060WF
     A*
     A            ACREC1A        1          COLHDG('ACTIVE' 'CODE')
     A*                                          = ACTIVE
     A*                                        I = INACTIVE
     A            DIV##1A        4          COLHDG('DIVISION#')
     A            DIVNM1A       32          COLHDG('DIVISION' 'NAME')
     A            LOCAT1A        6          COLHDG('LOCATION CODE')
     A            COMPC1A        3          COLHDG('COMPANY' 'CODE')
     A            COMP#1A        5  0       COLHDG('COMP' 'NO.')
     A*           FOR LAWSON                KEY/MIT/NRT = 1 CCM = 1000
     A            GROUP1A        4          COLHDG('GROUP' 'CODE')
     A            COSTC1A        3  0       COLHDG('COST CENTER' 'NOT USED')
     A* LAST TRIP # USED
TRIP A*****       TRIP#1A        7  0       COLHDG('LAST' 'TRIP#')
     A* CONTAINER NOTIFICATION FINALIZED
     A            NOTEF1A        1          COLHDG('NOTIFICATION' 'FLAG')
     A*                                          = NOT FINALIZED
     A*                                        F = FINALIZED
     A            ALLWPU1A       1          COLHDG('ALLOW' 'PICKUP')
     A*                                          = NOT ALLOW
     A*                                        Y = ALLOW
     A* PAYROLL PARAMETERS -
     A            INHSE1A        1          COLHDG('INHOUSE' 'PAYROLL')
     A*                                        I = INHOUSE PAYROLL
     A*                                          = NO PAYROLL
     A            PAYMI1A        3          COLHDG('PAY' 'MILES')
     A*                                          HMG OR HUB
     A            RDMIN1A        3  0       COLHDG('ROAD MIN' 'MILES')
     A*            DESC: MIN MILES NEEDED TO DETERMINE ROAD/HOURLY BASIS
     A*
     A* VACATION/HOLIDAY/SICK/PERSONAL
     A            VABAS1A        1          COLHDG('VACATION' 'BASIS')
     A*                                       $=AMT H=HOURLY G=GROSS
     A            VACPY1A        5  2       COLHDG('VACATION' 'PAY')
     A            SIBAS1A        1          COLHDG('SICK PAY' 'BASIS')
     A*                                       $=AMT H=HOURLY
     A            SICPY1A        5  2       COLHDG('SICK' 'PAY')
     A            HOBAS1A        1          COLHDG('HOLIDAY' 'BASIS')
     A*                                       $=AMT H=HOURLY
     A            HOLPY1A        5  2       COLHDG('VAC/HOL' 'PAY')
     A*
     A* VACATION SCALES. ARRAYS OF SERVICE YRS/DAYS
     A* VACATION AND PERSONAL DAY ARRAYS = 5 X 3P
     A            VACYR1A       10          COLHDG('VACATION' 'YRS')
     A            VACDA1A       10          COLHDG('VACATION' 'DAYS')
     A            SICYR1A       10          COLHDG('SICK/PER' 'YRS')
     A            SICDA1A       10          COLHDG('SICK/PER' 'DAYS')
     A* ALTERNATE VACATION SCALES. ARRAYS OF SERVICE YRS/DAYS
     A            VACY21A       10          COLHDG('ALT VAC' 'YRS')
     A            VACD21A       10          COLHDG('ALT VAC' 'DAYS')
     A            ALTDTPA         L         COLHDG('ALTERNATE' 'DATE')
     A*
     A* INCENTIVES
     A            MINMI1A        5  0       COLHDG('INCENT MIN MILES')
     A            IMILR1A        5  4       COLHDG('INCEN MILE' 'RATE')
     A            MINQH1A        7  0       COLHDG('MIN QTY' 'INCENT')
     A            IQTYR1A        5  5       COLHDG('INCEN QTY' 'RATE')
     A*
     A* PENSION/RETIREMENT
     A            PEBAS1A        1          COLHDG('PENSION' 'BASIS')
     A*                                       $ = AMT,  H = HOURLY
     A            PERAT1A        5  4       COLHDG('PENSION' 'RATE/HR')
     A            PEMXH1A        3  1       COLHDG('PENSION' 'MAX HRS')
     A            PECON1A        5  2       COLHDG('PENSION' 'CONTRIBUTION')
     A*
     A* UNION CODE
     A            UNCDE1A        4          COLHDG('UNION' 'CODE')
     A*
     A* PAYROLL RUN CONTROLS
     A            LPDTE1A         L         COLHDG('LAST PYRLL' 'DATE')
     A            PYOPT1A        1          COLHDG('PAYROLL' 'OPTION')
     A*                                        F = FINAL RUN
     A*                                        T = TRIAL RUN
     A            HOLPD1A       14          COLHDG('HOLIDAYS' 'PAID')
     A*     NOTE: REPRESENTED BY ARRAY OF 14 HOLIDAYS PAID FOR DIVISION
     A*
     A* SETTLEMENT DIVISION (PAYROLL FOR O/O, RAILROAD)
     A            SETTM1A        1          COLHDG('SETTLEMENTS')
     A*                                        Y = HAS SETTLEMENTS
     A            FRDTX1A        5  2       COLHDG('FUEL&RD' 'TAX DED')
     A*
     A*
     A* MILEAGE INTERFACE
     A            MILEI1A        1          COLHDG('MILEAGE' 'INTERFACE')
     A*                                        P = PC MILER
     A*                                        R = RAND MCNALLY
     A* PRINTING CONTROLS
     A            OUTQZ1A        6          COLHDG('OUTPUT' 'QUEUE')
     A            PRINT1A       10          COLHDG('WKSTN' 'PRINTER')
     A            OUTQ21A        6          COLHDG('OUTPUT' 'QUEUE')
     A            PRIN21A       10          COLHDG('WKSTN' 'PRINTER')
     A            IPDSP1A        1          COLHDG('IPDS' 'PRINTER')
     A*                                        Y = IPDS PRINTER
     A            PRNTY1A        1          COLHDG('PRINTER' 'TYPE')
     A*                                        L = LOCAL
     A*                                        R = REMOTE
     A            REPT#1A        5  0       COLHDG('LAST' 'REPORT#')
     A* LAST DELIVERY MANIFEST PRINTED
TRIP A****        TRPRT1A        7  0       COLHDG('TRIP' 'LAST PRT')
     A* LAST UPDATE & OPERATOR
     A            CDATE1A        6S 0       COLHDG('LAST CHANGED')
     A            INITS1A        3          COLHDG('OPERATOR')
     A            CNTNM1A       20          COLHDG('CONTACT' 'NAME')
     A            CNTPH1A       10S 0       COLHDG('CONTACT' 'PH#')
     A            CNTEM1A       30          COLHDG('EMAIL' 'ADDR')
     A            TMVAR1A        1S 0       COLHDG('TIME' 'VARIANCE')
     A* BILLTO ADDED FOR FLEET
     A            BILTO1A        5  0       COLHDG('FLEET' 'BILLTO')
     A            FLEET1A        1          COLHDG('FLEET')
     A*                                          = NO
     A*                                        Y = YES
     A            TANRT1A        5  5       COLHDG('TANDEM' 'RATE')
     A            TEAMF1A        5  4       COLHDG('TEAM MILES' 'FACT')
     A            LOCT#1A        5  0       COLHDG('LOCATION' 'NO.')
     A            OLDDV1A        2          COLHDG('OLD TERM#' 'NOT USED')
     A* 08/03/07
     A            SUMMQ1A       10          COLHDG('SUMMARY' 'QUEUE')
     A            KRONO1A        1          COLHDG('PAID BY' 'KRONOS')
     A*                                          = NO
     A*                                        Y = YES
     A* APPROVAL FOR "S" FINAL RUN - DATE AND USER
     A            APDTS1A         L         COLHDG('S APPROVAL' 'DATE')
     A                                      DFT('0001-01-01')
     A            APUSS1A       10          COLHDG('S APPROVAL' 'USER')
     A* APPROVAL FOR FINAL RUN - AUTHORIZED USERS
     A            APUS11A       10          COLHDG('APPROVAL' 'USER 1')
     A            APUS21A       10          COLHDG('APPROVAL' 'USER 2')
     A            APUS31A       10          COLHDG('APPROVAL' 'USER 3')
     A* APPROVAL FOR "V" FINAL RUN - MIRROR OF APDTS1A/APUSS1A
     A            APDTV1A         L         COLHDG('V APPROVAL' 'DATE')
     A                                      DFT('0001-01-01')
     A            APUSV1A       10          COLHDG('V APPROVAL' 'USER')
     A            NEWCC1A        4          COLHDG('NEW COST' 'CENTER')
     A*
NC39 A            MINPY1A        5  2       COLHDG('MIN' 'PAY')
NC39 A            MAXPC1A        2S 0       COLHDG('MAX%' 'MILE INCR')
     A*
     A            ADDPY1A        5  2       COLHDG('ADD' 'PAY')
     A            ADDYR1A        2S 0       COLHDG('ADD' 'YRS SVC')
     A*
GC03 A* NEW FIELDS FOR NEW SICK ACCRUAL RULES - JUNE 2015
GC03 A            SICRU1A        1          COLHDG('SICK' 'RULES')
GC03 A*                                       ' ' = NO SICK RULES
GC03 A*                                       'C' = CALIFORNIA
GC03 A*                                       'M' = MASSACHUSETTS
GC03 A*                                       'P' = PHILADELPHIA
GC03 A*                                       'D' = DRIVER LEVEL
GC03 A            SICDT1A         L         COLHDG('SICK' 'START' 'DATE')
GC03 A                                      DFT('0001-01-01')
GC03 A            SICHR1A        5  2       COLHDG('SICK' 'START' 'HOURS')
GC04 A            SPCPY1A        2          COLHDG('SPECIAL' 'PAY' 'RULES')
     A            STOPY1A        5  2       COLHDG('STOP' 'PAY')
     A**********************************************************************
TRIP A*           DRIV      -                DRIVER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 001000 00003
     A*         R DRIVFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DRIV06
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_DRIV1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_DRIV2
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO MAN_ORD_DR
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO EFSD
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DRIV_EFSD
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DRIV_EFSD2
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DRIV_EFSD3
     A*
     A            ACRECDR        1          COLHDG('ACTIVE' 'CODE')
     A            EMPNODR        6          COLHDG('EMPLOYEE' 'CODE')
     A            TERM#DR        4          COLHDG('TERMINAL')
     A            COMP#DR        3          COLHDG('COMPANY')
     A            MANAGDR        6          COLHDG('MANAGER' 'CODE')
     A            TYPCDDR        1          COLHDG('TYPE' 'CODE')
     A*                                      'H' = HOUSE DRIVER
     A*                                      'O' = OWNER OPERATOR
     A*                                      'S' = SUB-HAULER
     A            GROUPDR        4          COLHDG('GROUP' 'CODE')
     A*                                      FOR NON HOUSE DRIVER TYPE ONLY
     A*                                      COX = COHEN EXPRESS
     A*                                      WMX =
     A            ENAMEDR       22          COLHDG('DRIVER' 'NAME')
     A            ADDR1DR       25          COLHDG('STREET')
     A            CITYPDR       16          COLHDG('CITY')
     A            STRESDR        2          COLHDG('STATE')
     A            ZIPCDDR        5  0       COLHDG('ZIP')
     A            ADDR3DR       20          COLHDG('APT ETC')
     A            PHONEDR       10          COLHDG('PHONE' 'NUMBER')
     A*
     A* DISPATCH DATA
     A            UNIT#DR        6          COLHDG('TRACTOR' 'NUMBER')
     A            LLOCADR        6          COLHDG('LAST' 'LOCATION')
     A            LCITYDR        4          COLHDG('LAST' 'CITY')
     A            LSTATDR        2          COLHDG('LAST' 'STATE')
     A            LSTDTDR         L         COLHDG('AVAILABLE' 'DATE')
     A            LSTTMDR        4  0       COLHDG('AVAILABLE' 'TIME')
     A            LOCATDR        6          COLHDG('LOCATION')
     A            CITYCDR        4          COLHDG('CITY' 'CODE')
     A            STATEDR        2          COLHDG('STATE')
     A            AVLDTDR         L         COLHDG('AVAILABLE' 'DATE')
     A            AVLTMDR        4  0       COLHDG('AVAILABLE' 'TIME')
     A            CORDRDR        7  0       COLHDG('CURRENT' 'ORDER')
     A            LORDRDR        7  0       COLHDG('LAST' 'ORDER')
     A*
     A* STATUS
     A            STAT1DR        1          COLHDG('STATUS' 'CODE')
     A*                                         = ACTIVE
     A*                                       T = TERMINATED
TRIP A            TRIP#DR        7  0       COLHDG('TRIP#')
     A            TRAL1DR        7          COLHDG('TRAILER1')
     A*
     A            ASNDVDR        4          COLHDG('ASSIGN' 'DIV')
     A            ASNDTDR         L         COLHDG('ASSIGN' 'DATE')
     A            TRAL2DR        7          COLHDG('TRAILER2')
     A            OOUNTDR        6          COLHDG('OWNER/OPERATOR' 'UNIT')
     A*
     A* FOLLOWING FIELDS USED FOR SUB-HAULERS ONLY - FOR SETTLEMENTS
NC04 A* (DO NOT USE SH RATE FIELDS)
NC04 A            RTRATDR        3  0       COLHDG('ROUTE' 'RATING %')
NC04 A            RCODEDR        4          COLHDG('RATE' 'CODE')
NC04 A            GOHR1DR        3  3       COLHDG('GOH A' 'RATE')
NC04 A            GOHR2DR        3  3       COLHDG('GOH B' 'RATE')
NC04 A            GOHR3DR        3  3       COLHDG('GOH C' 'RATE')
NC04 A            GOHR4DR        3  3       COLHDG('GOH D' 'RATE')
NC04 A            GOHR5DR        3  3       COLHDG('GOH E' 'RATE')
NC04 A            RTCAPDR        7  2       COLHDG('RATE' 'CAP')
NC04 A* (DO NOT USE SH RATE FIELDS)
     A            SUBGPDR        1          COLHDG('SUB' 'GROUP')
     A*                                      C  = COMPANY
     A*                                      I  = INDIVDUAL
     A            SCAC1DR        4          COLHDG('SCAC1' 'CODE')
     A            SCAC2DR        4          COLHDG('SCAC2' 'CODE')
     A            WASHDDR         L         COLHDG('WASHED' 'DATE')
     A            AS2NDDR        6          COLHDG('ASSND AS' '2ND DRIVER TO')
     A* FOLLOWING 3 FIELDS COPIED FROM PERS FOR DISPATCH
     A            REGRTDR        6  3       COLHDG('REGULAR' 'RATE')
     A            RATEMDR        6  5       COLHDG('RATE' 'MILE')
     A            TEAMRDR        6  5       COLHDG('TEAM' 'RATE/MI')
NC19 A            DSPGPDR        1          COLHDG('DISP' 'GRP')
NC28 A            ITMIDDR        4P 0       COLHDG('ITM' 'DRIV ID')
     A* NEW FIELDS FOR NEW SICK ACCRUAL RULES - JUNE 2015
GC03 A            SICRUDR        1          COLHDG('SICK' 'RULES')
GC03 A*                                       ' ' = NO SICK RULES
GC03 A*                                       'C' = CALIFORNIA
GC03 A*                                       'M' = MASSACHUSETTS
GC03 A*                                       'P' = PHILADELPHIA
     A            PRTTMDR        1          COLHDG('PART' 'TIME')
     A*                                       ' ' = FULL TIME
     A*                                       'P' = PART TIME
     A            TOD##DR        7  0       COLHDG('TOUR' 'DUTY#')
     A**********************************************************************
     A*           EXBR      -                EXPORT CONTAINER BROKER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R EXBRFM
     A*
     A            ACRECXB        1          COLHDG('ACTIVE' 'CODE')
     A            SHPORXB        6          COLHDG('SHIPPER OF' 'RECORD CODE')
     A            SHNAMXB       25          COLHDG('SHIPPER' 'NAME')
     A            PHONEXB       10          COLHDG('PHONE NUMBER')
     A            TERM#XB        4          COLHDG('TERMINAL')
     A            ADDR1XB       25          COLHDG('ADDRESS 1')
     A            ADDR2XB       25          COLHDG('ADDRESS 2')
     A            CITYCXB       16          COLHDG('CITY')
     A            STATEXB        2          COLHDG('STATE')
     A            ZIPCDXB        5  0       COLHDG('ZIP' 'CODE')
     A            BILLAXB        5  0       COLHDG('BILL TO' 'ACCOUNT#')
     A            OCNRLXB        1          COLHDG('OCEAN/RAIL')
     A**********************************************************************
     A*           EXCM      -                EXPORT CONTAINER COMMENTS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00010
     A*         R EXCMFM
     A*
     A            CONT#XC       11          COLHDG('CONTAINER #')
     A            TERM#XC        4          COLHDG('TERMINAL')
     A            BOOK#XC       15          COLHDG('BOOKING #')
     A            BOKDTXC        7  0       COLHDG('BOOKING' 'DATE')
     A            SEQ##XC        2S 0       COLHDG('SEQ' 'NUMBER')
     A            COMMTXC       70          COLHDG('MESSAGE')
     A**********************************************************************
     A*           EXPD      -                EXPORT CONTAINER DETAIL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 00005
     A*         R EXPDFM
     A*
     A            ACRECXD        1          COLHDG('ACTIVE' 'CODE')
     A*                                     ' ' = OPEN
     A*                                      R  = RETURNED
     A            TERM#XD        4          COLHDG('TERMINAL')
     A            CONT#XD       11          COLHDG('CONTAINER #')
     A            BOOK#XD       15          COLHDG('BOOKING #')
     A            BOKDTXD        7  0       COLHDG('BOOKING' 'DATE')
     A            REF##XD       17          COLHDG('REFERENCE#')
     A            REFQLXD        1          COLHDG('REFERECNCE' 'QUAL')
     A*                                       B=B/L, P=PO, L=LOAD#
     A*                                       A=APPT, R=REL#, M=MANF#
     A*                                       I=INTERCOMPANY REF#
     A*                                       C=CONTROL#  T=TRANSFER
     A            SHPORXD        6          COLHDG('SHIPPER OF' 'RECORD CODE')
     A            SALSDXD        7  0       COLHDG('LAST RETURN' 'DATE')
     A            MPLOCXD        6          COLHDG('MT PU' 'LOCATION CODE')
     A            LDLOCXD        6          COLHDG('LOAD' 'LOCATION CODE')
     A            FRLOCXD        6          COLHDG('FULL RETURN' 'LOC. CODE')
     A            DRLIVXD        1          COLHDG('DROP/LIVE' 'LOAD')
     A            STATSXD        2          COLHDG('STATUS')
     A            PMTDTXD        7  0       COLHDG('PU MT' 'DATE')
     A            LSCDTXD        7  0       COLHDG('LOAD SCHEDULE' 'DATE')
     A            DRPDTXD        7  0       COLHDG('DROP-OFF' 'DATE')
     A            PULDTXD        7  0       COLHDG('PU LOAD' 'DATE')
     A            DRTDTXD        7  0       COLHDG('DELIVERY/RETURN' 'DATE')
     A            CSIZEXD        2          COLHDG('CONTAINER' 'SIZE')
     A            CWGHTXD        6  0       COLHDG('CONTAINER' 'WEIGHT')
     A            CTYPEXD        2          COLHDG('CONTAINER' 'TYPE')
     A*                                     DV = STANDARD DRY VAN
     A*                                     HC = HIGH CUBE
     A*                                     RF = REFER
     A            HAZMTXD        1          COLHDG('HAZMAT' 'Y/N')
     A            ORDR1XD        7  0       COLHDG('ORDER# 1')
     A            CORD#XD        7  0       COLHDG('CONTAINER' 'ORDER#')
     A            EXPFLXD        1          COLHDG('EXPORT' 'FLAG')
PR04 A            APPT1XD        4  0       COLHDG('APPOINTMENT' 'TIME 1')
PR04 A            APPT2XD        4  0       COLHDG('APPOINTMENT' 'TIME 2')
NC41 A            CHASSXD       11          COLHDG('CHASSIS')
NC41 A*                                       4-PREFIX
NC41 A*                                       7-NUMBER
     A*
     A**********************************************************************
     A*           MANF      -                MANIFEST FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 025000 00005
     A*         R MANFFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO MAN_ORD_DR
     A*
     A            ACRECM         1          COLHDG('ACTIVE' 'REC CODE')
     A            MOVE#M         7  0       COLHDG('MOVE' 'NUMBER')
     A            MTYPEM         1          COLHDG('MANIFEST' 'TYPE')
     A*                                        Q = DISTRIBUTION MANIFEST
     A*                                        P = PICK-UP MANIFEST
     A*                                        L = LINE-HAUL MANIFEST
     A*                                        C = CONSOLIDATION MANIFEST
     A*                                        D = DELIVERY MANIFEST
     A*                                        I = INTRA-TERMINAL
     A*
     A            COMP#M         3          COLHDG('COMPANY')
     A* FOLLOWING TO LINK MANIFEST PERMANENTLY TO ORDER#
     A            ORDR#M         7  0       COLHDG('ORDER#')
     A            ROUTEM         7          COLHDG('ROUTE')
     A** TERMINALS
     A            ORIGNM         4          COLHDG('ORIGIN')
     A            DESTNM         4          COLHDG('DESTIN')
     A**
     A** OUTBOUND STATS
     A            OBDATM          L         COLHDG('DATE' 'OUT')
     A            OBTIMM         6  0       COLHDG('TIME' 'OUT')
     A**
     A** ESTIMATED TIME OF ARRIVIAL - LINE HAUL MANIFESTS ONLY
     A            ETDATM          L         COLHDG('DATE' 'ETA')
     A            ETTIMM         6  0       COLHDG('TIME' 'ETA')
     A*
     A            MANFDM          L         COLHDG('ENTRY' 'DATE')
     A            MANFTM         6  0       COLHDG('ENTRY' 'TIME')
     A            MANFUM        10          COLHDG('ENTRY' 'USER')
NC13 A            ONDOCM         4          COLHDG('ON DOCK' 'TERM')
NC21 A*-------------------------------------------------------------------
NC21 A            SCAC1M         4          COLHDG('SCAC')
NC21 A            TRAL1M         7          COLHDG('TRAILER')
     A**********************************************************************
     A*           PUHD      -                PICK UP HEADER (DISPATCH)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   2000000 020000 00005
     A*         R PUHDFM
     * NO CHANGES BUT RECOMPILATION REQUIRED FOR PUHD_LOCT1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO LOCT_PUHD1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO PUHD_ORDR1
     A*
     A            ACREC1         1          COLHDG('STACK' 'PALLETS')
     A*                                        Y = STACKABLE PALLETS
     A            PUNUM1         7  0       COLHDG('P/U' 'NUMBER')
     A            TERM#1         4          COLHDG('TERMINAL')
     A* VENDOR INFO
     A            VEND#1         6          COLHDG('VENDOR')
     A            CNAME1        25          COLHDG('CONTACT')
     A            CEXTN1         4  0       COLHDG('CONTACT' 'EXTN')
     A            ROUTE1         7          COLHDG('ROUTE')
     A            CALDT1         7  0       COLHDG('CALL' 'DATE')
     A            CALTM1         4  0       COLHDG('CALL' 'TIME')
     A            AVLDT1         7  0       COLHDG('AVAIL' 'DATE')
     A            AVLTM1         4  0       COLHDG('AVAIL' 'TIME')
     A            AVLAP1         1          COLHDG('AVAIL' 'A/P')
     A*
     A* PICK UP TOTALS
     A            TOGOH1         5  0       COLHDG('TOTAL GOH')
     A            TOCTN1         5  0       COLHDG('TOTAL CTN')
     A            TOWGT1         5  0       COLHDG('TOTAL WGT')
     A            TOCUB1         5  0       COLHDG('TOTAL CUBE')
     A            TOSHP1         3  0       COLHDG('TOTAL SHIPMENTS')
     A            TOPAL1         2  0       COLHDG('TOTAL PALLETS')
     A            TOAMT1         7  2       COLHDG('TOTAL AMOUNT')
     A*
     A* RUN & STATUS
     A            RUN##1         7  0       COLHDG('RUN NO.')
     A            PUDAT1          L         COLHDG('P/U' 'DATE')
     A            STAT11         1          COLHDG('STATUS')
     A*                                          = OPEN
     A*                                        A = ASSIGNED
     A*                                        P = PICKED UP
     A*                                        C = CANCELLED
     A*                                        D = DIVERTED
     A*                                        S = REQUIRED SCHEDULING
     A            STAT21         1          COLHDG('STATUS2')
     A*                                        A = BUILDING A FREIGHT
     A*                                        B = BUILDING B FREIGHT
     A*                                        C = BUILDING C FREIGHT
     A*                                        D = BUILDING A LTL
     A*                                        L = LOEHMANS FREIGHT
     A*                                        M = MERVYNS
     A            HOTSH1         1          COLHDG('HOT' 'FLAG')
     A*                                        Y = YES
     A* MIKE LESIN 6/29/08 ============================================
     A* OBSOLETE FOLLOWING FIELD IS FOR UN-RATED PPD NON-CREDIT VENDORS
     A* OBSOLETE  SAIDT1         1          COLHDG('NEEDS' 'RATING')
     A* OBSOLETE                               Y = YES
     A            SAIDT1         1          COLHDG('MARMAXX' 'BACKHAUL')
     A*                                        M = MARKED TO PROCESS
     A*                                        Y = PROCESSED
     A*                                        N = NO NEED TO PROCESSED
     A*                                            AFTER BEING MARKED
     A*                                        BLANK = N/A
     A* ===============================================================
     A            SOURC1         3          COLHDG('ENTRY' 'SOURCE')
     A            REMAR1        70          COLHDG('REMARKS')
     A* THIRD PARTY VENDOR
     A            VEND31         6          COLHDG('3RD PARTY' 'VENDOR')
     A* ADDED 10/02/2004
     A            PUTIM1         4  0       COLHDG('P/U' 'TIME')
     A*
     A* APPOINTMENTS  -  ADDED  4/10/2005 -
     A            APPDT1         7  0       COLHDG('APPT' 'DATE')
     A            APPTM1         4  0       COLHDG('APPT' 'TIME')
     A            APPFL1         1          COLHDG('APPT' 'FLAG')
     A*                                      ' ' = NO APPOINTMENT NEEDED
     A*                                      'A' = APPOINTMENT MADE
     A*                                      'N' = APPOINTMENT NOTICE SENT
     A*
     A            STOP#1         2          COLHDG('STOP#')
     A*
     A* ASSIGNED TIME
     A            ASNTM1         4  0       COLHDG('ASSIGNED' 'TIME')
     A            STATE1         2          COLHDG('STATE')
     A            ZIPCD1         5  0       COLHDG('ZIP' 'CODE')
     A* ARRIVAL/DEPARTURE INFORMATION
     A            ARVDT1          L         COLHDG('ARRIV' 'DATE')
     A            ARVTM1         4  0       COLHDG('ARRIV' 'TIME')
     A            STRDT1          L         COLHDG('START' 'DATE')
     A            STRTM1         4  0       COLHDG('START' 'TIME')
     A            DEPDT1          L         COLHDG('DEPART' 'DATE')
     A            DEPTM1         4  0       COLHDG('DEPART' 'TIME')
     A* PRE-PLAN
     A            PPDRV1         6          COLHDG('P/P' 'DRIVER')
     A* RECEIVED QUANTITIES
     A            TGOHR1         5  0       COLHDG('GOH' 'RCV')
     A            TCTNR1         5  0       COLHDG('CTN' 'RCV')
     A            TWGTR1         5  0       COLHDG('WEIGHT' 'RCV')
NC30 A            PPDAT1          L         COLHDG('PRE-PLAN' 'DATE')
NC30 A                                      DFT('0001-01-01')
NC30 A            PPCOD1         3          COLHDG('PRE-PLAN' 'CODE')
GC01 A            PPPOD1         1          COLHDG('PRE-PLAN' 'POD')
GC01 A            PPDIV1         4          COLHDG('PRE-PLAN' 'DIV')
GC01 A            PPGRP1         4          COLHDG('PRE-PLAN' 'GROUP')
GC02 A            REFNO1        17          COLHDG('REFERENCE #')
GC02 A            QUALF1         1          COLHDG('REF QUAL')
GC03 A            DUEDT1          L         COLHDG('DUE' 'DATE')
GC03 A                                      DFT('0001-01-01')
GC03 A            REACD1         3          COLHDG('LATE' 'REASON')
GC03 A            CUSTC1         3          COLHDG('CUST' 'CODE')
     A            PYMT$1         1          COLHDG('ONLINE' 'PAYMENT')
     A*                                      'P' = ONLINE PAYMENT MADE
     A            AMTP$1         7  2       COLHDG('AMOUNT' 'PAID')
     A**********************************************************************
     A*           RTEL      -                MARMAXX LAS VEGAS ROUTE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 005000 00010
     A*         R RTELFM
     A*
     A            ACREC4M        1          COLHDG('ACTIVE' 'CODE')
     A            CCODE4M        2          COLHDG('CUST' 'CODE')
     A            ROUTE4M        4          COLHDG('ROUTE' 'CODE')
     A            STORE4M       60          COLHDG('10 STORES' 'LOCAT')
     A            RETRN4M        1          COLHDG('RETURN' 'CODE')
     A*                                        B = BOTH
     A*                                        N = NEITHER
     A*                                        T = TERM  W=WHSE
     A* NOTE: STORE4M IS 6 X 5.0 BUT ALL PGMS SHRINK IT TO 6 X 4.0
     A            MILES4M        5  0       COLHDG('MILES')
     A            HOURS4M        5  3       COLHDG('HOURS')
     A            TOLLS4M        5  2       COLHDG('TOLLS')
     A            FRATE4M        7  2       COLHDG('FLAT RATE')
     A            LLMIL4M        4  0       COLHDG('LAST LEG' 'MILES')
     A            NLZIP4M        5  0       COLHDG('NEXT TO LAST' 'ZIP CODE')
     A            LZIPC4M        5  0       COLHDG('LAST' 'ZIPCD')
     A*
     A**********************************************************************
     A*           VEXF      -                VENDOR CROSS REFERENCE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 000500 00004
     A*         R VEXFFM
     A*
     A            ACREC8X        1          COLHDG('ACTIVE' 'CODE')
     A            VEND#8X        6          COLHDG('WAREHOUSE' 'VENDOR')
     A            VEND88X        6          COLHDG('3RD PARTY' 'VENDOR')
     A            VNAME8X       25          COLHDG('3RD PARTY' 'NAME')
     A**********************************************************************
     A*           USID      -                USER PROFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000100 00005
     A*         R USIDFM
     A            USIDXY        10          COLHDG('USER' 'PROFILE')
     A            ORIGNY         4          COLHDG('TERMINAL')
     A            OUTQZY         6          COLHDG('MANIFEST' 'QUEUE')
     A            PRINTY        10          COLHDG('MANIFEST' 'PRINTER')
     A            OUTQ2Y         6          COLHDG('PRO' 'QUEUE')
     A            PRIN2Y        10          COLHDG('PRO' 'PRINTER')
     A            IPDSPY         1          COLHDG('IPDS' 'PRINTER')
     A*                                        Y = IPDS PRINTER
     A            PRNTYY         1          COLHDG('PRINTER' 'TYPE')
     A*                                        L = LOCAL
     A*                                        R = REMOTE
     A            ALWALY         1          COLHDG('ALLOW' 'ALL')
     A*                                          = SINGLE
     A*                                        Y = GOD
NC12 A            TRGRPY         4          COLHDG('DISPATCH' 'GROUP')
     A            USCLSY         4          COLHDG('USER' 'CLASS')
     A            CRTUSY        10          COLHDG('CREATED BY' 'USRPRF')
     A            CRTDTY          L         COLHDG('CREATED ON' 'DATE')
     A            INITIY         2          COLHDG('INITIALS')
NC08 A            APVTRY         1          COLHDG('APPROVE' 'TRIAL')
NC08 A*                                        Y = YES
NC08 A*                                        THIS USER S/B ABLE TO APPROVE
NC08 A*                                        HIS TERMINAL GROUP
NC12 A            BLGRPY         4          COLHDG('BILLING' 'GROUP')
     A**********************************************************************
     A*           ZCTY      -                ZIP CITY FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 002500 00005
     A*         R ZCTYFM
     A            ZIPCDCZ        5  0       COLHDG('ZIP CODE')
     A            STATECZ        2          COLHDG('STATE')
     A            CTYCODCZ       4          COLHDG('CITY CODE')
     A            CTYNAMCZ      15          COLHDG('CITY NAME')
     A            CONTYCZ        5          COLHDG('COUNTY')
     A            AREACCZ        3          COLHDG('AREA CODE')
     A            TERRCCZ        3          COLHDG('TERR CODE')
     A            TIMEZCZ        1          COLHDG('TIME' 'ZONE')
     A*                                        E = EASTERN, C=CENTRAL
     A*                                        M = MOUNTAIN, P=PACIFIC
     A*                                        A = ALASKA, H=HAWAII
     A*                                        V = PUERTO RICO, VISLAND
     A            CNTRYCZ        3          COLHDG('COUNTRY')
     A            ROUTCZ         7          COLHDG('ROUT')
     A**********************************************************************
     A*           HBNS      -       HUB GROUP NART P/U STOPS FOR LNT
     A*                              POPULATED FROM EDI 204 WORK FILES
     A*                              SENT TO US FROM HUB GROUP
     A*                              IN LIB EDINRSD/EDINRSDT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R HBNSFM
     A*
     A            ACRECHS        1          COLHDG('ACTIVE' 'CODE')
     A*
     A***  --- INFORMATION FROM EDI 204 DOCUMENT
     A            SCACDHS        4          COLHDG('SCAC' 'CODE')
     A*                                         NART
     A            TMLD#HS       17          COLHDG('TM LOAD#')
     A            STOP#HS        3  0       COLHDG('STOP#')
     A            STATSHS        2          COLHDG('STATUS' 'FRM 204')
     A*                                       00 = ORIGINAL
     A*                                       01 = CANCELLED
     A*                                       08 = REISSUED
     A            CCPP$HS        2          COLHDG('COLLECT/' 'PREPAID')
     A*                                       CC = COLLECT
     A*                                       PP = PREPAID
     A            REMARHS       70          COLHDG('REMARKS')
     A            REASNHS        2          COLHDG('STOP' 'REASON')
     A*                                        PL = PARIAL LOAD
     A*                                        CL = COMPLETE LOAD
     A*                                        PU = PARTIAL UNLOAD
     A*                                        CU = COMPLETE UNLOAD
     A*
     A* VENDOR INFO (ONLY FOR REASNHS = 'PL' OR 'CL'
     A* CONSIGNEE INFO (ONLY FOR REASNHS = 'PU' OR 'CU')
     A            TMLOCHS       17          COLHDG('TM LOC.ID')
     A*                                       TM LOCATION ID FOR VENDOR
     A*                                       SENT FRM EDI VIA HUB GRP
     A            TMNAMHS       35          COLHDG('VEND/' 'CONS NAME')
     A            TMADDHS       35          COLHDG('ADDRESS 1')
     A            TMCITHS       30          COLHDG('CITY')
     A            TMSTAHS        2          COLHDG('STATE')
     A            TMZIPHS        5  0       COLHDG('ZIP')
     A*
     A            AVLDTHS        8  0       COLHDG('AVAIL' 'DATE')
     A*                                       YYYYMMDD
     A            AVLTMHS        4  0       COLHDG('AVAIL' 'TIME')
     A*
     A            TMPERHS       25          COLHDG('TM' 'CONTACT')
     A            TMTELHS       12          COLHDG('TM' 'TEL#')
     A*
     A* SHIPMENT INFO
     A            CTNQTHS        5  0       COLHDG('CTN' 'QTY')
     A            GOHQTHS        5  0       COLHDG('GOH' 'QTY')
     A            WEIGHHS        5  0       COLHDG('WEIGHT')
     A            CUBFTHS        5  0       COLHDG('CUBIC' 'FEET')
     A*
     A*
     A***  --- OUR INFORMATION THAT WE POPULATE
     A            TERM#HS        2          COLHDG('TERMINAL')
     A            VEND#HS        6          COLHDG('NRS' 'VENDOR')
     A            CONS#HS        5  0       COLHDG('CONS #')
     A            CONSNHS       25          COLHDG('CONS' 'NAME')
     A            PUNUMHS        7  0       COLHDG('P/U' 'NUMBER')
     A* EDI 214 TO HUB INFO.
     A            PREFXHS        4          COLHDG('TRAILER' 'PREFIX')
     A*                                       TRAILER/CONTAINER PREFIX
     A            TRAILHS       10          COLHDG('TRAILER/' 'CONTAINER#')
     A            PUARDHS        8  0       COLHDG('P/U ARRIVED' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE ARRIVED AT P/U
     A            PUARTHS        4  0       COLHDG('P/U ARRIVED' 'TIME')
     A            PUDPDHS        8  0       COLHDG('P/U DEPART ' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE DEPARTED P/U
     A            PUDPTHS        4  0       COLHDG('P/U DEPART ' 'TIME')
     A            DLARDHS        8  0       COLHDG('DLV.ARRIVED' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE ARRIVED DELIVERY LOC.
     A            DLARTHS        4  0       COLHDG('DLV.ARRIVED' 'TIME')
     A            DLDPDHS        8  0       COLHDG('DLV.DEPART ' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE DEPARTED DELIVERY LOC
     A            DLDPTHS        4  0       COLHDG('DLV.DEPART ' 'TIME')
     A*
     A            EDIDTHS        8  0       COLHDG('EDI 214' 'DATE')
     A*                                       YYYYMMDD
     A            MAILTHS       10          COLHDG('EDI' 'MAILBOX')
     A**********************************************************************
     A*           HBVC      -       HUB GROUP VENDOR X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 005000 00100
     A*         R HBVCFM
     A*
     A            ACRECHC        1          COLHDG('ACTIVE' 'REC CODE')
     A            TMLOCHC       17          COLHDG('TM LOC.ID')
     A*
     A            VEND#HC        6          COLHDG('NRS' 'NUMBER')
     A            TERM#HC        2          COLHDG('NRS' 'TERMINAL')
     A            TMNAMHC       35          COLHDG('VEND/' 'CONS NAME')
     A            TMADDHC       35          COLHDG('ADDRESS 1')
     A            TMZIPHC        5  0       COLHDG('ZIP')
     A**********************************************************************
     A*           LOCT      -                LOCATION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 005000 00100
     A*         R LOCTFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO LOCTORDRJ1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO LOCT10
     * NO CHANGES BUT RECOMPILATION REQUIRED FOR PUHD_LOCT1
     * NO CHANGES BUT RECOMPILATION REQUIRED FOR ORDR_LOCT1
     * NO CHANGES BUT RECOMPILATION REQUIRED FOR LOCT_PUHD1
     A*
     A            ACREC8         1          COLHDG('ACTIVE' 'CODE')
     A*                                     I=INACTIVE
     A*                                     ' '=ACTIVE
     A            LOCID8         6A         COLHDG('LOCATION')
     A            LOCTYP8        1A         COLHDG('LOCATION TYPE')
     A*                                     'C'=CONSIGNEE
     A*                                     'D'=DC
     A*                                     'P'=PIER
     A*                                     'S'=STORE
     A*                                     'T'=TERMINAL
     A*                                     'V'=VENDOR
     A*                                     'W'=WAREHOUSE
     A*                                     'M'=MISCELLANEOUS
     A            TERM#8         4A         COLHDG('TERMINAL NUMBER')
     A            VNAME8        25A         COLHDG('NAME')
     A            ADDRV8        25A         COLHDG('ADDRESS')
     A            CITYV8        16A         COLHDG('CITY')
     A            STATV8         2A         COLHDG('STATE')
     A            ZIPCV8         5P 0       COLHDG('ZIP')
     A            REMAR8        25A         COLHDG('REMARKS')
     A            OPENT8         4P 0       COLHDG('OPEN TIME')
     A            CLOST8         4P 0       COLHDG('CLOSE TIME')
     A            POCHK8         1A         COLHDG('P.O. CHECK')
     A*                                       'Y' = YES
     A            CNAME8        22          COLHDG('CONTACT' 'NAME')
     A            PHONEA8        3A         COLHDG('PHONE AREA CODE')
     A            PHONE8         7A         COLHDG('PHONE')
     A            EXTEN8         4A         COLHDG('PHONE EXT')
     A            FAXA8          3A         COLHDG('FAX PHONE AREA CODE')
     A            FAXPHN8        7A         COLHDG('FAX PHONE')
     A            TJXCO8         1A         COLHDG('TJX COLLECT')
     A* TERMS READ AND ACCEPTED -
     A            ACCPT8         1A         COLHDG('TERMS ACCEPTED')
     A*                                        Y = YES
     A* EDI OR FTP TRADING PARTNER
     A            CITYCD8        4A         COLHDG('CITY CODE')
     A            BLTOCD8        5S 0       COLHDG('BILL TO CODE')
     A            TERR8          3A         COLHDG('TERRITORY')
GP   A*                                       HC = HIGH CUBE RATE USED
GP   A*                                        FOR BILLING (NOW TARGET)
GP   A*                                        -- USING DBU TO DO THIS
     A            CRTDT8          L         COLHDG('DTE MAST. ADDED')
     A            UPDDT8          L         COLHDG('LAST UPDATE DATE')
     A            ALWSHIP8       1A         COLHDG('ALLOW AS SHIPPER?')
     A*                                       'Y' = YES
     A            ALWCONS8       1A         COLHDG('ALLOW AS CONSIGNEE?')
     A*                                       'Y' = YES
     A* DATA CREATED FROM
     A            DTASRC8        1A         COLHDG('DATA' 'SOURCE')
     A*                                       ' ' = PGM
     A*                                       'E' = EDI
     A*                                       'M' = MANUAL
     A* CONTAINER RELATED
     A            NUMDAY8        1S 0       COLHDG('NUM' 'DAYS')
     A*                                       'M' = MANUAL
NC29 A* AIRPORT/PIER
NC29 A            AIRPIER8       1          COLHDG('AIR' 'PIER')
NC29 A*                                       'A' = AIRPORT
NC29 A*                                       'P' = PIER
NC29 A*                                       'R' = RAIL
NC29 A*                                       'X' = BLOCK TO POE VENDORS
NC29 A* SPECIAL PREPAID
NC29 A            PPDRATE8       4          COLHDG('PPD' 'RATE' 'CDOE')
NC29 A* HOT VENDOR
NC29 A            HOTVEND8       1          COLHDG('HOT' 'VEND')
NC29 A* BEALS COLLECT VENDOR -
GC   A            BEACOL8        1          COLHDG('TARGET' 'MIX PLTS')
     A*****************************************************************
     A*           LOCX      -                LOCATION EXTENSION
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 005000 00100
     A* WEB ACCESS DATA
     A*         R LOCXFM
     A*
     A            LOCID8X        6A         COLHDG('LOCATION')
     A            USERI8X       10A         COLHDG('USER ID')
     A            PASSW8X       10A         COLHDG('PASSWORD')
     A            EMAIL8X       70          COLHDG('EMAIL ADDRESS 1')
     A            EMAI28X       70          COLHDG('EMAIL ADDRESS 2')
     A*****************************************************************
     A*           LXRF      -                LOCATION OLD/NEW CODE X-REF
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 005000 00100
     A*
     A*         R LXRFFM
     A*
     A            RCIDLX         1A         COLHDG('VEND/CONS/CUST')
      *                                     V = VENDOR
      *                                     C = CONSIGNEE
      *                                     S = CUSTOMER
     A            NEWCLX         6A         COLHDG('NEW CODE')
     A            OLDCLX         5  0       COLHDG('OLD CODE')
     A            PROCFX         1          COLHDG('PROCESS' 'FLAG')
     A**********************************************************************
     A*           ORDC      -                ORDER COMMENTS FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 003000 00005
     A*         R ORDCFM
     A*
     A            ACRECOC        1          COLHDG('ACTIVE' 'CODE')
     A            ORDEROC        7  0       TEXT('ORDER NUMBER')
     A            SEQ##OC        3  0       TEXT('SEQ NUMBER')
     A            CMTYPOC        1          TEXT('COMMENT TYPE')
     A*                                       C = GENERAL COMMENT
     A*                                       B = BILLING
     A*                                       P = PICKUP
     A*                                       D = DROP OFF / DISPATCH
     A*                                       T = T-CALL
     A*                                       A = PAYROLL ALLOCATION
     A*                                       X = TRANSFER#
     A*                                       # = CONTROL#
     A            LOCATOC        6          TEXT('LOCATION')
     A            COMMTOC       45          TEXT('COMMENT')
     A            CODATOC         L         TEXT('COMMENT DATE')
     A            USRIDOC       10          TEXT('USER ID')
     A**********************************************************************
     A*           ORDM      -                MASTER ORDER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 003000 00005
     A*         R ORDMFM
     A*
     A            ACRECMO        1          COLHDG('ACTIVE' 'CODE')
     A            ORDERMO        7  0       COLHDG('ORDER#')
     A            ORDIDMO       20          COLHDG('ORDER ID')
     A            OPRIDMO       10          COLHDG('OPERATOR ID')
     A            ENTDTMO         L         COLHDG('ENTRY' 'DATE')
     A            ENTTMMO        4  0       COLHDG('ENTRY' 'TIME')
     A            TYPEOMO        2          COLHDG('ORDER' 'TYPE')
     A*                                        LD = LTL DELIVERY
     A*                                        LP = LTL PICKUP
     A*                                        IT = INTER TERMINAL MOVE
     A*                                        SH = SHUTTLE
     A*                                        SP = SPOT
     A*                                        ST = STORE RUN
     A*                                        TL = TRUCKLOAD P/D
     A*
     A            MESSGMO        6          COLHDG('ORDER' 'MSG')
     A* SHIPPER/LOAD AT
     A            SHPCDMO        6          COLHDG('SHIPPER' 'CODE')
     A            SHPSTMO        2          COLHDG('SHIPPER' 'STATE')
     A            SHPCTMO        4          COLHDG('SHIPPER' 'CITY')
     A            LOADIMO        1          COLHDG('LOADING')
     A*                                        Y = LOADING REQ
     A* CONSIGNEE
     A            CONCDMO        6          COLHDG('CONSIGNEE' 'CODE')
     A            CONSTMO        2          COLHDG('CONSIGNEE' 'STATE')
     A            CONCTMO        4          COLHDG('CONSIGNEE' 'CITY')
     A            UNLODMO        1          COLHDG('UNLOAD')
     A* BILL TO                                Y = UNLOADING REQ
     A            ACCT#MO        5  0       COLHDG('BILL' 'TO')
     A            DIV#BMO        4          COLHDG('BOOKED' 'DIVISION')
     A            COMP#MO        3          COLHDG('BOOKED' 'COMPANY')
     A            PAYCOMO        1          COLHDG('PAY CODE')
     A*                                        P = PREPAID
     A*                                        C = COLLECT
     A*
     A* APPOINTMENTS
     A            PICAPMO        1          COLHDG('PU' 'APPT')
     A*                                       N=NO   Y=YES
     A            DELAPMO        1          COLHDG('DEL' 'APPT')
     A*                                       N=NO   Y=YES
     A* T/L ORDER TARIFF OR DISTRIBUTION CODE
     A            TFDSTMO        6          COLHDG('TARIFF' 'DIST')
     A* T/L ORDER TARIFF OR DIST QUAL
     A            TFDSQMO        1          COLHDG('TARIFF' 'DIST' 'QAUL')
     A*                                       T=TARIFF
     A*                                       D=DISTRIBUTION
     A* MILEAGE
     A            MILESMO        7  0       COLHDG('CONTRACT' 'MILES')
     A            EMPTYMO        7  0       COLHDG('EMPTY' 'MILES')
     A            PCMILMO        7  0       COLHDG('PCMILER' 'MILES')
     A            ACTMLMO        7  0       COLHDG('ACTUAL' 'MILES')
     A**********************************************************************
     A*           ORDR      -                ORDER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 003000 00005
     A*         R ORDRFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO QCOPYSRC/RENAMEORDR
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_BLHD1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_BLHD2
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_DRIV1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_DRIV2
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR_MF1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO STOP_ORDR1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO MAN_ORD_DR
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR11
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR11A
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR11B
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR11C
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO LOCTORDRJ1
     * NO CHANGES BUT RECOMPILATION REQUIRED FOR ORDR_LOCT1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO PUHD_ORDR1
     A*
     A            ACRECOR        1          COLHDG('ACTIVE' 'CODE')
     A*                                       CONFIRMATION TO QUALCOMM Y/N IF
     A*                                       APPLICABLE, OTHERWISE - BLANK...
     A            ORDEROR        7  0       COLHDG('ORDER#')
     A            OPRIDOR       10          COLHDG('OPERATOR ID')
     A            ENTDTOR         L         COLHDG('ENTRY' 'DATE')
     A            ENTTMOR        4  0       COLHDG('ENTRY' 'TIME')
     A            TYPEOOR        2          COLHDG('ORDER' 'TYPE')
     A*                                        LD = LTL DELIVERY
     A*                                        LP = LTL PICKUP
     A*                                        IT = INTER-TERMINAL MOVE
     A*                                        PD = LTL PICKUP/DELIVERY COMBO
     A*                                        SH = SHUTTLE
     A*                                        SP = SPOT
     A*                                        ST = STORE RUN
     A*                                        TL = TRUCKLOAD P/D
     A*                                        CT = CONTAINER
     A*
     A* CURRENT LOAD LOCATION
     A            DIV##OR        4          COLHDG('DIVISION')
     A            LOCCDOR        6          COLHDG('LOCAT' 'CODE')
     A            LOCSTOR        2          COLHDG('LOCAT' 'STATE')
     A            LOCCTOR        4          COLHDG('LOCAT' 'CITY')
     A            SHPDTOR         L         COLHDG('SHIPMENT' 'DATE')
     A            SHPTMOR        4  0       COLHDG('SHIP' 'TIME')
     A            STATUOR        1          COLHDG('ORDER' 'STATUS')
     A*                                          = OPEN
     A*                                        A = ASSIGNED
     A*                                        C = COMPLETED JOB
     A*                                        D = DISPATCHED
     A*                                        H = RETURN HOME
     A*                                        L = FORCED COMPLETE
     A*                                        P = PLANNED
     A*                                        X = CANCELLED
     A*                                        Z = INCOMPLETE INFO
     A            STADTOR         L         COLHDG('STATUS' 'DATE')
     A            STATMOR        4  0       COLHDG('STATUS' 'TIME')
     A            MESSGOR        6          COLHDG('ORDER' 'MSG')
     A* SHIPPER/LOAD AT
     A            SHPCDOR        6          COLHDG('SHIPPER' 'CODE')
     A            SHPSTOR        2          COLHDG('SHIPPER' 'STATE')
     A            SHPCTOR        4          COLHDG('SHIPPER' 'CITY')
     A            AVLDTOR         L         COLHDG('AVAILABLE' 'DATE')
     A            AVLTMOR        4  0       COLHDG('AVAIL' 'TIME')
     A            LOADIOR        1          COLHDG('LOADING')
     A*                                        Y = LOADING REQ, N=NO
     A* CONSIGNEE
     A            CONCDOR        6          COLHDG('CONSIGNEE' 'CODE')
     A            CONSTOR        2          COLHDG('CONSIGNEE' 'STATE')
     A            CONCTOR        4          COLHDG('CONSIGNEE' 'CITY')
     A            DUEDTOR         L         COLHDG('DATE' 'DUE')
     A            DUETMOR        4  0       COLHDG('TIME' 'DUE')
     A            UNLODOR        1          COLHDG('UNLOAD')
     A* BILL TO                                Y = UNLOADING REQ, N=NO
     A            ACCT#OR        5  0       COLHDG('BILL' 'TO')
     A            DIV#BOR        4          COLHDG('BOOKED' 'DIVISION')
     A            COMP#OR        3          COLHDG('BOOKED' 'COMPANY')
     A            PRO##OR        7  0       COLHDG('PRO NUMBER')
     A*
     A* NOTE: THE FOLLOWING FIELD IS USED FOR NON-BILLED INTERCOMPANY
     A* CONTROL ONLY.  ALL OTHER TIMES USE PRO TO CHAIN TO BLHD FOR REV
     A* FOR CODING T/L REVENOR IS USED FOR PROJECTED REVENUE
     A            REVENOR        9  2       COLHDG('REVENUE')
     A*=============================================================
     A* SINCE 10/01/08 BILLCOR IS USED TO MARK TL ORDERS AS A
     A*   BROKERAGE LOAD (FLEET BILLING)
     A            BILLCOR        1          COLHDG('BROKERAGE' 'LOAD')
     A*                                        Y = BROKERAGE LOAD
     A*=============================================================
     A            PAYCOOR        1          COLHDG('PAY CODE')
     A*                                        P = PREPAID
     A*                                        C = COLLECT
     A*
     A* LOAD INFO
     A            DLWGTOR        5  0       COLHDG('WEIGHT')
     A            DLCTNOR        5  0       COLHDG('PIECES')
     A            DLGOHOR        5  0       COLHDG('GOH')
     A            PUWGTOR        5  0       COLHDG('WEIGHT')
     A            PUCTNOR        5  0       COLHDG('PIECES')
     A            PUGOHOR        5  0       COLHDG('GOH')
     A*
     A* APPOINTMENTS
     A            PICAPOR        1          COLHDG('PU' 'APPT')
     A*                                       N=NO   Y=YES  M=MADE S=SENT
     A*                                         A=APPT NEEDED  E=EDI
     A*                                         C=CHANGED
     A            DELAPOR        1          COLHDG('DEL' 'APPT')
     A*                                       N=NO   Y=YES  M=MADE S=SENT
     A*                                         A=APPT NEEDED  E=EDI
     A*                                         C=CHANGED
     A* REFERENCE
     A            REFNOOR       17          COLHDG('REFERENCE #')
     A            REFQLOR        1          COLHDG('REF#' 'QUAL')
     A*                                       B=B/L, P=PO, L=LOAD#
     A*                                       A=APPT, R=REL#, M=MANF#
     A*                                       I=INTERCOMPANY REF#
     A*                                       C=CONTROL#  T=TRANSFER
     A* PLANNED EQUIPMENT/DRIVER
     A            SCAC1OR        4          COLHDG('PRELOAD' 'SCAC')
     A            TRAL1OR        7          COLHDG('PRELOAD' 'TRAILER')
     A            SCAC2OR        4          COLHDG('PRELOAD' 'SCAC')
     A            TRAL2OR        7          COLHDG('TRAILER2' 'NUMBER')
     A            BOGEYOR        7          COLHDG('BOGEY' 'NUMBER')
     A            DRVCDOR        6          COLHDG('1ST DRIVER' 'CODE')
     A*
     A* MANIFEST NUMBER FOR LTL ORDERS ONLY
     A            MANF#OR        7  0       COLHDG('LTL' 'MANF#')
     A*
     A* MILEAGE
     A            MILESOR        7  0       COLHDG('CONTRACT' 'MILES')
     A            EMPTYOR        7  0       COLHDG('EMPTY' 'MILES')
     A*
     A*
     A* ADDITIONAL FIELDS ADDED
     A            PRITYOR        1          COLHDG('ORDER' 'PRIORITY')
     A*                                        =REGULAR
     A*                                       H=HOT,
TRIP A            TRIP#OR        7  0       COLHDG('TRIP#')
     A*
     A            DRVC2OR        6          COLHDG('2ND DRIVER' 'CODE')
     A* T/L ORDER TARIFF OR DISTRIBUTION CODE
     A            TFDSTOR        6          COLHDG('TARIFF' 'DIST')
     A* T/L ORDER TARIFF OR DIST QUAL
     A            TFDSQOR        1          COLHDG('TARIFF' 'DIST' 'QAUL')
     A*                                       T=TARIFF
     A*                                       D=DISTRIBUTION
     A            PRPROOR        1          COLHDG('PREASSIGNED' 'PRO')
     A*                                     S = ???
     A*                                     P = PREASSIGNED
     A            BILYNOR        1          COLHDG('BILLABLE')
     A*                                       = BILLABLE
     A*                                     N = NOT BILLABLE
     A* MILES FROM PC MILER / RANDY MCNALLY
     A            PCMILOR        7  0       COLHDG('PCMILER' 'MILES')
     A*-------------------------------------------------------------------
     A            SNDFLOR        1          COLHDG('SECONDARY' 'ORDER FLAG')
     A*                                     Y = SECONDARY ORDER
     A*                                     P = SECONDARY ORDER PROCESSED
     A*                                     3 = 3RD-PART BACK-HAUL (3PBH)
     A*                                     WHEN UNFLAGED AS ACTIVE 3PBH,
     A*                                     X = NON-3PBH
     A*                                     0 = NON-CREDITABLE 3PBH
     A*-------------------------------------------------------------------
     A* CAPTURE DATE FOR 3-RD PARTY BACK-HAULS
     A            CAPDTOR         L         COLHDG('CAPTURE' 'DATE')
     A*-------------------------------------------------------------------
     A            ACTMLOR        7  0       COLHDG('ELAPSED' 'MILES')
     A*-------------------------------------------------------------------
     A* MASTER ORDER# IF COPIED FROM
     A            MAST#OR        7  0       COLHDG('MASTER' 'ORDER#')
NC20 A*-------------------------------------------------------------------
NC20 A            SCACOOR        4          COLHDG('ORIGINAL' 'SCAC')
NC20 A            TRALOOR        7          COLHDG('ORIGINAL' 'TRAILER')
PR01 A            REVAFOR        1          COLHDG('PROCESS' 'FLAG')
NC30 A*-------------------------------------------------------------------
NC30 A* MULTI DAY PRE-PLAN
NC30 A            PPDATEOR        L         COLHDG('PRE-PLAN' 'DATE')
NC30 A                                      DFT('0001-01-01')
NC30 A            PPCODEOR       3          COLHDG('PRE-PLAN' 'CODE')
NC32 A            HAZMATOR       1          COLHDG('HAZMAT' 'Y/N')
NC32 A*                                     Y = HAZMAT
NC32 A*                                     N = NON-HAZMAT
NC32 A*                                       = NON-HAZMAT
NC35 A            EDIDOCOR       1          COLHDG('EDI' 'DOC')
NC35 A*                                     Y = SEND EDI
NC35 A*                                       = NO EDI
NC37 A            IMPEXPOR       1          COLHDG('IMPORT/EXPORT' 'FLAG')
NC37 A*                                       = N/A
NC37 A*                                     I = IMPORT
NC37 A*                                     E = EXPORT
GC01 A            PPPODOR        1          COLHDG('PRE-PLAN' 'POD')
GC01 A            PPGRPOR        4          COLHDG('PRE-PLAN' 'GROUP')
GC01 A            CUBEOR         5  0       COLHDG('CUBE')
GC02 A            PLTSOR         3  0       COLHDG('PALLETS')
GC02 A            HIVALOR        1          COLHDG('HIGH' 'VALUE')
GC02 A*                                        Y = HIGH VALUE LOAD
     A**********************************************************************
     A*           NUM#      -                GET NUMBER STATISTICAL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 003000 00005
     A*         R NUM#FM
     A*
     A            TYPE_O#        5          COLHDG('NUMBER' 'TYPE')
     A            NUMBRO#        7  0       COLHDG('LAST' 'NUMBER')
     A            DATE_O#         L         COLHDG('DATE')
     A            TIME_O#        4  0       COLHDG('TIME')
     A            USER_O#       10          COLHDG('USER')
     A*
     A*****************************************************************
     A*           TGRP      -                TERMINAL GROUP FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000100 00005
     A*
     A*         R TGRPFM
     A*
     A            GRIDTG         4A         COLHDG('GROUP ID')
     A            GRNMTG        32A         COLHDG('GROUP NAME')
     A            CONSTG        20A         COLHDG('CONS FLAGS')
      *                                     EVERY 2 BYTES REPRESENT
      *                                     AN APPLICATION CODE;
      *                                     MAY BE ALL BLANKS;
      *                                     MAY BE EQUAL TO "AL".
     A            TERMTG       160A         COLHDG('TERMINALS')
      *                                     EVERY 4 BYTES REPRESENT
      *                                     A TERMINAL CODE;
      *                                     CAN NOT BE ALL BLANKS;
      *                                     MAY BE EQUAL TO "ALL".
     A**********************************************************************
TRIP A*           TRIP      -                TRIP MASTER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 00005
     A*         R TRIPFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO TRIP_MF01
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO TRIP_MF02
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO TRIP_MF03
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO OL586WF1
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO TRIP28
     A*
     A            ACRECT         1          COLHDG('ACTIVE CODE')
     A            DIV##T         4          COLHDG('DIVISION #')
TRIP A            TRIP#T         7  0       COLHDG('TRIP #')
     A            TRTYPT         1          COLHDG('TRIP' 'TYPE')
     A*                                     NOTE: TYPES TBD ????
     A*                                     NOTE: NOT USED 06/15/07
     A*                                     NOT USED IN OL5
     A            LEASET         5  0       COLHDG('LEASE #')
     A            ROUTET         7          COLHDG('ROUTE #')
     A            TRIDTT          L         COLHDG('TRIP' 'DATE')
     A            TRITMT         4  0       COLHDG('TRIP' 'TIME')
     A*
     A* DRIVER INFORMATION
     A            DRIV1T         6          COLHDG('1ST DRIVER')
     A            DRIV2T         6          COLHDG('2ND DRIVER')
     A            TTYPET         1          COLHDG('DRIVER' 'TYPE')
     A*                                      'H' = HOUSE DRIVER
     A*                                      'O' = OWNER OPERATOR
     A*                                      'S' = SUB-HAULER
     A*                                      'L' = PURCHASED TRANSPORTATION
     A* UNIT
     A            UNIT#T         6          COLHDG('UNIT #')
     A*
     A* TRIP STATUS
     A            TRST1T         1          COLHDG('TRIP STATUS')
     A*                                        ' ' = OPENED
     A*                                        'C' = COMPLETED
     A*                                        'R' = RECONCILED
     A*                                        'V' = VOIDED
     A            TRST2T         1          COLHDG('TCALL FLAG')
     A*                                        T = T-CALLED ORDER      S
     A*                                            INCLUDED ON THIS TRIP
     A*
     A            RECAPT         1          COLHDG('BILLED/RECAPPED')
     A*                                     NOTE: DED FLEET BILLING ONLY
     A            RECDTT         7  0       COLHDG('REC.' 'DATE')
     A*                                     FORMAT:CYYMMDD)
     A            RECIDT        10          COLHDG('RECON ID')
     A*
     A* HUB MILEAGE, FUEL, & OIL DATA
     A            STRMIT         7  0       COLHDG('STARTING' 'HUB MILES')
     A            ENDMIT         7  0       COLHDG('ENDING' 'HUB MILES')
     A            ADDMIT         5  0       COLHDG('ADDITIONAL' 'MILES')
     A            FUELGT         5  0       COLHDG('GALLONS' 'OF FUEL')
     A            FUELCT         7  2       COLHDG('TOTAL' 'FUEL COST')
     A            OILQTT         2  0       COLHDG('QUARTS' 'OF OIL')
     A            OILCST         7  2       COLHDG('TOTAL' 'OIL COST')
     A*
     A* CASH EXPENSES
     A            FUEL$T         7  2       COLHDG('FUEL COST')
     A            TOLL$T         7  2       COLHDG('TOLL COST')
     A            REPA$T         7  2       COLHDG('REPAIR COST')
     A            TIRE$T         7  2       COLHDG('TIRE COST')
     A            WASH$T         7  2       COLHDG('WASH COST')
     A            UNLD$T         7  2       COLHDG('UNLOADING COST')
     A            PERM$T         7  2       COLHDG('PERMIT COST')
     A            MOTL$T         7  2       COLHDG('MOTEL COST')
     A            MEAL$T         7  2       COLHDG('MEAL COST')
     A            FINE$T         7  2       COLHDG('FINE COST')
     A            MISC$T         7  2       COLHDG('MISC. COST')
     A*
     A* FOR INCENTIVES BASED ON CTNS/WGT HANDLED -
     A            CTNCNT         5  0       COLHDG('CTN' 'COUNT')
     A            WEIGHT         5  0       COLHDG('WEIGHT')
     A*
     A            TRREMT        50          COLHDG('TRIP' 'REMARKS')
      * END OF TRIP INFO
     A            TRL1ET         7          COLHDG('TRAILER 1' 'NUMBER')
     A            TRL2ET         7          COLHDG('TRAILER 2' 'NUMBER')
     A            KEYSET         1          COLHDG('KEYS' 'RETURNED')
     A*                                        Y/N
     A            LOGSET         1          COLHDG('LOGS' 'RETURNED')
     A*                                        Y/N
     A            TTAXET         1          COLHDG('TRANSTAX' 'RETURNED')
     A*                                        Y/N
     A            POSTET         1          COLHDG('POST-TRIP' 'REPORT')
     A*                                        Y/N
     A            RTRCET         1          COLHDG('REPAIR' 'TRACTOR')
     A*                                        Y/N
     A            RTR1ET         1          COLHDG('REPAIR' 'TRAILER 1')
     A*                                        Y/N
     A            RTR2ET         1          COLHDG('REPAIR' 'TRAILER 2')
     A*                                        Y/N
     A            AVALET         8  0       COLHDG('AVAILABLE' 'DATE')
     A            CMNTET        50          COLHDG('END-OF-TRIP' 'COMMENTS')
     A            DATEET         8  0       COLHDG('TRIP-END' 'DATE')
     A            TIMEET         6  0       COLHDG('TRIP-END' 'TIME')
     A            USERET        10          COLHDG('TRIP-END' 'USER')
     A*¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     A* BELOW 3 FIELDS ARE APPLIED ONLY FOR HOUSE DRIVERS
     A            PCMHET         7  0       COLHDG('PCMILER' 'HUB MILES')
     A            USRHET         7  0       COLHDG('USER' 'HUB MILES')
     A            ERRHET         1          COLHDG('ERROR' 'HUB MILES')
     A*                                     BLANK IF DIFFRENCE BETWEEN
     A*                                     PCMHET AND USRHET IS +/- 10%,
     A*                                     OTHERWISE - "*" (FOR REPORTS).
     A*¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     A* KRONOS DATA (HOUSE DRIVERS ONLY; IF TEAM - FOR 1ST DRIVER)
     A            PUNINT         4  0       COLHDG('PUNCH-IN' 'TIME')
     A            PUOUTT         4  0       COLHDG('PUNCH-OUT' 'TIME')
     A            HOURST         5  2       COLHDG('KRONOS' 'HOURS')
     A*¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     A*
     A            GROSST         7  2       COLHDG('PAYROLL' 'GROSS')
     A            EXPENT         7  2       COLHDG('TRIP ' 'EXPENCES')
     A            ADVANT         7  2       COLHDG('TRIP' 'ADVANCES')
     A*¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
GC03 A* FIELD TO ENTER WORKING HOURS COVERED UNDER PIECE WORK PAY
GC03 A            EQHRST         5  2       COLHDG('EQUIV' 'HOURS')
     A**********************************************************************
     A*           SEAL      -                TRUCK SEAL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 025000 00005
     A*         R SEALFM
     A*
     A            MOVE#S1        7  0       COLHDG('MOVE' 'NUMBER')
     A            SEQNOS1        2S 0       COLHDG('SEQNO')
     A            SEALOS1        8          COLHDG('SEAL')
     A**********************************************************************
     A*           STPM      -                MASTER ORDER STOP OFF FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 025000 00005
     A*         R STPMFM
     A*
     A            ACRECSM        1          COLHDG('ACTIVE' 'CODE')
     A            ORDERSM        7  0       COLHDG('ORDER #')
     A            SEQNOSM        2S 0       COLHDG('SEQNO')
     A* LOCATION
     A            LOCCDSM        6          COLHDG('LOCATION CODE')
     A            LOCCTSM        4          COLHDG('CITY CODE')
     A            LOCSTSM        2          COLHDG('STATE')
     A            LOCZPSM        5  0       COLHDG('ZIP')
     A* STOP CODE
     A            REASNSM        1          COLHDG('REASON' 'CODE')
     A*                                        P = PICKUP
     A*                                        D = DELIVERY
     A            WEIGTSM        5  0       COLHDG('WEIGHT')
     A            PIECESM        5  0       COLHDG('PIECES')
     A* REFERENCE
     A            REFNOSM       17          COLHDG('REFERENCE #')
     A            REFQLSM        1          COLHDG('REF#' 'QUAL')
     A*                                       B=B/L, P=PO, L=LOAD#
     A*                                       A=APPT, R=REL#, M=MANF#
     A            DASSTSM        1          COLHDG('LOADING/UNLOADING')
     A            SCDTMSM        4  0       COLHDG('SCHED TIME')
     A            MILESSM        5  0       COLHDG('MILES' 'FROM DC')
     A**********************************************************************
     A*           STOP      -                ORDER STOP OFF FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 025000 00005
     A*         R STOPFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO STOP_ORDR1
    A*  IF DOING A DATABASE ON STOP REMOVE THE FRCRATIO(1)
    A*  AFTER CREATION MUST BE CHANGED: CHGPF FILE(OLFILE5/STOP) FRCRATIO(1)
     A*
     A            ACRECST        1          COLHDG('ACTIVE' 'CODE')
NC16  * ALL TYPES OF T-CALLS UPDATE ALL PRIOR STOPS WITH 'T' IN
NC16  * ACRECST FLD (AS PER ML)
     A            ORDERST        7  0       COLHDG('ORDER #')
     A            SEQNOST        2S 0       COLHDG('SEQNO')
     A* LOCATION
     A            LOCCDST        6          COLHDG('LOCATION CODE')
     A            LOCCTST        4          COLHDG('CITY CODE')
     A            LOCSTST        2          COLHDG('STATE')
     A            LOCZPST        5  0       COLHDG('ZIP')
     A* STOP CODE
     A            REASNST        1          COLHDG('REASON' 'CODE')
     A*                                        P = PICKUP
     A*                                        D = DELIVERY
     A*                                        E = EMPTY
     A*                                        S = STARTING POINT
     A*                                        H = RETURN HOME
     A*                                        T = TERMINAL
     A*                                        X = T-CALL
     A*                                        % = PLANNED T-CALL
     A*                                        R = ROUTING
     A            WEIGTST        5  0       COLHDG('WEIGHT')
     A            PIECEST        5  0       COLHDG('PIECES')
     A* REFERENCE
     A            REFNOST       17          COLHDG('REFERENCE #')
     A            REFQLST        1          COLHDG('REF#' 'QUAL')
     A*                                       B=B/L, P=PO, L=LOAD#
     A*                                       A=APPT, R=REL#, M=MANF#
     A*                                       T=TRANS, E=EDI
     A* ARRIVAL/DEPARTURE INFORMATION
     A            ARVDTST         L         COLHDG('ARRIV' 'DATE')
     A            ARVTMST        4  0       COLHDG('ARRIV' 'TIME')
     A            STRDTST         L         COLHDG('START' 'DATE')
     A            STRTMST        4  0       COLHDG('START' 'TIME')
     A            DEPDTST         L         COLHDG('DEPART' 'DATE')
     A            DEPTMST        4  0       COLHDG('DEPART' 'TIME')
     A            ELMINST        5  0       COLHDG('ELAPSED' 'MINS')
     A            HUBRDST        7  0       COLHDG('HUB' 'READING')
     A            DASSTST        1          COLHDG('LOADING/UNLOADING')
     A*                                     L = LOADING
     A*                                     U = UNLOADING
     A            GOH##ST        5  0       COLHDG('GOH')
     A            LATERST        2          COLHDG('LATE' 'REASON')
     A*                                        ?? =  PICKUP
     A            SOURCST        2          COLHDG('SOURCE' 'PROGRAM')
     A*                                        LP =  LTL PICKUP
     A            LOCNMST       20          COLHDG('LOCATION' 'NAME')
     A*                                     UNIQUE PERMANENT STOP ID
     A            STKEYST        9  0       COLHDG('STOP' 'KEY')
     A*                                     GEO LATITUDE AND LONGITUDE
     A            LATITST        6  0       COLHDG('LATITUDE')
     A            LONGIST        6  0       COLHDG('LONGITUDE')
     A* BEST BUY DUE DATE AND TIME
NC38 A            DUEDTST         L         COLHDG('DUE' 'DATE')
NC38 A                                      DFT('0001-01-01')
NC38 A            DUETMST        4  0       COLHDG('DUE' 'TIME')
GC02 A            CUBEST         5  0       COLHDG('CUBE')
GC02 A            PLTSST         3  0       COLHDG('PALLETS')
     A* SCHEDULED DATE & TIME
     A            SAMDTST         L         COLHDG('SCHED' 'DATE')
     A                                      DFT('0001-01-01')
     A            SAMTMST        4  0       COLHDG('SCHED' 'TIME')
     A*****************************************************************
     A*           PUTL      -                PICK UP TRANSFER LOG FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 005000 00100
     A*
     A*         R PUTLFM
     A*
     A            PUP#PL         7  0       COLHDG('PU/ORD' 'NUMBER')
     A            FROMPL         4          COLHDG('FROM' 'TERMINAL')
     A            TO__PL         4          COLHDG('TO' 'TERMINAL')
     A            USERPL        10          COLHDG('TRANSFERED' 'BY USER')
     A            DATEPL         8  0       COLHDG('TRANSFERED' 'ON DATE')
     A            TIMEPL         6  0       COLHDG('TRANSFERED' 'AT TIME')
     A            QUALPL         1          COLHDG('QUALIFIER')
     A*                                        O = ORDER
     A*                                        P = PICK-UP
     A*****************************************************************
TRIP A*           DCH1      -                DRIVER CHECK-IN FILE (HEADER)
     A*****************************************************************
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO DCH106
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 00005
     A*
     A*         R DCH1FM
     A*
     A            DRIVC1         6          COLHDG('DRIVER 1' 'CODE')
     A            DRNMC1        22          COLHDG('DRIVER 1' 'NAME')
TRIP A            TRIPC1         7  0       COLHDG('TRIP' 'NUMBER')
     A            TERMC1         4          COLHDG('TERMINAL' 'CODE')
     A            TRACC1         6          COLHDG('TRACTOR' 'NUMBER')
     A            TRL1C1         7          COLHDG('TRAILER 1' 'NUMBER')
     A            TRL2C1         7          COLHDG('TRAILER 2' 'NUMBER')
     A            DATEC1         8  0       COLHDG('CHECK-IN' 'DATE')
     A            TIMEC1         6  0       COLHDG('CHECK-IN' 'TIME')
     A            USERC1        10          COLHDG('CHECK-IN' 'USER')
     A            DRI2C1         6          COLHDG('DRIVER 2' 'CODE')
     A            DRN2C1        22          COLHDG('DRIVER 2' 'NAME')
     A*****************************************************************
TRIP A*           DCH2      -                DRIVER CHECK-IN FILE (SUB-HEADER)
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 00005
     A*
     A*         R DCH2FM
     A*
     A            DRIVC2         6          COLHDG('DRIVER' 'CODE')
TRIP A            TRIPC2         7  0       COLHDG('TRIP' 'NUMBER')
     A            TERMC2         4          COLHDG('TERMINAL' 'CODE')
     A            PORDC2         1          COLHDG('PICKUP /' 'DELIVERY')
     A*                                        P = PICKUP
     A*                                        D = DELIVERY
     A            REF#C2         7  0       COLHDG('REFERENCE' 'NUMBER')
     A            REFTC2         1          COLHDG('REFERENCE' 'TYPE')
     A*                                        P = PU#
     A*                                        D = PRO#
     A*                                        O = ORDER (NO PU#, NOR PRO#)
     A            ORDRC2         7  0       COLHDG('ORDER#')
     A            SHPRC2        25          COLHDG('SHIPPER')
     A*                                        ORIGIN FOR PICKUP,
     A*                                        DESTINATION FOR DELIVERY
     A            LOCTC2         6          COLHDG('SHIPPER' 'LOCATION')
     A            PROFC2         1          COLHDG('PROOF' 'FLAG')
     A*                                        Y = EVERYTHING OK
     A*                                        N = NO PROOF AT ALL
     A*                                        E = PROOF IN ERROR
     A            WGT_C2         5  0       COLHDG('WEIGHT')
     A            CTN_C2         5  0       COLHDG('CARTONS')
     A            GOH_C2         5  0       COLHDG('GOH')
     A            EXP$C2         7  2       COLHDG('EXPECTED' 'AMOUNT')
     A            ACT$C2         7  2       COLHDG('ACTUAL' 'AMOUNT')
     A            COR$C2         1          COLHDG('CHECK' 'OR' 'CASH')
     A            CMN1C2         4          COLHDG('ERROR' 'CODE 1')
     A            CMN2C2         4          COLHDG('ERROR' 'CODE 2')
     A            CMN3C2         4          COLHDG('ERROR' 'CODE 3')
     A            CMN4C2         4          COLHDG('ERROR' 'CODE 4')
     A            DATEC2         8  0       COLHDG('CHECK-IN' 'DATE')
     A            TIMEC2         6  0       COLHDG('CHECK-IN' 'TIME')
     A            USERC2        10          COLHDG('CHECK-IN' 'USER')
     A            DRI2C2         6          COLHDG('DRIVER 2' 'CODE')
     A*****************************************************************
     A*           DCHW      -                DRIVER CHECK-IN FILE (WORK)
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0009999 000000 00000
     A*
     A*         R DCHWFM
     A*
     A            PORDCW         1          COLHDG('PICKUP /' 'DELIVERY')
     A*                                        P = PICKUP
     A*                                        D = DELIVERY
     A            REF#CW         7  0       COLHDG('REFERENCE' 'NUMBER')
     A            REFTCW         1          COLHDG('REFERENCE' 'TYPE')
     A*                                        P = PU#
     A*                                        D = PRO#
     A*                                        O = ORDER (NO PU#, NOR PRO#)
     A            ORDRCW         7  0       COLHDG('ORDER#')
     A            SHPRCW        25          COLHDG('SHIPPER')
     A*                                        ORIGIN FOR PICKUP,
     A*                                        DESTINATION FOR DELIVERY
     A            LOCTCW         6          COLHDG('SHIPPER' 'LOCATION')
     A            WGT_CW         5  0       COLHDG('WEIGHT')
     A            CTN_CW         5  0       COLHDG('CARTONS')
     A            GOH_CW         5  0       COLHDG('GOH')
     A            EXP$CW         7  2       COLHDG('EXPECTED' 'AMOUNT')
     A            TCLOCW        20          COLHDG('T-CALL LOCATION' 'NAME')
     A*****************************************************************
TRIP A*           DCHX      -                DRIVER CHECK-IN ADD'L FILE
     A*                                      (END-OF-TRIP W/O CHEKC-IN)
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 00005
     A*
     A*         R DCHXFM
     A*
     A            DRIVCX         6          COLHDG('DRIVER' 'CODE')
TRIP A            TRIPCX         7  0       COLHDG('TRIP' 'NUMBER')
     A            TERMCX         4          COLHDG('TERMINAL' 'CODE')
     A            DATECX         8  0       COLHDG('SKIPPED' 'DATE')
     A            TIMECX         6  0       COLHDG('SKIPPED' 'TIME')
     A            USERCX        10          COLHDG('SKIPPED' 'USER')
     A            DRI2CX         6          COLHDG('DRIVER 2' 'CODE')
     A*****************************************************************
     A*           CIER      -                CHECK-IN ERROR CODE TABLE FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000005 00020
     A*
     A*         R CIERFM
     A*
     A            CODEC3         4          COLHDG('ERROR' 'CODE')
     A            DESCC3        25          COLHDG('ERROR' 'DESCRIPTION')
     A*****************************************************************
     A*           CLAS      -                GOODS CLASS FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000005 00020
     A*
     A*         R CLASFM
     A*
     A            CLASCA         4          COLHDG('CLASS' 'CODE')
     A            DESCCA        25          COLHDG('CLASS' 'DESCRIPTION')
     A            RATECA         1          COLHDG('AUTORATE' 'Y/N')
     A            TYPECA         1          COLHDG('GOODS' 'TYPE')
     A*                                             C = CARTONS
     A*                                             G = GOH
     A            MULTCA         5  2       COLHDG('MULTIPLIER')
     A            SORTCA         8          COLHDG('SORT' 'CODE')
     A*****************************************************************
     A*           PRW1      -                AUTO-PU-PRO FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00001
     A*
     A*         R PRW1FM
     A*
     A            STOPW1         2          COLHDG('STOP#')
     A            SHCDW1         6          COLHDG('SHIPPER' 'CODE')
     A            V3RDW1         6          COLHDG('3RD PARTY' 'CODE')
     A            CNCDW1         5          COLHDG('CONSIGNEE' 'CODE')
     A            PP_CW1         1          COLHDG('PREPAID' '/ COLLECT')
     A            SHNMW1        25          COLHDG('SHIPPER' 'NAME')
     A            SHADW1        25          COLHDG('SHIPPER' 'STREET')
     A            SHCTW1        16          COLHDG('SHIPPER' 'CITY')
     A            SHSTW1         2          COLHDG('SHIPPER' 'STATE')
     A            SHZPW1         5  0       COLHDG('SHIPPER' 'ZIP' 'CODE')
     A            CNNMW1        25          COLHDG('CONSIGNEE' 'NAME')
     A            CNADW1        25          COLHDG('CONSIGNEE' 'STREET')
     A            CNCTW1        16          COLHDG('CONSIGNEE' 'CITY')
     A            CNSTW1         2          COLHDG('CONSIGNEE' 'STATE')
     A            CNZPW1         5  0       COLHDG('CONSIGNEE' 'ZIP' 'CODE')
     A            CNXXW1         5  0       COLHDG('CONSIGNEE' 'SUPPL' 'CODE')
     A            CNLCW1         6          COLHDG('CONSIGNEE' 'LOCAT' 'CODE')
     A            CONSW1         1          COLHDG('CONSOLIDATION' 'FLAG')
     A            AGGRW1         1          COLHDG('CONSOLIDATE' 'BY GROUP')
     A            BILLW1         5  0       COLHDG('BILL-TO' 'ACCOUNT')
     A            COD$W1         9  2       COLHDG('COLLECTED' 'COD')
     A            CODTW1         1          COLHDG('CHECK' 'OR CASH')
NC10 A            CORGW1         1          COLHDG('CTN/GOH')
NC10 A            GOH1W1         5  0       COLHDG('GOH')
NC10 A            CTN1W1         5  0       COLHDG('CTN')
NC10 A            WGT1W1         5  0       COLHDG('WGT')
NC10 A            CLS1W1         4          COLHDG('CLASS')
NC10 A            GOT1W1         1          COLHDG('GOH' 'TYPE')
NC10 A            GOH2W1         5  0       COLHDG('GOH')
NC10 A            CTN2W1         5  0       COLHDG('CTN')
NC10 A            WGT2W1         5  0       COLHDG('WGT')
NC10 A            CLS2W1         4          COLHDG('CLASS')
NC10 A            GOT2W1         1          COLHDG('GOH' 'TYPE')
NC10 A            GOH3W1         5  0       COLHDG('GOH')
NC10 A            CTN3W1         5  0       COLHDG('CTN')
NC10 A            WGT3W1         5  0       COLHDG('WGT')
NC10 A            CLS3W1         4          COLHDG('CLASS')
NC10 A            GOT3W1         1          COLHDG('GOH' 'TYPE')
     A            PU#_W1         7  0       COLHDG('PU' 'NUMBER')
     A*****************************************************************
     A*           PRW2      -                AUTO-PU-PRO FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00001
     A*
     A*         R PRW2FM
     A*
     A            STOPW2         2          COLHDG('STOP#')
     A            SHCDW2         6          COLHDG('SHIPPER' 'CODE')
     A            V3RDW2         6          COLHDG('3RD PARTY' 'CODE')
     A            CNCDW2         5          COLHDG('CONSIGNEE' 'CODE')
     A            PP_CW2         1          COLHDG('PREPAID' '/ COLLECT')
     A            PU#_W2         7  0       COLHDG('PU' 'NUMBER')
     A            GOH_W2         5  0       COLHDG('GOH')
     A            CTN_W2         5  0       COLHDG('CTN')
     A*****************************************************************
     A*           CSPF      -                CPYSPLF FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00001
     A*
     A*         R CSPFFM
     A*
     A            DATAC#       132          COLHDG('SPLF' '132' 'RECORD')
     A*****************************************************************
     A*           CAGR      -                CONS AGGR GRP FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 000100 00005
     A*         R CAGRFM
     A*
     A            CAAGRR88       4          COLHDG('CONS' 'AGGR')
     A            CALOCT88       6          COLHDG('CONS' 'LOCATION')
     A            CACON#88       5  0       COLHDG('CONS' 'NUMBER')
     A            CABLTO88       5  0       COLHDG('CONS' 'BILLTO')
     A            CANAME88      25          COLHDG('CONSIGNEE NAME')
     A            CAADDR88      25          COLHDG('STREET' 'ADDRESS')
     A            CACITY88      16          COLHDG('CITY')
     A            CASTAT88       2          COLHDG('STATE')
     A            ZIPCOD88       5  0       COLHDG('ZIP' 'CODE')
     A*****************************************************************
     A*           DGRP      -                DRIVERS GROUP FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000100 00005
     A*
     A*         R DGRPFM
     A*
     A            PRNTDG         4A         COLHDG('PARENT' 'TERMINAL')
     A            CHLDDG        40A         COLHDG('CHILD' 'TERMINALS')
      *                                     EVERY 4 BYTES REPRESENT
      *                                     A TERMINAL CODE;
      *                                     CAN NOT BE ALL BLANKS;
     A*****************************************************************
     A*           TRFM      -                TARIFF MASTER FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000100 00005
     A*
     A*         R TRFMFM
     A*
     A            TRFMFF         6A         COLHDG('TARIFF' 'CODE')
     A            TNAMFF        25A         COLHDG('TARIFF' 'NAME')
     A            EFFDFF          L         COLHDG('EFFECTIVE' 'DATE')
     A            ANNDFF          L         COLHDG('ANNIVERSARY''DATE')
     A            GRPCFF         2A         COLHDG('GROUP' 'CODE')
     A            TLTYFF         4A         COLHDG('TL TYPE')
     A            COMMFF         6A         COLHDG('COMMODITY' 'TYPE')
     A            MIN$FF         7P 2       COLHDG('MIN' 'CHARGE')
     A            STP1FF         5P 2       COLHDG('1' 'STOPOFF')
     A            STP2FF         5P 2       COLHDG('2' 'STOPOFF')
     A            STP3FF         5P 2       COLHDG('3' 'STOPOFF')
     A            OFRTFF         3P 2       COLHDG('OFF ROUTE')
     A            FSCDFF         1A         COLHDG('FSC' 'CODE')
     A*                                     Y/N - SUPPRESS FSC
     A            FRTMFF         5P 2       COLHDG('FREE TIME' 'RATE')
     A            DETNFF         5P 2       COLHDG('DETENTION')
     A            UPDDFF          L         COLHDG('LAST UPDATE DATE')
     A            UPDUFF        10A         COLHDG('UPDATED' 'BY USER')
     A            HOURFF         5P 2       COLHDG('HOURLY' 'RATE')
     A            DAS$FF         5P 2       COLHDG('DRIVER' 'ASSIST')
     A            DLU$FF         5P 2       COLHDG('DRIVER' 'LOAD/UNLOAD')
     A            FLATFF         7P 2       COLHDG('FLAT' 'CHARGE')
NC02 A            ACTIVF         1A         COLHDG('ACTIVE' 'CODE')
NC02  *                                     ACTIVE = BLANK
NC02  *                                     INACTIVE = 'I'
     A            PARNTF         6A         COLHDG('MARMAXX' 'PARENT')
     A            SCENRF         1A         COLHDG('MARMAXX' 'SCENARIO')
     A            PAYBLF         7P 2       COLHDG('PAYABLE' 'TO DRIVER')
     A            RT1WFF         1A         COLHDG('1 WAY' 'AS' 'ROUND TRIP')
     A*                                     Y/N - RATE 1 WAY AS ROUND TRIP
     A**********************************************************************
     A*           TRFD      -                TARIFF DETAIL FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000100 00005
     A*
     A*         R TRFDFM
     A*
     A            TRFMDF         6A         COLHDG('TARIFF' 'CODE')
     A            EFFDDF          L         COLHDG('EFFECTIVE' 'DATE')
     A            STRTDF         6A         COLHDG('START')
     A            SZIPDF         3A         COLHDG('START' 'ZIP')
     A            DESTDF         6A         COLHDG('DESTINATION')
     A            DZIPDF         3A         COLHDG('DESTINATION' 'ZIP')
     A            TLTYDF         4          COLHDG('TL' 'TYPE')
     A            RATEDF         5P 3       COLHDG('RATE/MILE')
     A            MIN$DF         7P 2       COLHDG('MIN/FLAT' 'CHARGE')
     A**********************************************************************
     A*           VLXR      -                EDI CODE / LOCATION X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00003
     A*         R VLXRFM
     A*
     A            ACRECVX        1          COLHDG('ACTIVE CODE')
     A            CCODEVX        2          COLHDG('CUST' 'CODE')
     A            LOCATVX        6          COLHDG('LOCATION' 'CODE')
     A            IDCSEVX       17          COLHDG('EDI' 'CODE')
     A**********************************************************************
     A*           DSTR      -                NEW VERSION OF OLFILE/STOR
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 002000 00004
     A*         R DSTRFM
     A*
     A            ACRECSD        1          COLHDG('ACTIVE' 'CODE')
     A            DIST#SD        6          COLHDG('DISTRIBUTION #')
     A            STORESD        5          COLHDG('ALPHA STORE #')
     A            DESTNSD        4          COLHDG('DESTIN' 'TERMINAL')
     A            LOCCDSD        6          COLHDG('LOCATION' 'CODE')
     A            RATE#SD        4          COLHDG('RATE CODE')
     A            CUSCDSD        2          COLHDG('CUSTOMER' 'CODE')
     A            RATE1SD        7  2       COLHDG('STORE RATE 1')
     A            RATE2SD        7  2       COLHDG('STORE RATE 2')
     A            LIVULSD        1          COLHDG('LIVE' 'UNLOAD')
     A*                                       Y  = YES
     A            DRVULSD        1          COLHDG('DRIVER' 'UNLOAD')
     A*                                       Y  = YES
     A**********************************************************************
     A*           GRUP      -                ACCOUNT GROUP MASTER FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000250 000025 00003
     A*         R GRUPFM
     A*
     A            ACREC11        1          COLHDG('ACTIVE' 'CODE')
     A            CORPG11        2          COLHDG('CORP' 'GROUP')
     A            GROUP11        4          COLHDG('SUB' 'GROUP')
     A            DESCR11       25          COLHDG('DESCRIPTION')
     A            MILER11        1          COLHDG('MILER' 'TOOL')
     A**********************************************************************
     A*           PSOR      -                PRIMARY/SECONDARY ORDERS
     A*           PSO2      -                CLONE...
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 003000 00005
     A*         R PSORFM
     A*
     A            RECIDPS        3          COLHDG('RECORD' 'ID')
     A*                                     MRT - MARMAXX ROUND TRIP BILLING
     A*                                     M3P - MARMAXX BROKERAGE BILLING
     A            PRMORPS        7  0       COLHDG('FRONT HAUL' 'ORDER')
     A            SECORPS        7  0       COLHDG('BACK HAUL' 'ORDER')
     A            TERORPS        7  0       COLHDG('SUPPL' 'BACK HAUL' 'ORDER')
     A            FTHORPS        7  0       COLHDG('PICKUP' 'BACK HAUL' 'ORDER')
     A*
     A            PRO#1PS        7  0       COLHDG('FRONT HAUL' 'PRO')
     A            PRO#2PS        7  0       COLHDG('BACK HAUL' 'PRO')
     A            PRO#3PS        7  0       COLHDG('3RD PARTY/SUPPL B/H' 'PRO')
     A            PRO#4PS        7  0       COLHDG('PICKUP' 'BACK HAUL' 'PRO')
     A*
     A            STOPSPS      120          COLHDG('UP TO 20' 'STOPS')
     A            MILESPS      100          COLHDG('MILEAGE' 'BETWEEN STOPS')
     A            LSTFHPS        2  0       COLHDG('LAST' 'F/H STOP')
     A            TOLIDPS        1          COLHDG('MILER' 'TOOL')
     A*
     A            USER_PS       10          COLHDG('USER')
     A            DATE_PS         L         COLHDG('DATE')
     A            TIME_PS        4  0       COLHDG('TIME')
     A            FHMLSPS        7  0       COLHDG('FRON HAUL' 'MILEAGE')
     A* ¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     A            ORMLSPS        7  0       COLHDG('OFF-ROUTE' 'MILEAGE')
     A* CONTAINS TOTAL MILEAGE, NOT AN ORM; ORM = ORMLSPS - FHMLSPS, IF
     A*                                     LESS OR EQUAL TO 0 = MAKE IT 1.
     A* ¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬¬
     A            STPOFPS        2  0       COLHDG('NUMBER' 'STOPOFFS')
     A*
     A            INV##PS        7  0       COLHDG('INVOICE' 'NUMBER')
     A            INVDTPS         L         COLHDG('INVOICE' 'DATE')
     A                                      DFT('0001-01-01')
     A            STBILPS        1          COLHDG('ST 1WAY' 'VS R/T')
     A*                                       BLANK = ROUND TRIP (DEFAULT)
     A*                                       1     = ONE WAY
     A**********************************************************************
     A*           ITRT      -                INTRA-TERMINAL RATE FILE
     A*****************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00005
     A*         R ITRTFM
     A*
     A            FROMIT         4          COLHDG('FROM' 'TERMINAL')
     A            TO__IT         4          COLHDG('TO' 'TERMINAL')
     A            RATEIT         7  2       COLHDG('RATE')
     A**********************************************************************
     A*           DESC      -                COMMODITY DESC. FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R DESCFM
     A*
     A            ACRECC         1          COLHDG('ACTIVE' 'CODE')
     A            DESCRC        25          COLHDG('DESCRIPTION')
     A            DCODEC         4          COLHDG('DESCR. CODE')
     A            CHCODC         1          COLHDG('CARTON/' 'HANGING' 'CODE')
     A            GLCODC         6  0       COLHDG('GL CODE')
     A            EDISDC         3          COLHDG('EDI 210' 'STANDARD')
     A            TORNFC         1          COLHDG('TRKG' 'NON-TRKG')
     A*                                       T  = TRUCKING
     A*                                       N  = NON-TRUCKING
     A**********************************************************************
     A*           PORJ      -                REJECTED PO FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 030000 00010
     A*         R PORJFM
     A*
     A            ACRECPR        1          COLHDG('ACTIVE' 'CODE')
     A            CONS#PR        5  0       COLHDG('CONSIGNEE')
     A            PONUMPR       15          COLHDG('PO NUMBER')
     A            VEND#PR        6          COLHDG('VENDOR')
     A            DATERPR        7  0       COLHDG('DATE')
     A*                                        CYYMMDD
     A            TIMERPR        4  0       COLHDG('TIME')
     A**********************************************************************
     A*           RTSF      -                TARGET RTS FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0900000 020000 00005
     A*         R RTSFFM
     A*
     A            ACRECRT        1          COLHDG('ACTIVE' 'REC CODE')
     A*                                       M = MULTI-DESTINATION LOAD
     A            CONT#RT        7  0       COLHDG('CONTROL' 'NUMBER')
     A*
     A            COMP#RT        2          COLHDG('COMPANY')
     A*                                        4 = TARGET EAST COAST
     A*                                        7 = TARGET WEST COAST
     A            VENDCRT        7  0       COLHDG('VENDOR' 'CODE')
     A            DEPTCRT        4  0       COLHDG('DEPARTMENT')
     A            PONUMRT        8  0       COLHDG('PO')
     A            DESTCRT        4  0       COLHDG('DEST' 'CODE')
     A            ADDR1RT       35          COLHDG('ADDRESS 1')
     A            CITYCRT       30          COLHDG('CITY')
     A            STATERT        2          COLHDG('STATE')
     A            ZIPCDRT        5  0       COLHDG('ZIP')
     A            QCTNSRT        7  0       COLHDG('CARTONS')
     A            WEIGHRT        7  0       COLHDG('WEIGHT')
     A            CUBESRT        5  0       COLHDG('CUBE')
     A            PALLTRT        3  0       COLHDG('PALLETS')
     A            STACKRT        1          COLHDG('STACKABLE')
     A*                                      ' '
     A*                                      N
     A*                                      Y
     A            LINFTRT        3  0       COLHDG('LIN FEET')
     A            EARDTRT        8  0       COLHDG('EARLY' 'DATE')
     A            EARTMRT        4  0       COLHDG('EARLY' 'TIME')
     A            LATDTRT        8  0       COLHDG('LATE' 'DATE')
     A            LATTMRT        4  0       COLHDG('LATE' 'TIME')
     A            BLNUMRT       20          COLHDG('B/L NUMBER')
     A            COPO#RT       12          COLHDG('COMBO PO#')
     A            SHPDTRT        8  0       COLHDG('SHIP' 'DATE')
     A            CNLDTRT        8  0       COLHDG('CANCEL' 'DATE')
     A            LOCGRRT       12  0       COLHDG('LOCAT' 'GROUP')
     A*                                      VENDOR FAMILY CODE (UNIQUE
     A            FRTERRT        2          COLHDG('FRGT' 'TERM')
      *                                       CN = COLLECT
      *                                       PP = PREPAID
     A            VNAMERT       35          COLHDG('VENDOR' 'NAME')
     A            DISP#RT       15          COLHDG('DISPATCH #')
     A            FOURWRT        1  0       COLHDG('FOUR' 'WALLS')
     A* OUR ROUTING INFORMATION
     A            EXTDTRT         L         COLHDG('EXTRACT' 'DATE')
     A            EXTTMRT        4S 0       COLHDG('EXTRACT' 'TIME')
     A            LOAD#RT        7  0       COLHDG('NRS LOAD #')
     A            LTLTLRT        1          COLHDG('LTL/TL' 'CODE')
     A*                                       L = LTL
     A*                                         = TL
     A* RETURN INFO
     A            SCAC#RT        4          COLHDG('SCAC' 'CODE')
     A            REFNORT       12          COLHDG('REFERENCE #')
     A            PICDTRT        8  0       COLHDG('PU DATE')
     A*
     A* STATUS
     A            STADTRT         L         COLHDG('STATUS' 'DATE')
     A            STATMRT        4S 0       COLHDG('STATUS' 'TIME')
     A            STAT1RT        1          COLHDG('STATUS')
     A*                                         = OPEN
     A*                                       A = ASSIGNED (TEMP)
     A*                                       C = CONFIRMED
     A*                                       F = FINALIZED
     A*                                       P = PROBLEM ORDER
     A*                                        1.VENDOR ZIP NOT IN ZIPS
     A*                                          FILE
     A*                                       R = ROUTED (PERM)
     A*                                       S = COMBO PO SUSPENSE
     A*                                       X = CANCELLED
     A            DT204RT        8  0       COLHDG('204' 'DATE')
     A            DT754RT        8  0       COLHDG('754' 'DATE')
     A            VEND#RT        6          COLHDG('NRSVENDOR' 'NUMBER')
     A            STOP#RT        5  0       COLHDG('P/U STOP' 'NUMBER' )
     A            ODESTRT        4  0       COLHDG('ORIG' 'DEST')
     A*                                         0000 = NOT A HEADER LOAD
     A            TERM#RT        4          COLHDG('TERM')
     A*                                         USED FOR LTL           D
     A            NOSELRT        1          COLHDG('NOSELOAD' 'FLAG')
     A*                                        N = NOSELOAD
     A*                                        M = MODE 5 LOAD
     A            MANETRT        1          COLHDG('MANUAL' 'ENTRY')
     A*                                        M = MANUAL ENTRY
     A            HOLDFRT        1          COLHDG('HOLD' 'LOAD')
     A*
     A            REL##RT       12          COLHDG('RELEASE' 'ID')
     A* FIELD TO INDICATE - RECEIVED TO CONSOLIDATION
     A            RECVDRT        1          COLHDG('RECEIVED' 'FLAG')
     A* FIELDS TO POPULATE WHEN A LOAD IS BROKEN UP
     A            FLTRCRT        1          COLHDG('FAULT' 'CODE')
     A*                                        C = CARRIER REJECT
     A*                                        V = VENDOR NOT READY
     A            OSCACRT        4          COLHDG('ORIGINAL' 'SCAC')
     A            TM204RT        6  0       COLHDG('204' 'TIME')
     A            TM754RT        6  0       COLHDG('754' 'TIME')
     A            R997ERT        1          COLHDG('RECEIVED 997')
     A*                                        Y = YES
GP11 A*                                        T =  WE GOT NEW  FORMAT
GP11 A*                                             OF PO IN THE INCOMING
GP11 A*                                             EDI
GP11 A*                                              XXXXXXXXXXX-YYYY
GP11 A*                                               PO#-DC#
     A            ZIPCNRT        6          COLHDG('CANADIAN' 'ZIP CODE')
     A            STPDSRT        3  0       COLHDG('DESTINATION' 'STOP#')
     A*                                        1 IS 1ST DEST. STOP
GP01 A            EQTYPRT       20          COLHDG('EQ.TYPE')
GP01 A            PRO##RT       20          COLHDG('PRO##')
GP01 A*                                          NOT OURS
GP08 A            EDITYRT        2          COLHDG('204 IN' 'EDI TYPE')
     A*                                        00 - ORIGINAL
     A*                                        04 - UPDATE
     A*                                        01 - CANCEL
GP11 A            PONUMNT       11  0       COLHDG('PO 11')
GP11 A*                                       TARGET PO#
GP11 A*                                      FOR NEW RTS TARGET FORMAT
GP11 A*                                        WHEN THEY SEND IT TO US
GP11 A*                                        XXXXXXXXXXX-YYYY WHERE
GP11 A*                                          YYYY IS STILL DC#
GP11 A*                                         OR
GP11 A*                                        WHEN THEY SEND OLD WAY
GP11 A*                                         DDDD-XXXXXXX-YYYY
GP11 A*                                           DDDD IS DEPT#
GP11 A*                                         FLD R997ERT
     A**********************************************************************
     A*           RTSX      -                TARGET RTS VENDOR XREF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 020000 00005
     A*         R RTSXFM
     A*
     A            ACRECRX        1          COLHDG('ACTIVE' 'REC CODE')
     A            COMP#RX        2          COLHDG('COMPANY' 'NUMBER')
     A            LOCGRRX       12  0       COLHDG('TARGET' 'NUMBER')
     A*
     A            VEND#RX        6          COLHDG('NRS' 'NUMBER')
     A            TERM#RX        4          COLHDG('NRS' 'TERMINAL')
     A**********************************************************************
TRIP A*           CNNA      -                CONTAINER NOT AVAILABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 003000 00005
     A*         R CNNAFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CNNA_SHJB
     A*
     A            ORDEROX        7  0       COLHDG('ORDER#')
     A            TYPEOOX        2          COLHDG('ORDER' 'TYPE')
     A            TERM_OX        4          COLHDG('TERMINAL')
TRIP A            TRIP#OX        7  0       COLHDG('TRIP#')
     A            DRVCDOX        6          COLHDG('DRIVER')
     A            SCAC_OX        4          COLHDG('SCAC' 'CODE')
     A            CONT#OX        7          COLHDG('CONTAINER' 'NUMBER')
     A            TYPE_OX        1          COLHDG('N/A TYPE')
     A*                                       R = NOT AVAILABLE BUT REPLACEABLE
     A*                                       N = NOT AVAILABLE & NOT REPLACEABL
     A            FRMDHOX        6          COLHDG('FROM' 'DEADHEAD')
     A            TO_DHOX        6          COLHDG('TO' 'DEADHEAD')
     A            OPRIDOX       10          COLHDG('OPERATOR' 'PROFILE')
     A            TYPDTOX         L         COLHDG('RECORD' 'DATE')
     A            TYPTMOX        4  0       COLHDG('RECORD' 'TIME')
     A            USDDTOX         L         COLHDG('BILLING' 'DATE')
     A                                      DFT('0001-01-01')
     A            ONLYOOX        1          COLHDG('ONLY' 'ORDER' 'FLAG')
     A**********************************************************************
     *
     *
     *         FILES FROM *** OLFILE ***
     *
     *
     A**********************************************************************
     A*           ASNH      -                ASN HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 030000 00010
     A*         R ASNHFM
     A*
     A            ACRECAH        1          COLHDG('ACTIVE' 'CODE')
     A            RECD#AH        6  0       COLHDG('RECORD #')
     A            ASN##AH       30          COLHDG('ASN NUMBER')
     A            BLNUMAH       30          COLHDG('B/L NUMBER')
     A            VENDCAH        6          COLHDG('VENDOR #')
     A            VNAMEAH       20          COLHDG('VENDOR')
     A            CARNMAH       15          COLHDG('CARRIER')
     A            TOCTNAH        5  0       COLHDG('TOT' 'CTNS')
     A            SHPDTAH         L         COLHDG('SHIP' 'DATE')
     A*           TRLIBAH       11          COLHDG('I/B' 'TRAILER')
     A*           TRLIDAH        7          COLHDG('TRAILER ID#')
     A*           PRO##AH        7  0       COLHDG('PRO#')
     A*           LNTD#AH        8  0       COLHDG('LNT LOAD #')
     A*           RECDTAH        8  0       COLHDG('RECV' 'DATE')
     A*           RCVBYAH       10          COLHDG('RECV BY' 'USERID')
     A*           XDOCKAH        1          COLHDG('XDOCK TYPE')
      *                                     M = MANUALLY MOVED
      *                                     A = AUTOMATED VIA SORTER
     A*           SORTDAH         Z         COLHDG('SORTDIRC' 'TIMESTAMP')
     A**********************************************************************
     A*           ASND      -                ASN DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 030000 00010
     A*         R ASNDFM
     A*
     A            ACRECAD        1          COLHDG('ACTIVE' 'CODE')
     A            RECD#AD        6  0       COLHDG('RECORD #')
     A            VBARCAD       20          COLHDG('VENDOR BARCODE')
     A            CBARCAD       20          COLHDG('CONSIGNEE BARCODE')
     A            PONUMAD        7          COLHDG('PO NUMBER')
     A            DEPT#AD        4          COLHDG('DEPT#')
     A            DCLOCAD        5  0       COLHDG('DC LOCATION')
     A            TRLIBAD       11          COLHDG('I/B' 'TRAILER')
     A            SRTTYAD        1          COLHDG('SORT1' 'TYPE')
     A*                                     G = GUN
     A*                                       = AUTO
     A*                                     T = TETHER
     A            SORT1AD         Z         COLHDG('SORT1' 'TIMESTAMP')
     A            LANE1AD        3  0       COLHDG('LANE1')
     A            TRLOBAD       11          COLHDG('O/B' 'TRAILER')
     A            RECCDAD        1          COLHDG('RECEIPT' 'CODE')
     A*                                     R = RECEIPT
     A            STOREAD        5  0       COLHDG('STORE #')
     A**********************************************************************
     A*           ASN2      -                ASN SCANNER 2 DETAILS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   2000000 030000 00010
     A*         R ASN2FM
     A*
     A            SORT22D         Z         COLHDG('SORT2' 'TIMESTAMP')
     A            LANE22D        3  0       COLHDG('LANE2')
     A            STORE2D        5  0       COLHDG('STORE #')
     A            CARTO2D        9  0       COLHDG('CARTON ID')
     A            CHECK2D        1  0       COLHDG('CHECK DIGIT')
     A            VBARC2D       20          COLHDG('VENDOR BARCODE')
     A**********************************************************************
     A*           ASNE      -                ASN EXCEPTION FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 030000 00010
     A*         R ASNEFM
     A*
     A            ACRECAE        1          COLHDG('ACTIVE' 'CODE')
     A            VBARCAE       20          COLHDG('VENDOR BARCODE')
     A            SORT1AE         Z         COLHDG('SORT1' 'TIMESTAMP')
     A            SRTTYAE        1          COLHDG('SORT1' 'TYPE')
     A*                                     G = GUN
     A*                                       = AUTO
     A            LANE1AE        3  0       COLHDG('LANE1')
     A**********************************************************************
     A*           ASNP      -                ASN PO LEVEL INFO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 030000 00010
     A*         R ASNPFM
     A*
     A            ACRECAP        1          COLHDG('ACTIVE' 'CODE')
     A            PONUMAP        7          COLHDG('PO NUMBER')
     A            BLNUMAP       30          COLHDG('B/L NUMBER')
     A            VENDCAP        6          COLHDG('VENDOR #')
     A            SHPDTAP         L         COLHDG('SHIP' 'DATE')
     A            POQTYAP        5  0       COLHDG('PO QTY')
     A            PORLSAP        5  0       COLHDG('PO RELEASE' 'CTNS')
     A            TRLIBAP       11          COLHDG('I/B' 'TRAILER')
     A            TRLIDAP        7          COLHDG('TRAILER ID#')
     A            XDOCKAP        1          COLHDG('XDOCK TYPE')
     A            PRO##AP        7  0       COLHDG('PRO#')
     A            TMNUMAP        8  0       COLHDG('TM NUMBER')
     A            RECDTAP        8  0       COLHDG('RECV' 'DATE')
     A            RCVBYAP       10          COLHDG('RECV BY' 'USERID')
      *                                     M = MANUALLY MOVED
      *                                     A = AUTOMATED VIA SORTER
     A            SORTDAP         Z         COLHDG( -
     A                                      'SEND TO' 'SORTDIRC' 'TIMESTAMP')
     A            RECCDAP        1          COLHDG('RECEIPT' 'CODE')
     A*                                     R = RECEIPT
     A**********************************************************************
TRIP A*           BLH$      -                B/L HEADER (TRANSFER)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0020000 001000 00003
     A*         R BLH$FM
     A*
     A            ACREC$         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##$         7  0       COLHDG('PRO #')
     A            COMP#$         3          COLHDG('COMPANY')
     A            PRODT$          L         COLHDG('PRO DATE')
     A            TRAC#$         8  0       COLHDG('TRACKING #')
     A            ACCT#$         5  0       COLHDG('ACCOUNT #')
     A            PAYCO$         1          COLHDG('PREPAID/COLLECT')
     A*                                        P = PREPAID
     A*                                        C = COLLECT
     A* SHIPPER
     A            SHIPN$        25          COLHDG('SHIPPER NAME')
     A            SHAD1$        25          COLHDG('SHIPPER ADD1')
     A            SHAD2$        25          COLHDG('SHIPPER ADD2')
     A            SHSTA$         2          COLHDG('SHIPPER STATE')
     A            SHCOD$         6          COLHDG('SHIP LOC' 'CODE')
     A* CONSIGNEE
     A            CONSN$        25          COLHDG('CONSIGNEE NAME')
     A            COAD1$        25          COLHDG('CONSIGNEE ADD1')
     A            COAD2$        25          COLHDG('CONSIGNEE ADD2')
     A            CONST$         2          COLHDG('CONSIGNEE STATE')
     A            CONS#$         5  0       COLHDG('CONSIGNEE #')
     A            COCOD$         6          COLHDG('CONS LOC' 'CODE')
     A* TERMINAL
     A            ORIGN$         4          COLHDG('ORIGIN')
     A            DESTN$         4          COLHDG('DESTINATION')
     A*  MOVEMENT
     A            MOVE1$         7  0       COLHDG('MANIFEST#')
     A            TRAIL$         7          COLHDG('P/U TRAILER')
     A            SCAC1$         4          COLHDG('SCAC1')
     A            TRAL2$         7          COLHDG('DEL TRAILER')
     A            SCAC2$         4          COLHDG('SCAC2')
     A*
     A*  INTERLINE CARRIER INFORMATION
     A            ILCOD$         4          COLHDG('I/L' 'CARRIER')
     A            ILPRO$        10          COLHDG('I/L PRO#')
     A            ILFRM$         1          COLHDG('FROM OR TO')
     A            ILAMT$         7  2       COLHDG('I/L AMT')
     A*                                        I/L'S PORTION
     A            ILNRT$         7  2       COLHDG('I/L NRT')
     A*                                        NRT'S PORTION
     A            ILTOT$         7  2       COLHDG('I/L TOT')
     A* NOTE: ILAMT + ILNRT = ILTOT            I/L TOTAL AMT
     A            CDAMT$         7  2       COLHDG('C.O.D. AMOUNT')
     A
     A* TOTALS:
     A            TOTAL$         9  2       COLHDG('TOTAL AMOUNT')
     A            TOQTY$         5  0       COLHDG('TOTAL QTY')
     A            TOWGT$         5  0       COLHDG('TOTAL' 'ACTUAL' 'WEIGHT')
     A* PERSONNEL
     A            BILLI$         2          COLHDG('BILLING INITIALS')
     A            RATEI$         2          COLHDG('RATE CLERKS ID')
     A            OPERA$         2          COLHDG('OPERATORS INITIALS')
     A*
     A* DATE PRO HIT SYSTEM
     A            ENTDT$          L         COLHDG('ENTRY' 'DATE')
     A*  STATUS FLAGS:
     A            CONPU$         1          COLHDG('CONS P/U')
     A*                                        Y = CONSOLIDATION P/U
     A            SIEXT$         1          COLHDG('SPEC INS' 'EXIST')
     A*                                        Y = SPECIAL INSTR EXIST
     A            POEXT$         1          COLHDG('PO''S' 'EXIST')
     A*                                        Y = PO'S EXIST
     A            EDIST$         2          COLHDG('EDI' 'STATUS')
     A*                                        AF = AF TRANSACTION SENT
     A*                                        AD = AD TRANSACTION SENT
     A            OSDCO$         1          COLHDG('OS&D CODE')
     A*                                        O = OVERAGE
     A*                                        S = SHORTAGE
     A*                                        D = DAMAGE
     A            STAT2$         1          COLHDG('STAT' 'FLAG2')
     A*                                        I = INVOICED
     A*                                        A = PASSED TO A/R
     A*                                        V = VOIDED PRO
     A*                                        F = NON-REVENUE PRO
     A            PAIDF$         1          COLHDG('PAID' 'FLAG')
     A*                                          = NEW PRO NOT PAID
     A*                                        P = PRO IS FULLY PAID
     A            ORDER$         7  0       COLHDG('ORDER#')
TRIP A            TRIP#$         7  0       COLHDG('TRIP#')
     A            DELDT$          L         COLHDG('DELIVERY' 'DATE')
     A            CCTR1$         4          COLHDG('COST' 'CENTER1')
     A            CCTR2$         4          COLHDG('COST' 'CENTER2')
     A            VOLUM$         5  3       COLHDG('VOLUME' 'IN CBM')
     A            MILES$         5  0       COLHDG('MILEAGE')
     A            TRDST$         6          COLHDG('TARIFF/DIST')
     A            TRDSC$         1          COLHDG('TARIFF/DIST' 'CHG')
     A            DRVTP$         1          COLHDG('DRIVER TYPE')
     A            PROTP$         1          COLHDG('PRO' 'TYPE')
     A            PROST$         3          COLHDG('PRO' 'SUB-TYPE')
     A            HOURS$         5  2       COLHDG('HOURS' 'RUN')
     A            REVTY$         1          COLHDG('REV' 'TYPE')
     A**********************************************************************
     A*           BLPO      -                B/L PURCHASE ORDER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1500000 030000 00010
     A*         R BLPOFM
     A*
     A            ACRECO         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##O         7  0       COLHDG('PRO #')
     A            COMP#O         3          COLHDG('COMPANY')
     A            SEQNOO         3  0       COLHDG('SEQ' 'NUMBER')
     A            PONUMO        17          COLHDG('REF NUMBER')
     A            QUALFO         1          COLHDG('QUALIFIER')
     A*                                        'P' = PO
     A*                                        'A' = APPOINTMENT#
     A*                                        'L' = LOAD NUMBER
     A*                                        'R' = RELEASE
     A*                                        'D' = DEPT
     A*                                        'T' = TRANSFER#/PAYPAL TRANSACTN#
     A*                                        'M' = MANIFEST
     A*                                        'N' = NOTE/PU#
     A*                                        'B' = B/L #
     A*                                        'S' = SEAL
     A*                                        'C' = CONTROL# OR CONTAI
     A*                                        'I' = INTRA COMPANY REF#
     A*                                        'G' = SIGNATURE
     A*                                        'H' = HANDLING PRO
     A*                                        'X' = ADVANCE PRO
     A            DEPT#O         4          COLHDG('DEPT#')
     A            QUANTO         5  0       COLHDG('QUANTITY')
     A**********************************************************************
     A*           BLSI      -                B/L SPECIAL INSTRUCTIONS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 030000 00010
     A*         R BLSIFM
     A*
     A            ACRECQ         1          COLHDG('ACTIVE' 'CODE')
     A            PRO##Q         7  0       COLHDG('PRO #')
     A            SEQNOQ         1  0       COLHDG('SEQ' 'NUMBER')
     A            INSTRQ        70          COLHDG('INSTRUCTIONS')
     A**********************************************************************
     A*           COND      -                CONSIGNEE BAD DEPT FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00010
     A*         R CONDFM
     A*
     A            ACRECDP        1          COLHDG('ACTIVE' 'CODE')
     A            CONS#DP        5  0       COLHDG('CONSIGNEE #')
     A            DEPT#DP        4          COLHDG('DEPT #')
     A            USETYPP        4          COLHDG('USE' 'TYPE')
     A*                                       ' ' = REJECT
     A*                                       'O' = OVERRIDE COLLECT
     A**********************************************************************
     A*           CONG      -                CONSIGNEE GROUP FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R CONGFM
     A*
     A            ACRECCG        1          COLHDG('ACTIVE' 'CODE')
     A            GROUPCG        4          COLHDG('GROUP' 'CODE')
     A            DESCRCG       25          COLHDG('DESCRIPTION')
     A* FIELDS CONTROL REMOTE SYTEM LOGIN CRITIERA AND STATUS
     A* NOTE : MIXED CASE ALLOWED FOR USER AND PWD
     A            USERICG       10          COLHDG('USER ID')
     A            PASSWCG       10          COLHDG('PASSWORD')
     A            LNSTSCG        1          COLHDG('LINE' 'STATUS')
     A*                                       A = ACTIVE
     A*                                       I = INACTIVE
     A* PAGE AND VALIDATION TIMEOUTS IN SECS
     A            PAGTOCG        3  0       COLHDG('PAGE' 'TIMEOUT')
     A            VALTOCG        3  0       COLHDG('VALIDATION' 'T/O')
     A* ROUTING GUIDE WEB LINK ADDRESS
     A            REFERCG      100          COLHDG('WEB' 'REFERENCE')
     A            REFLBCG       50          COLHDG('REF' 'LABEL')
     A**********************************************************************
     A*           CONM      -                CONSIGNEE MESSAGE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 010000 00010
     A*         R CONMFM
     A*
     A            ACRECCM        1          COLHDG('ACTIVE' 'CODE')
     A            CONS#CM        5  0       COLHDG('CONSIGNEE #')
     A            SEQNOCM        1  0       COLHDG('SEQ' 'NUMBER')
     A            MESSACM       70          COLHDG('MESSAGE')
     A**********************************************************************
     A*           CONR      -                CONSOLIDATION RATE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00005
     A*         R CONRFM
     A*
     A            ACRECJ         1          COLHDG('ACTIVE' 'CODE')
     A            ACCT#J         5  0       COLHDG('ACCT #')
     A            FRZIPJ         5  0       COLHDG('FROM' 'ZIP')
     A            TOZIPJ         5  0       COLHDG('TO ZIP')
     A            TYPECJ         1          COLHDG('TYPE' 'CODE')
     A*                                        C = CARTON
     A*                                        G = GOH
     A            COMODJ         1          COLHDG('COMOD' 'CODE')
     A            MINCGJ         7  2       COLHDG('MIN' 'CHARGE')
     A            MAXCGJ         7  2       COLHDG('MAX' 'CHARGE')
     A            LOKUPJ         1          COLHDG('LOOK UP' 'CODE')
     A*                                          = LOOK UP 1 RANGE
     A*                                        N = NO LOOK AHEAD
     A*
     A* RANGES AND CHARGES STORED AS ARRAYS OF 7 X 5.4 PACKED
     A            RANGEJ        21          COLHDG('RANGES')
     A            CHARGJ        21          COLHDG('CHARGES')
     A*
     A            DESCRJ        25          COLHDG('R DESCRIPTION')
     A**********************************************************************
     A*           COXF      -                CONSIGNEE/TERMINAL CROSS REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00005
     A*         R COXFFM
     A*
     A            ACREC9X        1          COLHDG('ACTIVE' 'CODE')
     A            CONS#9X        5  0       COLHDG('CONS #')
     A            TERM#9X        4          COLHDG('TERM #')
     A**********************************************************************
     A*           CSDB      -                CONTAINER STATUS MESSAGES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00005
     A*         R CSDBFM
     A*
     A            CARTNAD       20          COLHDG('CARTON' 'LABEL')
     A            DESTLAD        6          COLHDG('LOGICAL' 'DEST')
     A            DESTPAD        2  0       COLHDG('PHYSICAL' 'DEST')
     A            DATE#AD         L         COLHDG('SORT' 'DATE') DATFMT(*ISO)
     A            TIME#AD         T         COLHDG('SORT' 'TIME')
     A            STAT#AD        1          COLHDG('STATUS')
     A*                                     D=DIVERTED
     A*                                     E=ERROR
     A            TRLR#AD       11          COLHDG('TRAILER' 'NUMBER')
     A**********************************************************************
     A*           CTBL      -                CONTAINER BOL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R CTBLFM
     A*
     A            ACRECCC        1          COLHDG('ACTIVE' 'CODE')
     A            DOCK#CC       15          COLHDG('DO REFERENCE#')
     A            ORDERCC        7  0       COLHDG('ORDER #')
     A            CONT#CC       11          COLHDG('CONTAINER #')
     A            BOL##CC       17          COLHDG('BILL OF LADING')
     A            PIN##CC        5          COLHDG('PIN #')
     A**********************************************************************
     A*           CTBR      -                CONTAINER BROKER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R CTBRFM
     A*
     A            ACRECCB        1          COLHDG('ACTIVE' 'CODE')
     A            BRKCDCB        6          COLHDG('BROKER' 'CODE')
     A            NAMEACB       25          COLHDG('BROKER' 'NAME')
     A            PHONECB       10          COLHDG('PHONE NUMBER')
     A            TERM#CB        4          COLHDG('TERMINAL')
     A            ADDR1CB       25          COLHDG('ADDRESS 1')
     A            ADDR2CB       25          COLHDG('ADDRESS 2')
     A            CITYCB        16          COLHDG('CITY')
     A            STATECB        2          COLHDG('STATE')
     A            ZIPCDCB        5  0       COLHDG('ZIP' 'CODE')
     A**********************************************************************
     A*           CTCM      -                CONTAINER MESSAGE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00010
     A*         R CTCMFM
     A*
     A            ORDERCM        7  0       COLHDG('ORDER #')
     A            SEQ##CM        2S 0       COLHDG('SEQ' 'NUMBER')
     A            COMMTCM       70          COLHDG('MESSAGE')
     A**********************************************************************
     A*           CTDT      -                CONTAINER DETAIL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   2000000 005000 00005
     A*         R CTDTFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR11B
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ORDR11C
     A*
     A            ACRECCD        1          COLHDG('ACTIVE' 'CODE')
     A            ORDERCD        7  0       COLHDG('ORDER #')
     A            CONT#CD       11          COLHDG('CONTAINER #')
     A            LSTDTCD        7  0       COLHDG('LAST FREE' 'DATE')
     A            RDYDTCD        7  0       COLHDG('READY/AVL' 'DATE')
     A            SCHDTCD        7  0       COLHDG('SCHED P/U' 'DATE')
     A            PICDTCD        7  0       COLHDG('PICKUP' 'DATE')
     A            EMTDTCD        7  0       COLHDG('EMPTY' 'DATE')
     A            RTNDTCD        7  0       COLHDG('OUTBOUND' 'DATE')
     A            NOTDTCD        7  0       COLHDG('NOTIFICATION' 'DATE')
     A            NOTTMCD        6  0       COLHDG('NOTIFICATION' 'TIME')
     A            QTYRCCD        7  0       COLHDG('QTY RECEIVED')
     A            WGTRCCD        7  0       COLHDG('WGT RECEIVED')
     A            PRO##CD        7  0       COLHDG('PRO NUMBER')
     A            PRATECD        1          COLHDG('PRO-RATE' 'QTY/WGT FLAG')
     A            STATUCD        2          COLHDG('STATUS')
     A*                                           '  ' = PENDING
     A*                                           'CA' = CANCELLED
     A*                                           'RD' = READY
     A*                                           'SC' = SCHEDULED FOR P/U
     A*                                           'PU' = PICKED UP
     A*                                           'MT' = EMPTIED
     A*                                           'NO' = NOTIFIED
     A*                                           'OB' = OUTBOUND YARD
     A            PUCARCD        4          COLHDG('P/U' 'CARRIER')
     A            CPRO#CD       10          COLHDG('CARRIER' 'PRO#')
     A            AMTPDCD        7  2       COLHDG('PER DIEM' 'AMOUNT')
     A            PAYDTCD        6  0       COLHDG('DATE PAID')
     A*                                            MMDDYY
     A            CUBEMCD        5  3       COLHDG('CUBIC' 'METERS')
     A            NOTEFCD        1          COLHDG('NOTIF' 'FLAG')
     A*                                      P=NOTIFICATION PRINTED
     A            QTYTPCD        1          COLHDG('QUANTITY' 'TYPE')
     A*                                           'C' = CARTONS
     A*                                           'G' = GOH
     A*                                           'X' = MIXED ???
     A* FOLLOWING FIELD IN NOT USED ANYMORE OCT 2009
GPHDGA            MTLOCCD        4          COLHDG('EDI OUTBD FLAG')
     A* READY TIME - MAY 2005
     A            RDYTMCD        1          COLHDG('READY/AVL' 'TIME')
     A*                                       A = AM, P = PM
     A* NEW FIELDS FOR CA - JULY 2005
     A            PUTIMCD        4  0       COLHDG('PICKUP' 'TIME')
     A            PUCHGCD        1          COLHDG('PEAK FEE' 'CHARGED')
     A*                                        Y = YES(PEAK)
     A*                                        N = NO (OFF-PEAK)
     A            RCODECD        3          COLHDG('REGISTER' 'CODE')
     A            ORDR#CD        7  0       COLHDG('ORDR ORDER#')
     A            ORDR2CD        7  0       COLHDG('ORDR ORDER#' 'FOR MT')
     A* NEW FIELD FOR HOLD STATUS
     A            STATHLD        6          COLHDG('HOLD' 'STATUS')
     A* NEW FIELD FOR CONTAINER SIZE & TYPE
PR02 A            CTSIZCD        2          COLHDG('CONTAINER' ' SIZE')
PR02 A            CTTYPCD        2          COLHDG('CONTAINER' ' TYPE')
PR02 A*                                       DV = STANDARD DRY VAN
PR02 A*                                       HC = HIGH CUBE
PR02 A*                                       RV = REFER
PR03 A            MTLO2CD        6          COLHDG('EMPTY DECON LOCATION')
PR04 A            APPT1CD        4  0       COLHDG('APPOINTMENT' 'TIME 1')
PR04 A            APPT2CD        4  0       COLHDG('APPOINTMENT' 'TIME 2')
NC41 A            CHASSCD       11          COLHDG('CHASSIS')
NC41 A*                                       4-PREFIX
NC41 A*                                       7-NUMBER
NC41 A            RTCARCD        4          COLHDG('RETURN' 'CARRIER')
NC41 A*                                       CHASSIS RETURN CARRIER
PR05 A            STRTTCD        1          COLHDG('STREET' 'TURN Y/N')
PR05 A            RCPRTCD        1          COLHDG('RETURN CARR' 'PRINT FLAG')
PR05 A*                                           'P' OR ' '
PR05 A            UFLG1CD        1          COLHDG('USER FLAG #1')
PR05 A*                                   USED TO INDICATE IF FROM WEB
PR05 A*                                           'W' OR ' '
PR05 A            UFLG2CD        1          COLHDG('USER FLAG #2')
PR05 A*                                   USED FOR WEB APPLICATION POE
PR05 A*                                           '1','0', ' '
PR05 A            UFLG3CD        1          COLHDG('USER FLAG #3')
PR05 A*                                   USED FOR SCHEDULED EMAIL FLAG
PR05 A*                                            E = TO BE EMAILED
PR05 A*                                            S = SENT
PR05 A            UFLG4CD        1          COLHDG('USER FLAG #4')
     A*                                   USED FOR CONTAINTER PRIORITY
     A*                                              = REGULAR
     A*                                            0 = HIGHEST
     A*                                            1 = HIGH
PR06 A            PRPLLCD        6          COLHDG('PRE-PULL' 'LOCATION')
PR06 A            APULOCD        6          COLHDG('ALT P/U'  'LOCATION')
     A            APPT#CD        4S 0       COLHDG('SCHED' 'APPT#')
     A            DCLOCCD        6          COLHDG('DECON' 'LOCATION')
     A            CHSPLCD        4          COLHDG('CHASSIS' 'POOL')
     A* POE STATUS FOR TJX POE'S ONLY
     A            POESTCD        1          COLHDG('POE' 'STATUS')
     A*                                        ' ' = REGULAR
     A*                                        'E' = EXPIRED
GC03 A* CUSTOM INSPECTION REQUIRED - JUNE 2015
GC03 A            CUSINCD        1          COLHDG('CSTM' 'INSP')
GC04 A* TJX POE MILESTONE FLAGS - JULY 2016
GC04 A* DO ENTRY < 10 DAYS OF CANCEL
GC04 A            DO10FLG        1          COLHDG('DO10')
GC04 A* ETA < 4 DAYS OF CANCEL
GC04 A            ETA4FLG        1          COLHDG('ETA4')
GC04 A* AVL < 2 OF CANCEL
GC04 A            AVL2FLG        1          COLHDG('AVL2')
GC04 A* AVL < 0 OF CANCEL - (ORDER SUSPENDED)
GC04 A            AVL0FLG        1          COLHDG('AVL0')
     A*
GC05 A* DB CHANGES ADDED JULY 2018
GC05 A            RETDTCD        7  0       COLHDG('RETURN BY' 'DATE')
GC05 A            PDAMTCD        9  2       COLHDG('EST' 'PER DIEM')
GC05 A            TRMSTCD       20          COLHDG('TERMINAL STATUS')
     A*
     A            TJD94CD        1          COLHDG('TJX' 'DEPT 94')
     A*                                     Y = DEPT 94 OVERRIDE
     A            OFHIRCD        1          COLHDG('OFF' 'HIRE')
     A*                                     Y = FLAGGED FOR OFF HIRE
     A            OFHLOCD        6          COLHDG('OFFHIRE' 'LOCATION')
     A*                                     Y = FLAGGED FOR OFF HIRE
     A**********************************************************************
     A*           CTHD      -                CONTAINER CONTROL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 003000 00005
     A*         R CTHDFM
     A*
     A            ACRECCH        1          COLHDG('ACTIVE' 'CODE')
     A            DOCK#CH       15          COLHDG('DO REFERENCE#')
     A            TERM#CH        4          COLHDG('TERMINAL')
     A            ORDERCH        7  0       COLHDG('ORDER #')
     A            BRKCDCH        6          COLHDG('BROKER' 'CODE')
     A            PULOCCH        6          COLHDG('PICKUP' 'LOCATION')
     A            VESSLCH       15          COLHDG('VESSEL' 'NAME')
     A            CONS#CH        5  0       COLHDG('CONSIGNEE')
     A            IMTYPCH        1          COLHDG('IMPORT' 'TYPE')
     A*                                        P = PORT OF ENTRY
     A*                                        D = DIRECT IMPORT
     A*                                        I = IMPORT
     A            TOQTYCH        7  0       COLHDG('QUANTITY')
     A            TOWGTCH        7  0       COLHDG('WEIGHT')
     A            ETADTCH        7  0       COLHDG('ETA DATE')
     A            RCVDTCH        7  0       COLHDG('RECEIVED' 'DATE')
     A            ENTDTCH        7  0       COLHDG('ENTRY' 'DATE')
     A            ENTTMCH        4  0       COLHDG('ENTRY' 'TIME')
     A            CONTNCH        4  0       COLHDG('# OF CONTAINERS')
     A* ARRIVAL DATE - MAY 2005
     A            ARVDTCH        7  0       COLHDG('ARRIVAL' 'DATE')
     A* D/O RECEIVED TIME - MAY 2005
     A            RCVTMCH        1          COLHDG('RECEIVED' 'TIME')
     A*                                       A = AM, P = PM
     A* DECONSOLIDATOIN LOCATION - SEP 2009
     A            DCLOCCH        6          COLHDG('DECONSOL' 'LOCAT')
     A* STEAMSHIP LINE - AUG 2010
     A            SSLCDCH        4          COLHDG('STEAMSHIPLINE')
     A* TO DISTINGUISH - PURE TJX/MAR OR PURE HG PO'S OR MIXED PO'S
     A            CUSINCH        1          COLHDG('TJX PO DIV')
     A*                                        ' ' = NS
     A*                                        'T' = TJ/MAR ONLY
     A*                                        'H' = HOME GOODS ONLY
     A*                                        'M' = MIXED CHAINS
     A*
     A* NEW EXPANDED VESSEL NAME FIELD -
     A            VESELCH       35          COLHDG('VESSEL' 'NAME')
     A* JULY 2018 ADDITION
GC05 A            ETAORCH        7  0       COLHDG('ORIGINAL' 'ETA DATE')
     A**********************************************************************
     A*           CTLO      -                CONTAINER LOCATION FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R CTLOFM
     A*
     A            ACRECCL        1          COLHDG('ACTIVE' 'CODE')
     A            PULOCCL        6          COLHDG('LOCATION' 'CODE')
     A            NAMEACL       25          COLHDG('NAME')
     A            ADDRSCL       25          COLHDG('ADDRESS 1')
     A            CITYCCL       17          COLHDG('CITY')
     A            STATECL        2          COLHDG('STATE')
     A            ZIPCDCL        5  0       COLHDG('ZIP CODE')
     A            PHONECL       10          COLHDG('PHONE NUMBER')
     A            DAYS#CL        1  0       COLHDG('# OF DAYS')
     A            TERM#CL        4          COLHDG('TERMINAL')
     A**********************************************************************
     A*           CTSH      -                CONTAINER STATUS HOLD
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000300 00003
     A*         R CTSHFM
     A*
     A            ACRECCS        1          COLHDG('ACTIVE' 'CODE')
     A            STATHCS        6          COLHDG('STATUS HOLD' 'CODE')
     A            SHDSCCS       25          COLHDG('DESCRIPTION')
     A**********************************************************************
     A*           CTWB      -                THIRD PART MT CONTAINER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R CTWBFM
     A*
     A            ACRECWB        1          COLHDG('ACTIVE' 'CODE')
     A            DCLOCWB        6          COLHDG('DECONSOL' 'LOCAT')
     A            ORDERWB        7  0       COLHDG('ORDER #')
     A            CONT#WB       11          COLHDG('CONTAINER #')
     A            STATPWB        2          COLHDG('PRIOR STATUS')
     A            STATNWB        2          COLHDG('NEW STATUS')
     A            TRANDWB        7  0       COLHDG('TRANSACTION' 'DATE')
     A            TRANTWB        6  0       COLHDG('TRANSACTION' 'TIME')
     A            PROCFWB        1          COLHDG('PROCESS' 'FLAG')
     A            LFREEWB        7  0       COLHDG('LAST FREE' 'DATE')
     A            EMSAGWB       20          COLHDG('ERROR' 'MESSAGE')
     A            WUSERWB       30          COLHDG('WEB' 'USER')
     A**********************************************************************
     A*           CTWF      -                CONTAINER FLASH HISTORY WORKFILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R CTWFFM
     A*
     A            ACRECWF        1          COLHDG('ACTIVE' 'CODE')
     A            PDATEWF         L         COLHDG('PROCESS' 'DATE')
     A                                      DFT('0001-01-01')
     A            CTERMWF        4          COLHDG('EAST/WEST' 'COAST')
     A            CPICYWF        5  0       COLHDG('CT PICKED-UP' 'YESTERDAY')
     A            CDO#YWF        5  0       COLHDG('CT ON D/O')
     A            CAVLYWF        5  0       COLHDG('CT AVAILABLE')
     A            CFCSTWF        5  0       COLHDG('CT FORECAST' 'TODAY')
NEW  A            CFCPMWF        5  0       COLHDG('CT FORECAST' 'PM')
     A            CYARDWF        5  0       COLHDG('CT IN YARD')
     A            CYRD1WF        5  0       COLHDG('CT IN YARD 1DAY')
     A            CYRD2WF        5  0       COLHDG('CT IN YARD 2DAY')
     A            CYRD3WF        5  0       COLHDG('CT IN YARD 3DAY')
     A            YDATEWF         L         COLHDG('CT IN YARD' 'OLDEST')
     A                                      DFT('0001-01-01')
     A            CMT24WF        5  0       COLHDG('CT EMPTIED' '24 HRS')
     A            OBLRDWF        5  0       COLHDG('O/B LOADS' 'RDY FOR PICKUP')
     A            OBL24WF        5  0       COLHDG('O/B LOADS' 'GT 24HRS.')
     A            MANFYWF        5  0       COLHDG('MANIFESTS' 'YESTERDAY')
     A            VPAVTWF        5  0       COLHDG('VENDOR PICKUPS' 'AVL TODAY')
     A            VDATEWF         L         COLHDG('VND NOT PICKED UP' 'OLDEST')
     A                                      DFT('0001-01-01')
     A            VLDPYWF        5  0       COLHDG('VND LOADS' 'AVAILABLE YEST')
     A            VLDP2WF        5  0       COLHDG('VND LOADS' 'AVAIL 2 DAYS')
     A            VLDP3WF        5  0       COLHDG('VND LOADS' 'AVAIL 3 DAYS')
     A            CPIC2WF        5  0       COLHDG('CT PICKED-UP' 'YESTERDAY')
     A            VLDPKWF        5  0       COLHDG('VND LOADS' 'PICKED UP YEST')
     A**********************************************************************
     A*           CTWR      -                TJMAXX CONTAINER WORFILE RAY JR.
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R CTWRFM
     A*
     A            ACRECWR        1          COLHDG('ACTIVE' 'CODE')
     A            PDATEWR         L         COLHDG('PROCESS' 'DATE')
     A                                      DFT('0001-01-01')
     A            TERM#WR        4          COLHDG('TERMINAL')
     A            ORDERWR        7  0       COLHDG('ORDER #')
     A            CONS#WR        5  0       COLHDG('CONSIGNEE')
     A            EDATEWR         L         COLHDG('ETA' 'DATE')
     A                                      DFT('0001-01-01')
     A            CONT#WR       11          COLHDG('CONTAINER #')
     A            STATUWR        2          COLHDG('STATUS')
     A            PO###WR       22          COLHDG('PO#')
     A            LDATEWR         L         COLHDG('LADDER' 'DATE')
     A                                      DFT('0001-01-01')
     A            PULOCWR        6          COLHDG('PICKUP' 'LOCATION')
     A            DEPT#WR        6          COLHDG('DEPARTMENT')
     A            SDATEWR         L         COLHDG('START' 'DATE')
     A                                      DFT('0001-01-01')
     A            CDATEWR         L         COLHDG('CONSOLIDATION' 'DATE')
     A                                      DFT('0001-01-01')
     A            DIVI#WR        2          COLHDG('DIVISION')
     A            VNAMEWR       30          COLHDG('VENDOR' 'NAME')
     A**********************************************************************
     A*           CTXR      -                CONTAINER CROSS-REF 317
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 003000 00005
     A*         R CTXRFM
     A*
     A            ACRECCR        1          COLHDG('ACTIVE' 'CODE')
     A            QUALFCR        2          COLHDG('QUALIFIER')
     A            NAMEECR       60          COLHDG('LOCATION' 'NAME')
     A            LCODECR        6          COLHDG('LOCATION' 'CODE')
     A            ADDRECR       30          COLHDG('ADDRESS')
     A            CITYECR       20          COLHDG('CITY')
     A            STATECR        2          COLHDG('STATE')
     A            CONT#CR       11          COLHDG('CONTAINER #')
GP   A            FAMGRCR        2          COLHDG('FAMILY' 'GROUP')
GP   A*                                       'TJ' - TJX
GP   A*                                       'IK' - IKEA
     A**********************************************************************
TRIP A*           DTFD      -                FEDERATED TRIP DETAIL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 030000 00010
     A*         R DTFDFM
     A*
     A            ACRECFD        1          COLHDG('ACTIVE' 'CODE')
TRIP A** THIS TRIP# FIELD WAS ALREADY TO SET TO 7/0;  WAS NOT CHANGED
     A            TRIP#FD        7  0       COLHDG('TRIP#')
     A            STOREFD        5  0       COLHDG('STORE' 'NUMBER')
     A*
     A            TRAILFD       10          COLHDG('TRAILER')
     A**********************************************************************
     A*           DW019RWK  -                DW019R WORK FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0030000 010000 00010
     A*         R DW019RFM
     A*
     A            CARTNWK       20          COLHDG('CARTON LABEL')
     A            DCLOCWK        5  0       COLHDG('DC' 'LOCATION')
     A            PONUMWK        7          COLHDG('PO NUMBER')
     A            TRLIBWK       11          COLHDG('INBOUND' 'TRAILER')
     A            VNAMEWK       20          COLHDG('VENDOR NAME')
     A**********************************************************************
TRIP A*           HDFD      -                FEDERATED TRIP HEADER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0200000 025000 00005
     A*         R HDFDFM
     A*
     A            ACRECFH        1          COLHDG('ACTIVE' 'REC CODE')
TRIP A** THIS TRIP# FIELD WAS ALREADY TO SET TO 7/0;  WAS NOT CHANGED
     A            TRIP#FH        7  0       COLHDG('TRIP #')
     A            DRIVEFH        6          COLHDG('DRIVER #')
     A            TRACKFH       10          COLHDG('TRACTOR')
     A*
     A* IN OUT DATE AND TIME
     A            OBDATFH        7  0       COLHDG('OUT' 'DATE')
     A            OBTIMFH        4  0       COLHDG('OUT' 'TIME')
     A            IBDATFH        7  0       COLHDG('IN' 'DATE')
     A            IBTIMFH        4  0       COLHDG('IN' 'TIME')
     A            MILESFH        5  0       COLHDG('MILES')
     A*
     A* PRO IS POPULATED WHEN TRIP IS BILLED
     A            PRO##FH        7  0       COLHDG('PRO #')
     A            STAT1FH        1          COLHDG('STATUS')
     A*                                        B = BILLED
     A**********************************************************************
     A*           HLDY      -                HOLIDAY FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 002000 00010
     A*         R HLDYFM
     A*
     A            ACRECHD        1          COLHDG('ACTIVE' 'CODE')
     A            DATEHHD        8  0       COLHDG('HOLIDAY' 'DATE')
     A*                                        YYYYMMDD
     A            DESCRHD       25          COLHDG('HOLIDAY' 'NAME')
     A**********************************************************************
     A*           HLXF      -                HOLIDAY/TERMINAL CROSS REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00005
     A*         R HLXFFM
     A*
     A            ACRECHX        1          COLHDG('ACTIVE' 'CODE')
     A            DATEHHX        8  0       COLHDG('HOLIDAY' 'DATE')
     A            TERM#HX        4          COLHDG('TERM #')
     A**********************************************************************
     A*           ILCA      -                INTERLINE CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00010
     A*         R ILCAFM
     A*
     A            ACRECI         1          COLHDG('AMOUNT' 'CALC')
     A*                                       ' ' = INTERLINE AMT
     A*                                       'N' = NRT AMOUNT
     A            ILCODI         4          COLHDG('I/L' 'CODE')
     A            NAMEAI        25          COLHDG('NAME')
     A            ACCT#I         5  0       COLHDG('BILL TO' 'ACCT')
     A            IMPRTI         1          COLHDG('IMPORT' 'CARR')
     A*                                        Y = YES
     A* FOLLOWING FIELDS USED FOR IMPORT CARRIERS ONLY
     A            STAT1I         2          COLHDG('STATE' 'CODE1')
     A            RATE1I         7  2       COLHDG('RATE' 'CODE1')
     A            STAT2I         2          COLHDG('STATE' 'CODE2')
     A            RATE2I         7  2       COLHDG('RATE' 'CODE2')
     A            STAT3I         2          COLHDG('STATE' 'CODE3')
     A            RATE3I         7  2       COLHDG('RATE' 'CODE3')
     A*
     A            APCDEI         4          COLHDG('A/P' 'CODE')
     A* ADDED ON 9/21/12
     A            SRVAGI         1          COLHDG('SERVICE' 'AGREEMENT')
     A*                                     N = MISSING / Y = OK
     A            OPAUTI         1          COLHDG('OPERATION' ' AUTHORITY')
     A*                                     N = MISSING / Y = OK
     A            RTSHTI         1          COLHDG('RATE' 'SHEET')
     A*                                     N = MISSING / U = UNSIGNED / Y = OK
     A            INSEXI          L         COLHDG('INS SERTIFICATE' 'EXP DATE')
     A                                      DFT('0001-01-01')
     A            LSTUSI        10          COLHDG('LAST UPDATE' 'USER')
     A            LSTDTI          L         COLHDG('LAST UPDATE' 'DATE')
     A                                      DFT('0001-01-01')
     A            CLSCDI         1          COLHDG('CLASSIFICATION' 'CODE')
     A*                                     C = CARRIER
     A*                                     L = LEASE
     A*                                     E = EXPORT ONLY
     A*                                     I = INTERNAL
     A* DISPATCH CONTAINER ORDERS -
     A            DSPORI         1          COLHDG('DISP' 'CT ORDER')
     A*                                     Y = YES
     A* OUTBOUND EDI CODES -
     A            EDISCI         4          COLHDG('EDI' 'SCAC')
     A            EDITYI         1          COLHDG('EDI' 'TYPE')
     A*                                     A = ALL
     A*                                     T = TRUCKLOAD
     A*                                     L = LTL
     A**********************************************************************
     A*           ILCX      -                INTERLINE CARRIERS EXTENTION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00010
     A*         R ILCXFM
     A*
     A            ILCODIX        4          COLHDG('I/L' 'CODE')
     A            LAWIDIX        9  0       COLHDG('LAWSON' 'ID')
     A            SEQNOIX        3  0       COLHDG('VIRTUAL' 'DRIVER' 'SEQ#')
     A            ILSCAIX        4          COLHDG('I/L' 'SCAC')
     A            CMPCDIX       30          COLHDG('COMPANY' 'CODES' 'ARRAY')
     A**********************************************************************
     A*           LHRT      -                LINEHAUL FROM NART RATE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00003
     A*         R LHRTFM
     A*
     A            ACRECLH        1          COLHDG('ACTIVE' 'CODE')
     A            DESTCLH        4  0       COLHDG('DEST' 'CODE')
     A            SCAC#LH        4          COLHDG('SCAC' 'CODE')
     A            LHRATLH        5  0       COLHDG('LINEHAUL' 'RATE')
     A**********************************************************************
     A*           LNTS      -                LNT STORE - DC FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 030000 00010
     A*         R LNTSFM
     A*
     A            STORELS        5  0       COLHDG('STORE')
     A            DISTCLS        5  0       COLHDG('DC NUMBER')
     A**********************************************************************
     A*           LODT      -                LOAD DETAIL FILE (STERNS)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 005000 00003
     A*         R LODTFM
     A*
     A            ACRECL         1          COLHDG('ACTIVE' 'CODE')
     A            TRAN#L         7  0       COLHDG('TRANS #')
     A            CUSTCL         2          COLHDG('CUST' 'CODE')
     A            TRAILL         8          COLHDG('TRAILER')
     A            LODTEL          L         DATFMT(*MDY) COLHDG('LOAD' 'DATE')
     A            PRO##L         7  0       COLHDG('PRO #')
     A            PONUML         9  0       COLHDG('PO #')
     A            DEPT#L         4          COLHDG('DEPT')
     A            QUANTL         5  0       COLHDG('QUANTITY')
     A            WEIGHL         5  0       COLHDG('WEIGHT')
     A**********************************************************************
     A*           LOHD      -                LOAD HEADER FILE (STERNS)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 00005
     A*         R LOHDFM
     A*
     A            ACRECK         1          COLHDG('ACTIVE' 'CODE')
     A            CUSTCK         2          COLHDG('CUST' 'CODE')
     A            TRAILK         8          COLHDG('TRAILER')
     A            LODTEK          L         DATFMT(*MDY) COLHDG('LOAD' 'DATE')
     A**********************************************************************
     A*           MODE      -                OZ MODE ANALYSIS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00010
     A*         R MODEFM
     A*
     A            ACREC13        1          COLHDG('ACTIVE' 'REC CODE')
     A            VENDC13        7  0       COLHDG('VENDOR' 'NUMBER')
     A            DESTC13        4  0       COLHDG('DEST' 'CODE')
     A            PUMON13        2  0       COLHDG('PICKUP' 'MONTH')
     A            PUYR#13        4  0       COLHDG('PICKUP' 'YEAR')
     A            LOAD#13        7  0       COLHDG('NRS' 'LOAD#')
     A            STOP#13        5  0       COLHDG('STOP' 'NUMBER'     )
     A            SCAC#13        4          COLHDG('SCAC')
     A            VNAME13       35          COLHDG('VENDOR' 'NAME')
     A            ADDR113       35          COLHDG('VENDOR' 'ADDRESS')
     A            CITYC13       30          COLHDG('VENDOR' 'CITY')
     A            STATE13        2          COLHDG('VENDOR' 'STATE')
     A            ZIPCD13        5  0       COLHDG('VENDOR' 'ZIPCD')
     A            CUBES13        9  0       COLHDG('CUBE')
     A            WEIGH13        9  0       COLHDG('WEIGHT')
     A            QCTNS13        9  0       COLHDG('CTNS')
     A            RATE$13        9  0       COLHDG('RATE')
     A            LOADS13        5  0       COLHDG('LOADS')
     A**********************************************************************
     A*           MOVE      -                MOVEMENT FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1500000 030000 00010
     A*         R MOVEFM
     A*
     A            ACRECN         1          COLHDG('ACTIVE' 'REC CODE')
     A            PRO##N         7  0       COLHDG('PRO' 'NUMBER')
     A            MOVE#N         7  0       COLHDG('MOVE' 'NUMBER')
     A*
     A* STARTING/ENDING QTY
     A            STQTYN         5  0       COLHDG('STARTING QTY')
     A            ENQTYN         5  0       COLHDG('ENDING QTY')
     A**********************************************************************
     A*           MTLC      -                CONTAINER EMPTY LOCATION FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00005
     A*         R MTLCFM
     A*
     A            MTLOCMT        4          COLHDG('EMPTY' 'LOCATION')
     A            LNAMEMT       20          COLHDG('LOCATION NAME')
     A**********************************************************************
     A*           NOTW      -                NOTIFICATION WORK FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000025 00010
     A*         R NOTWFM
     A*
     A            ACRECNW        1          COLHDG('ACTIVE' 'REC CODE')
     A            SCAC#NW        4          COLHDG('SCAC' 'CODE')
     A            TRMIDNW        4          COLHDG('TERM' 'I.D.')
     A            MTLOCNW        4          COLHDG('EMPTY' 'LOCATION')
     A            MTLO2NW        6          COLHDG('EMPTY' 'DECON LOCATION')
     A**********************************************************************
     A*           PUDT      -                PICK UP DETAIL (DISPATCH)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0900000 030000 00005
     A*         R PUDTFM
     A*
     A            ACREC2         1          COLHDG('ACTIVE' 'REC CODE')
     A            PUNUM2         7  0       COLHDG('P/U' 'NUMBER')
     A            LIN##2         3  0       COLHDG('LINE #')
     A*
     A* CONSIGNEE INFO
     A            CONS#2         5  0       COLHDG('CONS #')
     A            CONSN2        25          COLHDG('CONS' 'NAME')
     A*
     A* SHIPMENT INFO
     A            PPDCO2         1          COLHDG('PPD/COL')
     A            CTNQT2         5  0       COLHDG('CTN' 'QTY')
     A            GOHQT2         5  0       COLHDG('GOH' 'QTY')
     A            WEIGH2         5  0       COLHDG('WEIGHT')
     A            CUBFT2         5  0       COLHDG('CUBIC' 'FEET')
     A            COAMT2         7  2       COLHDG('COLLECT AMT')
     A* BOL (OPTIONAL)
     A            BOL##2        17          COLHDG('BILL OF LADING')
     A* FIELDS ADDED OCT 05 FOR AUTO RATING
     A            GOHTY2         1          COLHDG('GOH' 'TYPE')
     A            AGGGR2         4          COLHDG('AGG' 'GROUP' 'CODE')
NC11 A            CLASS2         4          COLHDG('WGT' 'CLASS')
     A* QUANTITIES RECEIVED
     A            TGOHR2         5  0       COLHDG('GOH' 'RCV')
     A            TCTNR2         5  0       COLHDG('CTN' 'RCV')
     A            TWGTR2         5  0       COLHDG('WEIGHT' 'RCV')
     A**********************************************************************
     A*           PUHS      -                PU PO VENDOR UPDATES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1500000 010000 00005
     A*         R PUHSFM
     A*
     A            ACRECPH        1          COLHDG('ACTIVE' 'REC CODE')
     A            PUNUMPH        7  0       COLHDG('P/U' 'NUMBER')
     A            LIN##PH        3  0       COLHDG('LINE #')
     A            SEQNOPH        3  0       COLHDG('SEQUENCE')
     A*
     A* PURCHASE ORDER DETAIL
     A            PONUMPH       15          COLHDG('P/O #')
     A            DEPT#PH        4          COLHDG('DEPT #')
     A            CTNQTPH        5  0       COLHDG('CTN' 'QTY')
     A            GOHQTPH        5  0       COLHDG('GOH' 'QTY')
     A            WEIGHPH        5  0       COLHDG('WEIGHT')
     A            CUBFTPH        5  0       COLHDG('CUBE')
     A            AUTH#PH        8          COLHDG('ORIG' 'AUTH #')
     A            CTNQ1PH        5  0       COLHDG('ORIG' 'CTN' 'QTY')
     A            GOHQ1PH        5  0       COLHDG('ORIG' 'GOH' 'QTY')
     A            WEIG1PH        5  0       COLHDG('ORIG' 'WEIGHT')
     A            CUBF1PH        5  0       COLHDG('ORIG' 'CUBE')
     A            AUTH1PH        8          COLHDG('ORIG' 'AUTH #')
     A* TRANS DATE & TIME
     A            DATECPH         L         COLHDG('DATE' 'CHANGED')
     A            TIMECPH        4  0       COLHDG('TIME' 'CHANGED')
     A* CURRENT STATUS
     A            STATUPH        1          COLHDG('CURRENT' 'STATUS')
     A**********************************************************************
     A*           PUPO      -                PO DETAIL FILE (DISPATCH)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1500000 010000 00005
     A*         R PUPOFM
     A*
     A            ACREC0         1          COLHDG('ACTIVE' 'REC CODE')
     A            PUNUM0         7  0       COLHDG('P/U' 'NUMBER')
     A            LIN##0         3  0       COLHDG('LINE #')
     A            SEQNO0         3  0       COLHDG('SEQUENCE')
     A            CONS#0         5  0       COLHDG('CONSIGNEE')
     A            TERM#0         4          COLHDG('TERMINAL')
     A*
     A* PURCHASE ORDER DETAIL
     A            PONUM0        15          COLHDG('P/O #')
     A            DEPT#0         4          COLHDG('DEPT #')
     A            CTNQT0         5  0       COLHDG('CTN' 'QTY')
     A            GOHQT0         5  0       COLHDG('GOH' 'QTY')
     A            GOHTY0         1          COLHDG('GOH' 'TYPE')
     A            WEIGH0         5  0       COLHDG('WEIGHT')
     A            CUBFT0         5  0       COLHDG('CUBE')
     A            AUTH#0         8          COLHDG('AUTH #')
     A*
     A* VERIFICATION STATUS
     A            STATU0         1          COLHDG('STATUS')
     A*                                        P = PRINTED
     A*                                        * = PRE-VERIFIED
     A*                                        V = VERIFIED ONLINE
     A* QUANTITIES RECEIVED
     A            TGOHR0         5  0       COLHDG('GOH' 'RCV')
     A            TCTNR0         5  0       COLHDG('CTN' 'RCV')
     A            TWGTR0         5  0       COLHDG('WEIGHT' 'RCV')
     A**********************************************************************
     A*           OSDR    -                  OS&D FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0040000 005000 00003
     A*         R OSDRFM
     A*
     A            ACREC7         1          COLHDG('ACTIVE' 'CODE')
     A            REP##7         4          COLHDG('REPORT TERMINAL')
     A            OSD##7         7  0       COLHDG('OS&D #')
     A            DELMM7         2S 0       COLHDG('DELIVERY MONTH')
     A            DELDD7         2S 0       COLHDG('DELIVERY DAY')
     A            DELYY7         2S 0       COLHDG('DELIVERY YEAR')
     A            DELCC7         1S 0       COLHDG('DELIVERY CENTURY')
     A            PRO##7         7  0       COLHDG('PRO #')
     A            PROMM7         2S 0       COLHDG('PRO MONTH')
     A            PRODD7         2S 0       COLHDG('PRO DAY')
     A            PROYY7         2S 0       COLHDG('PRO YEAR')
     A            PROCC7         1S 0       COLHDG('PRO CENTURY')
     A            RPRO#7         7  0       COLHDG('RESOLUTION PRO #')
     A            TRAL17         8          COLHDG('TRAILER #')
     A            BLNUM7        10          COLHDG('BL NUMBER')
     A            ORIGN7         4          COLHDG('ORIGIN TERMINAL')
     A            DESTN7         4          COLHDG('DESTINATION TERM')
     A*  SHIPPER & CONSIGNEE INFORMATION
     A            SHIPN7        25          COLHDG('SHIPPER')
     A            SHADD7        30          COLHDG('SHIPPER ADD1')
     A            CONSN7        25          COLHDG('CONSIGNEE')
     A            COADD7        30          COLHDG('CONSIGNEE ADD1')
     A*  OS&D DETAIL INFORMATION
     A            STATS7         1          COLHDG('REPORT STATUS')
     A*                                           = OPEN
     A*                                         R = RESOLVED
     A*                                         U = UNRESOLVED
     A            TOSHP7         5  0       COLHDG('TOTAL SHIPPED')
     A            TODEL7         5  0       COLHDG('TOTAL DELIVERED')
     A            OSDRC7         1          COLHDG('OS&D REASON CODE')
     A*                                         1 = SHORT
     A*                                         2 = OVER
     A*                                         3 = DAMAGED
     A*                                         4 = SOILED
     A*
     A            QTYL17         5  0       COLHDG('QTY')
     A            TYPE17        12          COLHDG('TYPE')
     A            MSTY17         7          COLHDG('MFG STYLE #')
     A            RSTY17        15          COLHDG('RETAIL STYLE #')
     A            RN##17         7          COLHDG('RN WPL #')
     A            COST17         9  2       COLHDG('COST')
     A            RETL17         9  2       COLHDG('RETAIL PRICE')
     A            DESC17        40          COLHDG('DESCRIPTION')
     A*                                                                *****
     A            QTYL27         5  0       COLHDG('QTY')
     A            TYPE27        12          COLHDG('TYPE')
     A            MSTY27         7          COLHDG('MFG STYLE #')
     A            RSTY27        15          COLHDG('RETAIL STYLE #')
     A            RN##27         7          COLHDG('RN WPL #')
     A            COST27         9  2       COLHDG('COST')
     A            RETL27         9  2       COLHDG('RETAIL PRICE')
     A            DESC27        40          COLHDG('DESCRIPTION')
     A*                                                                *****
     A            QTYL37         5  0       COLHDG('QTY')
     A            TYPE37        12          COLHDG('TYPE')
     A            MSTY37         7          COLHDG('MFG STYLE #')
     A            RSTY37        15          COLHDG('RETAIL STYLE #')
     A            RN##37         7          COLHDG('RN WPL #')
     A            COST37         9  2       COLHDG('COST')
     A            RETL37         9  2       COLHDG('RETAIL PRICE')
     A            DESC37        40          COLHDG('DESCRIPTION')
     A*
     A            OSDTY7         1          COLHDG('POINT OF LOSS')
     A*                                         1 = SHORT LOCAL PICKUP
     A*                                         2 = SHORT OUTBD LOADING
     A*                                         3 = SHORT UNLOAD INBD
     A*                                         4 = SHORT LOADING DEL
     A*                                         5 = SHORT ON DELIVERY
     A            NAME17        15          COLHDG('PERSONNEL 1')
     A            NAME27        15          COLHDG('PERSONNEL 2')
     A            NAME37        15          COLHDG('PERSONNEL 3')
     A            UNLMM7         2S 0       COLHDG('UNLOAD MONTH')
     A            UNLDD7         2S 0       COLHDG('UNLOAD DAY')
     A            UNLYY7         2S 0       COLHDG('UNLOAD YEAR')
     A            UNLCC7         1S 0       COLHDG('UNLOAD CENTURY')
     A*
     A            COMM17        75          COLHDG('COMMENTS 1')
     A            COMM27        75          COLHDG('COMMENTS 2')
     A            COMM37        75          COLHDG('COMMENTS 3')
     A            COMM47        75          COLHDG('COMMENTS 4')
     A*
     A            OSDPT7         1          COLHDG('DAILY PRINT FLAG')
     A*                                           = OS&D NOT PRINTED
     A*                                         P = OS&D PRINTED
     A            ENTCC7         1S 0       COLHDG('CENTURY' 'ENTERED')
     A            ENTYY7         2S 0       COLHDG('YEAR' 'ENTERED')
     A            ENTMM7         2S 0       COLHDG('MONTH' 'ENTERED')
     A            ENTDD7         2S 0       COLHDG('DAY' 'ENTERED')
     A            DELIV7         1          COLHDG('SHIPMENT DELIVERED')
     A*                                         N = NOT DELIVERED
     A**********************************************************************
     A*           POOV    -                  PO OVERRIDE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00003
     A*         R POOVFM
     A*
     A            ACRECOV        1          COLHDG('ACTIVE' 'CODE')
     A            GROUPOV        4          COLHDG('GROUP' 'CODE')
     A            PONUMOV       15          COLHDG('PO #')
     A*
     A            EFFDTOV        7  0       COLHDG('EFFECTIVE DATE')
     A            EFFTMOV        4  0       COLHDG('EFFECTIVE TIME')
     A            PPCCPOV        2          COLHDG('PREPAID/COLLECT')
     A*                                     PP - PREPAID
     A*                                     CC - COLLECT
     A            OVER5OV        1          COLHDG('OVER 5000 LB')
     A*                                      Y - YES
     A**********************************************************************
     A*           RATE      -                RATE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000050 00005
     A*         R RATEFM
     A*
     A            ACRECE         1          COLHDG('ACTIVE' 'REC CODE')
     A            RATE#E         4          COLHDG('RATE CODE')
     A            DESCRE        25          COLHDG('RATE' 'DESCRIPTION')
     A            MINCGE         7  2       COLHDG('MINIMUM' 'CHARGE')
     A*
OL5  *****A* RATES STORED AS ARRAY OF 10 X 5.2 PACKED
OL5  *****A            CHARGE        30          COLHDG('CHARGES')
OL5  A* RATES STORED AS ARRAY OF 10 X 7.3 PACKED
     A            CHARGE        40          COLHDG('CHARGES')
     A*
     A* RATE CODE -
     A* NEW 6/99 FOR POOL DISTRIBUTION ONLY AT THIS TIME
     A            RTYPEE         1          COLHDG('RATE' 'TYPE')
     A*          (DEFAULTS TO WEIGHT)        W=WEIGHT, Q=QUANTITY
     A*                                      F=FLAT
     A**********************************************************************
     A*           REDT      -                RECEIVING DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00003
     A*         R REDTFM
     A*
     A            ACRECG         1          COLHDG('ACTIVE' 'REC CODE')
     A            DIST#G         6          COLHDG('DIST' 'CODE')
     A            RECT#G         7  0       COLHDG('RECEIPT #')
     A            LINE#G         3  0       COLHDG('LINE #')
     A            STOREG         5  0       COLHDG('STORE #')
     A            PIECEG         5  0       COLHDG('PIECES')
     A            WGTACG         5  0       COLHDG('WEIGHT')
     A            REFNOG        17          COLHDG('REFER #')
     A**********************************************************************
     A*           REHD      -                RECEIVING HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 005000 00003
     A*         R REHDFM
     A*
     A            ACRECF         1          COLHDG('ACTIVE' 'REC CODE')
     A            DIST#F         6          COLHDG('DIST' 'CODE')
     A            RECT#F         7  0       COLHDG('RECEIPT #')
     A            RECDTF          L         COLHDG('RECEIPT' 'DATE')
     A            TRAILF         8          COLHDG('TRAILER')
     A            REFNOF        17          COLHDG('REFER #')
     A*
     A* SHIPPER DATA
     A            SHIPNF        25          COLHDG('SHIPPER OR DESC')
     A            SHAD2F        16          COLHDG('SHIP' 'CITY')
     A            SHSTAF         2          COLHDG('SHIP' 'STATE')
     A            SHZIPF         5  0       COLHDG('SHIP' 'ZIP')
     A* TOTALS
     A            TOSTRF         3  0       COLHDG('TOTAL' 'STORES')
     A            TOPCSF         5  0       COLHDG('TOTAL' 'PIECES')
     A            TOWGTF         7  0       COLHDG('TOTAL' 'WGT')
     A* KMART ONLY
     A            BILCDF         3          COLHDG('BILL CODE')
     A*                                      KIH/KMA
     A            TYPCDF         1          COLHDG('BILL TYPE')
     A*                                      A=APPAREL I=IMPORT
     A*                                      V=VENDOR  X=OTHER
     A* KMART KMA ONLY
     A            JULDTF         3  0       COLHDG('JULIAN DATE')
     A**********************************************************************
     A*           RLDX      -                ROLLODEX FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 001000 00003
     A*         R RLDXFM
     A*
     A            ACRECR         1          COLHDG('ACTIVE' 'REC CODE')
     A            ACCT#R         5  0       COLHDG('ACCOUNT #')
     A            BILL1R         5  0       COLHDG('BILL TO # 1')
     A            BILL2R         5  0       COLHDG('BILL TO # 2')
     A            BILL3R         5  0       COLHDG('BILL TO # 3')
     A            BILL4R         5  0       COLHDG('BILL TO # 4')
     A            TEXT1R        75          COLHDG('TEXT1')
     A            TEXT2R        75          COLHDG('TEXT2')
     A            TEXT3R        75          COLHDG('TEXT3')
     A            TEXT4R        75          COLHDG('TEXT4')
     A**********************************************************************
     A*           ROUT      -                ROUTE FILE (DISPATCH)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001500 000050 00005
     A*         R ROUTFM
     A*
     A            ACREC4         1          COLHDG('ACTIVE' 'CODE')
     A            ROUTE4         7          COLHDG('ROUTE')
     A            TERM#4         4          COLHDG('TERMINAL')
     A            RDESC4        25          COLHDG('ROUTE' 'DESCR')
     A*
     A* ADJACENT ROUTES ARRAY OF 4 X 7 CHARACTERS
     A            ADJRT4        28          COLHDG('ADJACENT')
     A**********************************************************************
     A*           RTSC      -                TARGET RTS CARRIER MASTER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00003
     A*         R RTSCFM
     A*
     A            SCAC#RC        4          COLHDG('SCAC' 'CODE')
     A            NAMECRC       20          COLHDG('CARRIER' 'NAME')
     A**********************************************************************
     A*           RTSD      -                TARGET RTS CARRIER BY DC FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 000100 00003
     A*         R RTSDFM
     A*
     A            DESTCRD        4  0       COLHDG('DEST' 'CODE')
     A            ZIPCDRD        5  0       COLHDG('ZIP')
     A*
     A            SCAC1RD        4          COLHDG('PRIMARY' 'SCAC')
     A            SCAC2RD        4          COLHDG('SECONDARY' 'SCAC')
     A            SCAC3RD        4          COLHDG('TERTIARY' 'SCAC')
     A            LOCATRD       20          COLHDG('DC LOCATION')
     A            COMP#RD        3          COLHDG('COMPANY')
     A**********************************************************************
     A*           RTSN      -                TARGET RTS NOTES FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 020000 00005
     A*         R RTSNFM
     A*
     A            ACRECRN        1          COLHDG('ACTIVE' 'REC CODE')
     A            CONT#RN        7  0       COLHDG('CONTROL' 'NUMBER')
     A            SEQNORN        1  0       COLHDG('SEQ #')
     A            INOUTRN        1          COLHDG('INB/OUT' 'FLAG')
     A*                                         I = INBOUND
     A*                                         O = OUTBOUND
GP06 A            NOTESRN       80          COLHDG('NOTES')
     A**********************************************************************
     A*           RTSR      -                RESPONSE FROM CARRIERS
     A*                                      TO LOADS ASSIGNED TO THEM
     A*                                      VIA 204
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 020000 00005
     A*         R RTSRFM
     A*
     A            ACRECRR        1          COLHDG('ACTIVE' 'REC CODE')
     A            LOAD#RR        7  0       COLHDG('NRS LOAD #')
     A            SCAC#RR        4          COLHDG('SCAC' 'CODE')
     A            SCREFRR       15          COLHDG('SCAC' 'REF#')
     A            STAT1RR        1          COLHDG('ACC/REJ' 'FLAG')
     A*                                       A= ACCEPT
     A*                                       D=REJECT
     A            OTHERRR        1          COLHDG('REASSIGNED' 'FLAG')
     A*                                       R= REASSIGNED
     A*                                        = NOT REASSIGNED
     A            READTRR         L         COLHDG('REASSIGNED' 'DATE')
     A            LD#12RR       12          COLHDG('NEW' 'LOAD#')
     A*                                     ADD NART TO LOAD# FOR EDI
     A**********************************************************************
     A*           RTSV      -                TARGET RTS VENDOR FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 020000 00005
     A*         R RTSVFM
     A*
     A            ACRECRV        1          COLHDG('ACTIVE' 'REC CODE')
     A            LOCGRRV       12  0       COLHDG('TARGET' 'VENDOR')
     A*                                           VENDOR FAMILY ID
     A            VNAMERV       35          COLHDG('VENDOR' 'NAME')
     A            ADDR1RV       35          COLHDG('ADDRESS 1')
     A            CITYCRV       22          COLHDG('CITY')
     A            STATERV        2          COLHDG('STATE')
     A            ZIPCDRV        5  0       COLHDG('ZIP')
     A            CNAMERV       35          COLHDG('CONTACT' 'NAME')
     A            CONT#RV       10          COLHDG('CONTACT' 'TEL')
     A            CEXT#RV        5  0       COLHDG('TEL' 'EXT')
     A            CONF#RV       10          COLHDG('CONTACT' 'FAX')
     A            CEMAIRV       30          COLHDG('EMAIL' 'ADDR')
     A            NOTESRV       40          COLHDG('COMMENT')
     A            ZIPCNRV        6          COLHDG('CANADIAN' 'ZIP CODE')
     A**********************************************************************
     A*           SCAN      -                LNT SCANNED CARTONS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 00005
     A*         R SCANFM
     A*
     A            ACRECSC        1          COLHDG('ACTIVE' 'CODE')
     A            CARTNSC       20          COLHDG('CARTON LABEL')
     A            SCNAMSC        8          COLHDG('SCANNER' 'NAME')
     A            SCNIDSC       10          COLHDG('SCANNER ID')
     A            DATE#SC         L         COLHDG('SCAN DATE')
     A            TIME#SC         T         COLHDG('SCAN TIME')
     A            TRLIBSC       11          COLHDG('INBOUND' 'TRAILER')
     A**********************************************************************
     A*           STOR      -                DISTRIBUTION STORE MASTER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 002000 00004
     A*         R STORFM
     A*
     A            ACRECS         1          COLHDG('ACTIVE' 'CODE')
     A            CCODES         2          COLHDG('CUST' 'CODE')
     A            STORES         5          COLHDG('STORE #')
     A            DESTNS         4          COLHDG('DESTIN' 'TERMINAL')
     A            DTYPES         1          COLHDG('DC CODE')
     A*                                          = STORE
     A*                                        W = WAREHOUSE
     A*                                        T = TERMINAL
     A            RATE#S         4          COLHDG('RATE CODE-WEST')
     A            RATE1S         7  2       COLHDG('STORE RATE')
     A            RATE2S         7  2       COLHDG('STORE RATE 2')
     A            LIVULS         1          COLHDG('LIVE' 'UNLOAD')
     A*                                       Y  = YES
     A            DRVULS         1          COLHDG('DRIVER' 'UNLOAD')
     A*                                       Y  = YES
     A            LOCIDS         6          COLHDG('KEY TO' 'LOCT')
     A*                                       Y  = YES
     A            RAT2#S         4          COLHDG('RATE CODE-EAST')
     A            RAT3#S         4          COLHDG('RATE CODE-SOUTH')
     A**********************************************************************
     A*           TJAA      -                TJMAX ACCOUNT#            O NART
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00005
     A*         R TJAAFM
     A*
     A            TERM#AA        4          COLHDG('TERMINAL #')
     A            ACCT#AA        5  0       COLHDG('ACCOUNT #')
     A            TNAMEAA       25          COLHDG('TJX ACCOUNT NAME')
     A**********************************************************************
     A*           TJAX      -                TJMAX ACCOUNT# X-REF      O NART
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00005
     A*         R TJAXFM
     A*
     A            ACCODAX        2          COLHDG('TJX ACCOUNT CODE')
     A            TERM#AX        4          COLHDG('TERMINAL #')
     A            ACCT#AX        5  0       COLHDG('ACCOUNT #')
     A            PO#12AX        2          COLHDG('PO# POS-1&2')
     A            DC###AX        4          COLHDG('DC#')
     A**********************************************************************
     A*           TJLX      -                TJMAX LOCATION X-REF      O NART
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00005
     A*         R TJLXFM
     A*
     A            TERM#LX        4          COLHDG('TERMINAL #')
     A            LOCATLX        4          COLHDG('TJX LOCATION CODE')
     A            LCODELX        6          COLHDG('NRS LOCATION CODE')
     A**********************************************************************
     A*           TJTX      -                TJMAX TERMINAL X-REF      O NART
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00005
     A*         R TJTXFM
     A*
     A            TRPT#TX       15          COLHDG('TRADING' ' PARTNER ID')
     A            POENTTX       30          COLHDG('PORT OF ENTRY')
     A            TERM#TX        4          COLHDG('TERMINAL')
     A            PCODETX        5          COLHDG('PORT OF ENTRY CODE')
     A**********************************************************************
     A*           TLAD      -                TARGET TRUCKLOAD ADVANCE TO NART
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00005
     A*         R TLADFM
     A*
     A            STATEAD        2          COLHDG('STATE')
     A            SCAC#AD        4          COLHDG('SCAC' 'CODE')
     A            ZIPLOAD        5  0       COLHDG('LOW' 'ZIP')
     A            ZIPHIAD        5  0       COLHDG('HIGH' 'ZIP')
     A* NOTE: IF LOW AND HIGH ZIP ARE ZERO THE RATES APPLY TO THE
     A*       ENTIRE STATE
     A            RPM##AD        5  2       COLHDG('MILES' 'RATE')
     A            MINRTAD        7  2       COLHDG('MINIMUM' 'RATE')
     A**********************************************************************
     A*           TRPD      -                MARMAXX LAS VEGAS TRIP DETAIL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00010
     A*         R TRPDFM
     A*
     A            ACRECT2        1          COLHDG('ACTIVE' 'CODE')
     A            CONT#T2        5  0       COLHDG('CONTROL' 'NUMBER')
     A            SUFFXT2        1          COLHDG('CONTROL' 'SUFFIX')
     A            SEQNOT2        1S 0       COLHDG('SEQ#')
     A            VNAMET2       35          COLHDG('VENDOR NAME')
     A            ZIPCDT2        5  0       COLHDG('ZIP' 'CODE')
     A            QCTNST2        7  0       COLHDG('CARTONS')
     A            WEIGHT2        7  0       COLHDG('WEIGHT')
     A            CONSLT2        1          COLHDG('CONSOLIDATION')
     A*                                       Y=YES
     A            DLOADT2        1          COLHDG('DRIVER' 'LOAD')
     A*                                       Y=YES
     A            STFEET2        1          COLHDG('STOP' 'FEE')
     A*                                       Y=YES
     A*
     A**********************************************************************
     A*           TRPH      -                MARMAXX LAS VEGAS TRIP HEADER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00010
     A*         R TRPHFM
     A*
     A            ACRECT1        1          COLHDG('ACTIVE' 'CODE')
     A            CONT#T1        5  0       COLHDG('CONTROL' 'NUMBER')
     A            SUFFXT1        1          COLHDG('CONTROL' 'SUFFIX')
     A            TRIDTT1         L         COLHDG('TRIP DATE')
     A            TRAL#T1        8          COLHDG('TRAILER' 'NUMBER')
     A            RUN##T1        4          COLHDG('RUN' 'NUMBER')
     A*   REGULAR RUN INFO
     A            PRO##T1        7  0       COLHDG('PRO#')
     A            BLNORT1       17          COLHDG('BOL' 'REGULAR RUN')
     A            DRV#RT1        6          COLHDG('DRIVER' 'REGULAR RUN')
     A*   BACKHAUL RUN INFO
     A            TRLBHT1        8          COLHDG('TRAILER#' 'BACKHAUL')
     A            MAN#BT1        7  0       COLHDG('MANIFEST#' 'BACKHAUL')
     A*****       DRV#RT1        7  0       COLHDG('DRIVER' 'BACKHAUL')
     A            BHPROT1        7  0       COLHDG('BACKHAUL' 'PRO #')
     A            COMM1T1       30          COLHDG('COMMENTS 1')
     A            MILEST1        5  0       COLHDG('ACUTAL' 'MILES')
     A            MILORT1        5  0       COLHDG('OFF ROUTE' 'MILES')
     A            RUN$$T1        7  2       COLHDG('RUN $')
     A            FUEL$T1        5  2       COLHDG('FUEL' 'SURCHARGE')
     A            ORMI$T1        6  2       COLHDG('OFF ROUTE' 'MILEAGE $')
     A            QTY##T1        5  0       COLHDG('QUANTITY')
     A            WEIGHT1        5  0       COLHDG('WEIGHT')
     A**********************************************************************
     A*           VENP      -                VENDOR PASSWORDS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000100 00004
     A*         R VENPFM
     A*
     A            PASSW8P       10          COLHDG('PASSWORD')
     A**********************************************************************
     A*           VLDX      -                VENDOR LOAD FILE (RTS)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0025000 000500 00004
     A*         R VLDXFM
     A*
     A            STOP#X         5  0       COLHDG('STOP' 'NUMBER')
     A            LOAD#X         7  0       COLHDG('NRS' 'LOAD#')
     A**********************************************************************
     A*           VTLR      -                TARGET VENDOR TRUCKLOAD ROUTING
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000100 00005
     A*         R VTLRFM
     A*
     A            DESTCR1        4  0       COLHDG('DC')
     A            STATER1        2          COLHDG('STATE')
     A            SCAC#R1        4          COLHDG('SCAC' 'CODE')
     A            RPM##R1        5  2       COLHDG('MILES' 'RATE')
     A            MINRTR1        7  2       COLHDG('MINIMUM' 'RATE')
     A**********************************************************************
     A*           ZCNT      -                COUNTY FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 002500 00005
     A*         R ZCNTFM
     A            CTYCDCT        5          COLHDG('COUNTY' 'CODE')
     A            STATECT        2          COLHDG('STATE')
     A            CNAMECT       25          COLHDG('COUNTY' 'NAME')
     A**********************************************************************
     A*           ZIPS      -                ZIP CODE FILE (DISPATCH)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 002500 00005
     A*         R ZIPSFM
     A            ZIPCD5         5  0       COLHDG('ZIP CODE')
     A            TERM#5         4          COLHDG('TERMINAL')
     A            ROUTE5         7          COLHDG('ROUTE')
     A            CITYN5        16          COLHDG('CITY')
     A            STATE5         2          COLHDG('STATE')
     A**********************************************************************
     A*           EWFD    -    U       WORK FILE FOR AF-AD SEGMENT BEING CREATED
     A*                                 FOR FEDERATED EDI 214
     A*   ?????? (NOTE: TOQTY MAY
     A*   ??????   BE TOTAL FOR
     A*   ??????   CTN AND GOH)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EWFDFM
     A*
     A            CONS#U         5  0       COLHDG('CONSIGNEE #')
     A            ATYPEU         1          COLHDG('ACCOUNT TYPE')
     A*                                     VALUE('L'= LTL ACCOUNT)
     A            MOVE#U         7  0       COLHDG('MOVE' 'NUMBER')
     A*                                           (MANIFEST NUMBER)
     A            PRO##U         7  0       COLHDG('PRO' 'NUMBER')
     A            BLNUMU        17          COLHDG('SHIPPER B/L')
     A            SHIPNU        25          COLHDG('SHIPPER NAME')
     A            SHAD2U        16          COLHDG('SHIPPER CITY')
     A            SHZIPU         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHSTAU         2          COLHDG('SHIPPER' 'STATE')
     A*
     A            CTNGHU         3          COLHDG('CTN OR' 'GOH')
GP01 A**          TOQTYU         5  0       COLHDG('TOTAL' 'RECD')
GP01 A**          TOWGTU         5  0       COLHDG('TOTAL' 'WGT')
GP01 A            TOQTYU         7  0       COLHDG('TOTAL' 'RECD')
GP01 A            TOWGTU         7  0       COLHDG('TOTAL' 'WGT')
     A            PAYCOU         2          COLHDG('PRE-PAID OR COLLECT')
     A*                                               CC = COLLECT
     A*                                               PP = PREPAID
     A            TDATEU         6  0       COLHDG('PRO DATE' )
     A*                                     YYMMDD  -- PICKUP DATE
     A            EDISTU         2          COLHDG('STATUS CODE')
     A            STATFU         2          COLHDG('FOR AF  CODE')
     A            STATGU         2          COLHDG('FOR AD CODE')
     A            TOTALU         9  2       COLHDG('TOTAL' 'AMOUNT')
     A            TDATGU         6  0       COLHDG('DELIVERY DATE')
     A*                                     YYMMDD - OUTBOUND MOVE DATE
     A            TYPAPU         2          COLHDG('TYPE OF APP.')
     A*                                     SS = SINGLE SHIPPMENT
     A*                                     TM = TRAILER MANIFEST
GP01 A****        TRAILU         6          COLHDG('TRAILER #')
GP01 A            TRAILU         7          COLHDG('TRAILER #')
     A            OSCACU         4          COLHDG('OUTBOUND SCAC')
     A*                                           (NART FOR NOW)
     A            AKEYU          6          COLHDG('CONS# + TYPE')
     A*                                     VALUE('L'TYPE= LTL ACCOUNT)
     A            CDATEU         6  0       COLHDG('VENDOR' 'CALL DATE')
     A*                                     YYMMDD  -- CALLED VENDOR
     A            STATCU         2          COLHDG('FOR RA' 'CODE')
     A*                                       FOR THE CDATEU IF HAVE
     A**********************************************************************
     A*           EPFD    -    V       PO FILE FOR 214 FORMAT DETAIL
     A*                                FOR FEDERATED EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EPFDFM
     A*
     A            PRO##V         7  0       COLHDG('PRO #')
GP01 A***         PONUMV        15          COLHDG('PO #')
GP01 A            PONUMV        17          COLHDG('PO #')
GP01 A**          QUANTV         5  0       COLHDG('QUANTITY')
     A            QUANTV         7  0       COLHDG('QUANTITY')
     A            DEPT#V         4          COLHDG('DEPT #')
     A**********************************************************************
     A*           EFLM    -    N       WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*                                (MANF/MOVE LEVEL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFLMFM
     A*
     A            MOV#EN         7  0       COLHDG('MOVE' 'NUMBER')
     A*                                           (MANIFEST NUMBER)
     A            CONSEN         5  0       COLHDG('CONSIGNEE #')
     A*
     A            OSCACN         4          COLHDG('OUTBOUND SCAC')
     A*                                           (NART FOR NOW)
     A            MANCEN         2S 0       COLHDG('MANIFEST' 'CENT')
     A*                                           E.G. YEAR 1998 --
     A*                                                MANCEM=19
     A            MANYEN         2S 0       COLHDG('MANIFEST' 'YEAR')
     A            MANMEN         2S 0       COLHDG('MANIFEST' 'MONTH')
     A            MANDEN         2S 0       COLHDG('MANIFEST' 'DAY')
     A*
     A            TRTYEN         2          COLHDG('TRANS.' 'TYPE')
     A**                                     VALUES('00 -- ORIGINAL EDI'
     A            SNAMEN        35          COLHDG('CONTACT' 'NAME')
     A            STELEN        20          COLHDG('TEL.NUMBER')
     A*
     A*********   TDATGU         6  0       COLHDG('DELIVERY DATE')
     A            DELCEN         2S 0       COLHDG('DELIVERY' 'CENT')
     A            DELYEN         2S 0       COLHDG('DELIVERY' 'YEAR')
     A            DELMEN         2S 0       COLHDG('DELIVERY' 'MONTH')
     A            DELDEN         2S 0       COLHDG('DELIVERY' 'DAY')
     A            DELTEN         4  0       COLHDG('DELIVERY' 'TIME')
     A            DELTQN         2          COLHDG('DEL TIME' 'QUAL')
     A*                                     VALUES(LT=LOCAL TIME)
     A            TRAILN         6          COLHDG('TRAILER #')
     A            SEA1EN         8          COLHDG('SEAL #1')
     A            SEA2EN         8          COLHDG('SEAL #2')
     A*
     A            AKEYEN         6          COLHDG('CONS# + TYPE')
     A*                                     VALUE('L'TYPE= LTL ACCOUNT)
     A**********************************************************************
     A*           EFLR    -    U       WORK FILE FOR FEDERATED EDI 212 G CREATED
     A*                                (PROS LEVEL)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFLRFM
     A*
     A            MOV#EU         7  0       COLHDG('MOVE' 'NUMBER')
     A*                                           (MANIFEST NUMBER)
     A            PRO#EU         7  0       COLHDG('PRO' 'NUMBER')
     A*
     A            CONSEU         5  0       COLHDG('CONSIGNEE #')
     A*
     A            BLNUEU        10          COLHDG('SHIPPER B/L')
     A            PUSCEU         4          COLHDG('P/U SCAC' 'CODE')
     A            SHPNEU        25          COLHDG('SHIPPER NAME')
     A            SHADEU        16          COLHDG('SHIPPER CITY')
     A            SHZPEU         5  0       COLHDG('SHIPPER' 'ZIP')
     A            SHSTEU         2          COLHDG('SHIPPER' 'STATE')
     A*
     A*****       DEPTEU         4          COLHDG('DEPT #')
     A            CTNGEU         3          COLHDG('CTN OR' 'GOH')
     A            TOQTEU         5  0       COLHDG('TOTAL' 'RECD')
     A            TOWTEU         5  0       COLHDG('TOTAL' 'WGT')
     A            PAYCEU         2          COLHDG('PRE-PAID OR COLLECT')
     A*                                               CC = COLLECT
     A*                                               PP = PREPAID
     A**          TDATEU         6  0       COLHDG('PRO DATE' )
     A*                                     YYMMDD  -- PICKUP DATE
     A            PICCEU         2S 0       COLHDG('PICK-UP' 'DATE')
     A            PICYEU         2S 0       COLHDG('PICK-UP' 'DATE')
     A            PICMEU         2S 0       COLHDG('PICK-UP' 'DATE')
     A            PICDEU         2S 0       COLHDG('PICK-UP' 'DATE')
     A*
     A            TOTLEU         9  2       COLHDG('TOTAL' 'AMOUNT')
     A            LDSQEU         3  0       COLHDG('LOAD' 'SEQ')
     A**                                         FROM NOSE TO TAIL
     A**                                         VALUES=001,002...
     A**********************************************************************
     A*           EFLP    -    V       PO FILE FOR 212 FORMAT DETAIL
     A*                                FOR FEDERATED EDI
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R EFLPFM
     A*
     A            MOV#EV         7  0       COLHDG('MOVE' 'NUMBER')
     A*                                           (MANIFEST NUMBER)
     A            PRO#EV         7  0       COLHDG('PRO #')
     A            CONSEV         5  0       COLHDG('CONSIGNEE #')
     A            LDSQEV         3  0       COLHDG('LOAD' 'SEQ')
     A            PONUEV        15          COLHDG('PO #')
     A            QUANEV         5  0       COLHDG('QUANTITY')
     A            DEPTEV         4          COLHDG('DEPT #')
     A**********************************************************************
     A*           ETHD    -    TH      HDR FILE FOR 204 FORMAT DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                FIELDS TRUCK LOADS GIVEN
     A*                                TO OTHER CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETHDFM
     A*
     A            LOAD#TH        7  0       COLHDG('SHIPMENT' 'NUMBER')
     A*
     A            EDI##TH        5          COLHDG('EDI' 'PARTNER ID')
     A*                                         WENP/DART/HBGI/HJBT
     A*                                         SCNN/SWFT
     A            SCAC#TH        4          COLHDG('CARRIER' 'SCAC')
     A            FRTERTH        2          COLHDG('FRGT' 'TERM')
      *                                       CC = COLLECT
      *                                       PP = PREPAID
     A            EDISTTH        2          COLHDG('EDI' 'STATUS')
     A*                                       00 = ORIGINAL
     A*                                       01 = CANCELLATION
     A*                                       18 = REISSUE
     A            EQIDDTH       10          COLHDG('EQUIPMENT' 'DESC/#')
     A            EQDESTH        2          COLHDG('EQUIPMENT' 'DESC CODE')
     A*                                       TF= TRAILER, DRY FRT
     A*                                       RC = REFRIGERATED CAR
     A*                                       HB = WITH HANGERS
     A*                                       FB = FLAT BED WITH HEAD
     A*                                             BOARDS
     A            EQLENTH        5          COLHDG('EQUIPMENT' 'LENGTH')
     A            QUAN#TH        7  0       COLHDG('TOTAL' 'QTY')
     A            WGT##TH        7  0       COLHDG('TOTAL' 'WEIGHT')
     A            DESTCTH        4  0       COLHDG('DEST' 'CODE')
     A*                                        FOR SHIP - TO
     A*                                        DC=1 WILL BE US
     A*                                        FINAL DEST TARGET DC
     A*                                        WILL BE IN FDESTTH
     A            FDESTTH        4  0       COLHDG('FINAL' 'DEST')
     A*                                        TARGET DC
     A            LD#12TH       12          COLHDG('NTE LOAD#')
     A*                                      ADD NART TO LOAD# FOR EDI
     A**********************************************************************
     A*           ETIN    -    TN      INSTRUCTIONS 204 FORMAT DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                FIELDS TRUCK LOADS GIVEN
     A*                                TO OTHER CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETINFM
     A*
     A            LOAD#TN        7  0       COLHDG('SHIPMENT' 'NUMBER')
     A*
     A            EDI##TN        5          COLHDG('EDI' 'PARTNER ID')
     A*                                         WENP/DART/HBGI/HJBT
     A*                                         SCNN/SWFT
     A            INSSQTN        3  0       COLHDG('INSTRUCTION' 'SEQ')
     A            INSTRTN       30          COLHDG('INSTRUCTIONS')
     A**********************************************************************
     A*           ETDT    -    TD      DET FILE FOR 204 FORMAT DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                FIELDS TRUCK LOADS GIVEN
     A*                                TO OTHER CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETDTFM
     A*
     A            LOAD#TD        7  0       COLHDG('SHIPMENT' 'NUMBER')
     A*
     A            EDI##TD        5          COLHDG('EDI' 'PARTNER ID')
     A*                                         WENP/DART/HBGI/HJBT
     A*                                         SCNN/SWFT
     A            LDSQ#TD        3  0       COLHDG('LOAD' 'SEQ')
     A*                                       STOP#
     A            LDTYPTD        2          COLHDG('LOAD' 'TYPE')
     A*                                       SH= SHIPPER
     A*                                       ST= SHIP TO
     A            STOPRTD        2          COLHDG('STOP' 'REASON')
     A*                                       PL= PART LOAD
     A*                                       CL= COMPLETE LOAD
     A*                                       PU= PART UNLOAD
     A*                                       CU= COMPLETE UNLOAD
     A            QUAN#TD        7  0       COLHDG('TOTAL' 'QTY')
     A*                                       FOR THE STOP
     A            QTYUNTD        2          COLHDG('QTY' 'UNIT')
     A*                                       CT = CARTON
     A*                                       PC = PIECE
     A*                                       PL = PALLET/
     A            WGT##TD        7  0       COLHDG('TOTAL' 'WEIGHT')
     A*                                       FOR THE STOP
     A            WGTUNTD        1          COLHDG('WEIGHT' 'UNIT')
     A*                                       K = KILOGRAMS
     A*                                       L = POUNDS
     A            VOL##TD        7  0       COLHDG('TOTAL' 'VOLUME')
     A*                                       FOR THE STOP
     A            VOLUNTD        1          COLHDG('VOLUME' 'UNIT')
     A*                                        E = CUBIC FEET
     A*                                        X = CUBIC METERS
     A            EARDYTD        2  0       COLHDG('EARLY' 'YEAR')
     A*                                         CC  (CCYYMMDD)
     A            EARDTTD        6  0       COLHDG('EARLY' 'DATE')
     A*                                         YYMMDD
     A            EARTMTD        4  0       COLHDG('EARLY' 'TIME')
     A            BLNUMTD       20          COLHDG('SHIPMENT' 'ID')
     A*                                       MAY BE B/L# OR SHIPPER
     A*                                       PROVIDED SHIPMENT ID
     A            SNAMETD       35          COLHDG('VEN/CONS' 'NAME')
     A            ADDR1TD       35          COLHDG('ADDRESS 1')
     A            CITYCTD       30          COLHDG('CITY')
     A            STATETD        2          COLHDG('STATE')
     A            ZIPCDTD        5  0       COLHDG('ZIP')
     A*  WILL USE ALPHA FLD AT THE BOTTOM
     A            NAMECTD       60          COLHDG('CONTACT' 'NAME')
     A            CONQTTD        2          COLHDG('CONTACT' 'QUAL')
     A*                                           TE=TEL#
     A            CONT#TD       10          COLHDG('CONTACT' 'NUMBER')
     A            CONQFTD        2          COLHDG('CONTACT' 'QUAL')
     A*                                           FX=FAX#
     A            CONF#TD       10          COLHDG('CONTACT' 'NUMBER')
     A
     A            EARDQTD        2          COLHDG('EDATE' 'QUALIFER')
     A*                                       EARLY DATE QUALIFIER
     A*                                           = WHEN WE DO SHIP-TO
     A*                                       10 = FOR PICK UPS
     A            EARTQTD        1          COLHDG('ETIME' 'QUALIFER')
     A*                                       EARLY TIME QUALIFIER
     A*                                           = WHEN WE DO SHIP-TO
     A*                                       Y  = FOR PICK UPS
     A            ZIPCATD       11          COLHDG('ZIP' 'ALPHA')
     A            DESTCTD        4  0       COLHDG('DEST' 'CODE')
     A            STPDSTD        3  0       COLHDG('DEST.' 'STOP#')
     A*                                       STOP#
     A*                                        1 IS 1ST DEST. STOP
     A            STPPUTD        3  0       COLHDG('P/U' 'STOP#')
     A*                                       P/U  STOP#
     A**********************************************************************
     A*           ETPO    -    TP      PO FILE FOR 204 FORMAT DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                FIELDS TRUCK LOADS GIVEN
     A*                                TO OTHER CARRIERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 001000 00010
     A*         R ETPOFM
     A*
     A            LOAD#TP        7  0       COLHDG('SHIPMENT' 'NUMBER')
     A*
     A            EDI##TP        5          COLHDG('EDI' 'PARTNER ID')
     A*                                         WENP/DART/HBGI/HJBT
     A*                                         SCNN/SWFT
     A            LDSQ#TP        3  0       COLHDG('LOAD' 'SEQ')
     A            LDTYPTP        2          COLHDG('LOAD' 'TYPE')
     A*                                       SH= SHIPPER
     A*                                       ST= SHIP TO
     A            PONU#TP        8  0       COLHDG('PO #')
     A            DEPT#TP        4  0       COLHDG('DEPT #')
     A            QUAN#TP        7  0       COLHDG('QUANTITY')
     A            QTYUNTP        2          COLHDG('QTY' 'UNIT')
     A            WGT##TP        7  0       COLHDG('WEIGHT')
     A            WGTUNTP        1          COLHDG('WGT' 'UNIT')
     A*                                           K = KILOGRAMS
     A*                                           L = POUNDS
     A            FDESTTP        4  0       COLHDG('FINAL' 'DEST')
     A*                                        TARGET DC
     A            STPDSTP        3  0       COLHDG('DEST.' 'STOP#')
     A*                                       DEST. STOP#
     A*                                        1 IS 1ST DEST. STOP
     A            VOL##TP        5  0       COLHDG('VOLUME')
     A            DESTCTP        4  0       COLHDG('DEST' 'CODE')
     A*                                        THIS COULD BE SAME AS
     A*                                        FDESTTP
     A*                                        BUT MAY BE DIFF IF WE
     A*                                        BRING THIS PO HERE
     A*                                        (TO NART) FIRST
     A**********************************************************************
     A*           T53H    -    3H      EDI RTS 753 HEADER
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                (RECEIVED IN EDI FROM THEM)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T53HFM
     A*
     A            MAIL#3H       10          COLHDG('EDI MAILBOX' 'ID')
     A            INTID3H       10          COLHDG('EDI SENDER' 'ID')
     A            EDIC#3H        9          COLHDG('EDI CONTROL' '#' )
     A            DISP#3H       15          COLHDG('DISPATCH #')
     A            DT7533H        8  0       COLHDG('753' 'DATE')
     A            TM7533H        4  0       COLHDG('753' 'TIME')
     A            FRTER3H        2          COLHDG('FRGT' 'TERM')
      *                                       CN = COLLECT
      *                                       PP = PREPAID
     A            CNAME3H       35          COLHDG('CONTACT' 'NAME')
     A            CTEL#3H       20          COLHDG('CONTACT' 'TEL')
     A            VNAME3H       35          COLHDG('VENDOR' 'NAME')
     A            VENDC3H        7  0       COLHDG('VENDOR' 'CODE')
     A            STAT13H        1          COLHDG('MOVED' 'STATUS')
     A*                                      ' ' NOT MOVED TO RTSF
     A*                                      'M' MOVED TO RTSF
     A*                                      'X' PROBLEM RECORD
     A*                                          NOT WRITTEN TO RTSF
     A*                                      (UPDATED BY PGM ETM753)
GP01 A            PSCAC3H       10          COLHDG('P/U' 'SCAC')
     A*
GP07  ** FOLLOWING FLDS ADDED FOR NEW INCOMING 204 (SAME 753 FILES ARE
      ** TO BE USED WITH EXTRA FLDS TO WORK ON INCOMIGN 204 TATH REPLACES 753
     A* B2A
     A            CODEP3H        2          COLHDG('EDI' 'CODE')
     A*                                       00 - ORIGINAL
     A*                                       01- CANCEL
     A*                                       04 - UPDATE OF PO
     A            APPTY3H        2          COLHDG('APPL' 'TYPE')
     A*                                       LS = THIRD PARTY
     A* G62 MUST REPSOND BY
     A            RESDF3H        2          COLHDG('RESPOND' 'DT QUAL')
     A            RESDT3H        8  0       COLHDG('RESPOND' 'BY DT')
     A            RESTF3H        2          COLHDG('RESPOND' 'TM QUAL')
     A            RESTM3H        8  0       COLHDG('RESPOND' 'NY TM')
     A            RESTC3H        2          COLHDG('RESPOND' 'TIME CD')
     A* B2                                    CT = CENTRAL TIME
     A            SC7533H        4          COLHDG('753 RECD' 'BY SCAC')
     A* MS3                                   SCAC RECEIVING THIS 753
     A            TRTYP3H        2          COLHDG('TRANSP' 'TYPE')
     A*                                       C = THIRD PARTY ADV LOAD
     A*                                             TO CONSOLIDATOR
     A*                                       K = BAKCHAUL
     A*                                       LT = LTL
     A*                                       M = MOTOR (COMMON CARRIER)
     A*                                       ' ' = TRAILER LOAD
     A*
     A* AT5
     A            SPECH3H        3          COLHDG('SPECIAL' 'HANDLING')
     A*                                       SPECIAL HANDLING CODE
     A*                                        HAZ  HAZARDOUS CARGO
     A*                                        OTC  TEMP CONTROL
     A            MEASC3H        2          COLHDG('MEASUREMENT' 'CODE')
     A*                                       FA  FAHRENHEIT
     A            MINTM3H        4          COLHDG('MIN' 'TEMP')
     A            MAXTM3H        4          COLHDG('MAX' 'TEMP')
     A* HEADER PLD
     A            PLTSH3H        3  0       COLHDG('PALLETS' 'SHIPPED')
     A* N7
     A            EQDES3H       15          COLHDG('EQUIPMENT' 'DESC')
     A*                                      CAN BE EQUIPMENT NUMBER
     A            EQDCD3H        2          COLHDG('EQUIP' 'DESC CODE')
     A*                                        FF   - FROZEN FOOD TRILER
     A*                                        RT   - CONTROLLED TEMP TRL
     A*                                        TF   - TRL DRY FREIGHT
     A*                                        TW   - TRL REFRIGERATED
     A            EQLEN3H        5          COLHDG('EQUIPMENT' 'LEN ')
     A*                                        4800 - 48 FT
     A*                                        5300 - 53 FT
     A*  L3
     A            TOWGT3H       12  2       COLHDG('WEIGHT')
     A            WGTQL3H        2          COLHDG('WGT' 'QUAL')
     A            AMTCH3H       15  2       COLHDG('AMT' 'CHARGED')
     A            TOVOL3H       10  2       COLHDG('VOLUME')
     A            VOLQF3H        1          COLHDG('VOL' 'QUAL')
     A            PRO##3H       20          COLHDG('PRO#')
     A*                                      ONLY GIVEN  FOR THIRD PARTY ADV
     A*                                       TO CONSOLIDATOR
GPNEWA            EDIFLGH        1          COLHDG('EDID TO' 'RATELINX')
     A**********************************************************************
     A*           T53N    -    3N      EDI RTS 204 HEADER NOTES
     A*                                (RECEIVED IN EDI 204 FROM THEM)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T53NFM
     A*
     A            MAIL#3N       10          COLHDG('EDI MAILBOX' 'ID')
     A            DISP#3N       15          COLHDG('DISPATCH #')
     A            NTEQL3N        3          COLHDG('NOTES' 'QUAL')
     A*                                        OTH -- OTHER INSTRUCTIONS
     A*                                        SPH -- SPECIAL HANDLING
     A            NTEDS3N       60          COLHDG('NOTES' 'DESC')
     A**********************************************************************
     A*           T53D    -    3D      EDI RTS 753 DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                (RECEIVED IN EDI FROM THEM)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T53DFM
     A*
     A            MAIL#3D       10          COLHDG('EDI MAILBOX' 'ID')
     A            DISP#3D       15          COLHDG('DISPATCH #')
     A            SFSTC3D        2          COLHDG('SHIP' 'FROM/TO')
     A*                                       SF = SHIP FROM
     A*                                       ST = SHIP TO
     A            UVNLC3D       12  0       COLHDG('FAMILY' '/DC')
     A*                                       WHEN SFSTC3D = 'SF'
     A*                                      VENDOR FAMILY CODE (UNIQUE
     A*                                       WHEN SFSTC3D = 'ST'
     A*                                      THIS IS DC
     A            ADDR13D       35          COLHDG('ADDRESS 1')
     A            CITYC3D       30          COLHDG('CITY')
     A            STATE3D        2          COLHDG('STATE')
     A            ZIPCD3D       15          COLHDG('ZIP')
     A            EDTQF3D        2          COLHDG('DATE' 'QUALIF')
     A*                                       EP = EARDT3D IS EARLY DAT
     A*                                       RS = EARDT3D IS SHIP DATE
     A            EARDT3D        8  0       COLHDG('EARLY/SHIP' 'DATE')
     A            ETMQF3D        2          COLHDG('TIME' 'QUALIF')
     A*                                       EP = EARDT3D IS EARLY TIM
     A*                                       RS = EARDT3D IS SHIP TIME
     A            EARTM3D        4  0       COLHDG('EARLY' 'TIME')
     A            LDTQF3D        2          COLHDG('DATE' 'QUALIF')
     A*                                       LP = LATDT3D IS LATE  DAT
     A*                                       01 = LATDT3D IS CANCEL DATE
     A            LATDT3D        8  0       COLHDG('LATE/CANCEL' 'DATE')
     A            LTMQF3D        2          COLHDG('TIME' 'QUALIF')
     A*                                       LP = LATDT3D IS LATE TIME
     A            LATTM3D        4  0       COLHDG('LATE' 'TIME')
     A**          SHPDT3D        8  0       COLHDG('SHIP' 'DATE')
     A**          CNLDT3D        8  0       COLHDG('CANCEL' 'DATE')
     A**          DESTC3D        4  0       COLHDG('DEST' 'CODE')
     A            BLNUM3D       20          COLHDG('B/L NUMBER')
     A            DEPTC3D        4  0       COLHDG('DEPARTMENT')
     A            VNOTE3D       80          COLHDG('VEND' 'NOTES')
     A            PALLT3D       15  0       COLHDG('PALLETS')
     A            STACK3D        1          COLHDG('STACKABLE')
     A*                                      ' '
     A*                                      N
     A*                                      Y
GP01 A            VNAME3D       35          COLHDG('VENDOR' 'NAME')
GP01 A            VENDC3D       12          COLHDG('VENDOR' 'CODE')
GP01 A            EQTYP3D       20          COLHDG('EQ. TYPE')
GP01 A            PRO##3D       20          COLHDG('PRO#')
GP01 A*                                        NOT OURS
GP01 A            SEQ##3D        4  0       COLHDG('SEQ#')
      * FOLLOWING FLDS MAPPED FROM FLAT FILE T53E OR T53W 09/19/10
GP05 A            CNAME3D       35          COLHDG('CONTACT' 'NAME')
GP05 A            CTEL#3D       25          COLHDG('CONTACT' 'TEL')
     A*
GP07  ** FOLLOWING FLDS ADDED FOR NEW INCOMING 204 (SAME 753 FILES ARE
      ** TO BE USED WITH EXTRA FLDS TO WORK ON INCOMIGN 204 TATH REPLACES 753
     A* S5
     A            STPRS3D        2          COLHDG('STOP' 'REASON')
     A*                                       CL  COMPLETE LOAD
     A*                                       CU
     A*                                       PL
     A*                                       PU
     A            STWGT3D       12  2       COLHDG('STOP' 'WGT')
     A            STWGU3D        1          COLHDG('WGT' 'UNIT')
     A*                                        L - POUNDS
     A            STQTY3D       12  2       COLHDG('STOP' 'QTY')
     A            STQTU3D        2          COLHDG('QTY' 'UNIT')
     A*                                          CTN
     A            STVOL3D       10  2       COLHDG('STOP' 'VOL')
     A            STVOU3D        1          COLHDG('VOL' 'UNIT')
     A*                                        E  - CUBIC FEET
     A            APPT#3D       30          COLHDG('APPT' 'NUMBER')
     A            IDQUL3D        2          COLHDG('N103' 'ID QUAL')
     A            ADDR23D       35          COLHDG('ADDRESS 2')
     A            CNTRY3D        3          COLHDG('COUNTRY')
     A            COMCD3D        2          COLHDG('COMM' 'CODE')
     A*                                       SH - SHIPPER CONTACT
     A            COMMQ3D        2          COLHDG('COMM' 'QUAL')
     A*                                        EM - EMAIL
     A*                                        TE - TEL
     A*                                        FX - FAX
     A            COMMD3D       50          COLHDG('COMM' 'DESC')
     A**********************************************************************
     A*           T53P    -    3P      EDI RTS 753 PO DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                (RECEIVED IN EDI FROM THEM)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T53PFM
     A*
     A            MAIL#3P       10          COLHDG('EDI MAILBOX' 'ID')
     A            DISP#3P       15          COLHDG('DISPATCH #')
     A            PONUM3P       17          COLHDG('PO')
     A*                                      DDDDPPPPPPPPLLLL
     A*                                        D = DEPT#
     A*                                        P = PO#
     A*                                        L= DC#
     A            COPO#3P       12          COLHDG('COMBO PO#')
     A            PACKC3P        3          COLHDG('CTN' 'CODE')
     A*                                        CTN
     A            QCTNS3P       15  0       COLHDG('CARTONS')
     A            WGTCD3P        1          COLHDG('WGT' 'CODE')
     A*                                        L
     A            WEIGH3P       15  0       COLHDG('WEIGHT')
     A            VOLCD3P        1          COLHDG('VOL' 'CODE')
     A*                                        E/F
     A            CUBES3P       15  0       COLHDG('CUBE')
     A            FOURW3P        1  0       COLHDG('FOUR' 'WALLS')
     A*                                         0 - DEFAULT
     A*                                         1
     A            REL##3P       12          COLHDG('RELEASE' 'ID')
     A            SFSTC3P        2          COLHDG('SHIP' 'FROM/TO')
     A*                                       SF = SHIP FROM
     A*                                       ST = SHIP TO
GP01 A            SEQ##3P        4  0       COLHDG('SEQ#')
GP05 A            VNOTE3P       80          COLHDG('VEND' 'NOTES')
GP05 A            BLNUM3P       20          COLHDG('B/L NUMBER')
GP05 A            PALLT3P       15  0       COLHDG('PALLETS')
     A*
GP07  ** FOLLOWING FLDS ADDED FOR NEW INCOMING 204 (SAME 753 FILES ARE
      ** TO BE USED WITH EXTRA FLDS TO WORK ON INCOMIGN 204 TATH REPLACES 753
     A* OID11
     A            PONTE3P       50          COLHDG('PO' 'NOTES')
     A**********************************************************************
     A*           T54H    -    4H      EDI RTS 754 HEADER
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                (EDI DOC. SENT TO THEM    )
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T54HFM
     A*
     A            EDIID4H        6          COLHDG('EDI' 'ID')
     A*                                       RTS754
     A            DISP#4H       15          COLHDG('DISPATCH #')
     A            OURRF4H       12          COLHDG('OUR REF#')
     A*                                      NRS LOAD# - FOR LOADS
     A*                                       GIVEN TO OTHER CARRIERS
     A*                                      OUR P/U# (IN REF# FLD
     A*                                       OF RTSF -- FOR LOADS
     A*                                       WE DO
     A            DT7544H        8  0       COLHDG('754' 'DATE')
     A            TM7544H        4  0       COLHDG('754' 'TIME')
     A            TOTST4H        2  0       COLHDG('TOTAL' '# STOPS')
     A*                                       TOTAL STOPS FOR THIS
     A*                                       DISPATCH#
     A*                                       (ALL 754 WITH THIS
     A*                                        DISPATCH# WILL HAVE THIS
     A*                                        SAME TOTAL)
     A*                                       WHICH STOP IS THIS 754
     A*                                       FOR IS IN MSI SEGMENT
     A*                                       OF THE 754
     A            LOCGR4H       12  0       COLHDG('LOCAT' 'GROUP')
     A            LOAD#4H        7  0       COLHDG('NRS LOAD #')
GP33 A            SEQ##4H        4  0       COLHDG('SEQ#')
     A**********************************************************************
     A*           T54D    -    4D      EDI RTS 754 DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                (EDI DOC. SENT TO THEM    )
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T54DFM
     A*
     A            DISP#4D       15          COLHDG('DISPATCH #')
     A            OURRF4D       12          COLHDG('OUR REF#')
     A*                                      NRS LOAD# - FOR LOADS
     A*                                       GIVEN TO OTHER CARRIERS
     A*                                      OUR P/U# (IN REF# FLD
     A*                                       OF RTSF -- FOR LOADS
     A*                                       WE DO
     A            BLNQF4D        2          COLHDG('B/L' 'QUALIF')
     A*                                      'BM'
     A*                                      '  '
     A            BLNUM4D       20          COLHDG('B/L NUMBER')
     A            DPTQF4D        2          COLHDG('DEPT' 'QUALIF')
     A*                                      'DP'
     A*                                      '  '
     A            DEPTC4D        4  0       COLHDG('DEPARTMENT')
     A            SCAC#4D        4          COLHDG('SCAC' 'CODE')
     A*                                       OF CARRIER PICKING UP
     A*                                       THE LOAD
     A            STOP#4D        5  0       COLHDG('STOP' 'NUMBER')
     A            SCDPU4D        8  0       COLHDG('P/U' 'DATE')
     A            SCDTM4D        4  0       COLHDG('P/U' 'TIME')
     A            DESTC4D        4          COLHDG('DEST' 'CODE')
     A*                                      DC CODE
     A*                                      OR OUR SCAC CODE IF COMING
     A*                                      TO US
GP33 A            SEQ##4D        4  0       COLHDG('SEQ#')
     A**********************************************************************
     A*           T54P    -    4P      EDI RTS 754 PO DETAIL
     A*                                FOR TARGET/DAYTON HUDSON/MARSHAL
     A*                                (EDI DOC. SENT TO THEM    )
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T54PFM
     A*
     A            DISP#4P       15          COLHDG('DISPATCH #')
     A            OURRF4P       12          COLHDG('OUR REF#')
     A*                                      NRS LOAD# - FOR LOADS
     A*                                       GIVEN TO OTHER CARRIERS
     A*                                      OUR P/U# (IN REF# FLD
     A*                                       OF RTSF -- FOR LOADS
     A*                                       WE DO
     A            PONUM4P       17          COLHDG('PO')
     A*                                      DDDDPPPPPPPPLLLL
     A*                                        D = DEPT#
     A*                                        P = PO#
     A*                                        L= DC#
     A            COPO#4P       12          COLHDG('COMBO PO#')
     A            PACKC4P        3          COLHDG('CTN' 'CODE')
     A*                                        PCK = YES HEAD LOAD
     A*                                        UNP = NO HEAD LOAD
     A            QCTNS4P       15  0       COLHDG('CARTONS')
     A            WGTCD4P        1          COLHDG('WGT' 'CODE')
     A*                                        L
     A            WEIGH4P       15  0       COLHDG('WEIGHT')
     A            VOLCD4P        1          COLHDG('VOL' 'CODE')
     A*                                        E/F
     A            CUBES4P       15  0       COLHDG('CUBE')
     A            CNOTE4P       80          COLHDG('CONS' 'NOTES')
     A            REL##4P       12          COLHDG('RELEASE' 'ID')
GP33 A            SEQ##4P        4  0       COLHDG('SEQ#')
     A**********************************************************************
     A*           MFAX      -                MANIFESTS FAX INFORMATION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00005
     A*         R MFAXFM
     A*
     A            ACRECMF        1          COLHDG('ACTIVE' 'CODE')
     A            TERM#MF        4          COLHDG('TERM #')
     A            FAXN#MF       10          COLHDG('FAX NUMBER')
     A            CMNAMMF       25          COLHDG('COMPANY' 'NAME')
     A            CONAMMF       25          COLHDG('CONTACT' 'PERSON')
     A**********************************************************************
     A*           ERT7    -    7       EDI DETAIL FOR 997 FROM TARGET
     A*                                CARRIERS OR NTE IF THEY GOT THE
     A*                                204 WE SENT THEM
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R ERT7FM
     A*
     A            MAILT7        10          COLHDG('997 MAILBOX ID#')
     A            TDGPT7        15          COLHDG('TDG PARTNER' 'ID')
     A*                                         TK210
     A*                                         TK214
     A*                                      (WRITTEN BU T997KY TR
     A*                                       FORMAT IN PREMENOS)
     A            GRPRT7        14          COLHDG('GROUP' 'REF#')
     A            STATT7         1          COLHDG('CARRIER' 'STATUS')
     A*                                       A = ACCEPTED THE 204
     A            NUMST7         6  0       COLHDG('NUMBER' 'SENT')
     A            RECVT7         6  0       COLHDG('NUMBER' 'RECVD')
     A            ACCPT7         6  0       COLHDG('NUMBER' 'ACCEPTED')
     A            PROCT7         1          COLHDG('PROCESSED')
     A*                                       Y = MATCHED WITH RTSF FILE
     A**********************************************************************
     A*           HBNP      -       HUB GROUP NART P/U PO#   FOR LNT
     A*                              POPULATED FROM EDI 204 WORK FILES
     A*                              SENT TO US FROM HUB GROUP
     A*                              IN LIB EDINRSD/EDINRSDT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R HBNPFM
     A*
     A            ACRECHP        1          COLHDG('ACTIVE' 'CODE')
     A            TMLD#HP       17          COLHDG('TM LOAD#')
     A            STOP#HP        3  0       COLHDG('STOP#')
     A* INFO. WE POPULATE
     A            TERM#HP        4          COLHDG('TERMINAL')
     A            PUNUMHP        7  0       COLHDG('P/U' 'NUMBER')
     A            SEQNOHP        3  0       COLHDG('SEQUENCE')
     A*
     A* PURCHASE ORDER DETAIL FROM EDI 204 FROM HUB GROUP
     A            PONUMHP       15          COLHDG('P/O #')
     A            LNTSPHP       30          COLHDG('LNT' 'SHIPMENT#')
     A            CTNQTHP        5  0       COLHDG('CTN' 'QTY')
     A            GOHQTHP        5  0       COLHDG('GOH' 'QTY')
     A            WEIGHHP        5  0       COLHDG('WEIGHT')
     A            CUBFTHP        5  0       COLHDG('CUBE')
     A**********************************************************************
     A*           FSCD      -                FUEL SURCHARGE PROFILE DET
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 005000 00004
     A*         R FSCDFM
     A*
     A            PROFIF2        4          COLHDG('PROFILE ID')
     A            EFFDTF2         L         COLHDG('EFFECTIVE' 'DATE')
     A            VALUEF2        5  3       COLHDG('MINIMUM' 'VALUE')
     A*** 3/14/22 RATE1F2        3  3       COLHDG('RATE')
ML   A            RATE1F2        5  3       COLHDG('RATE')
     A**********************************************************************
     A*           FSCH      -                FUEL SURCHARGE PROFILE HDR
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0005000 001000 00004
     A*         R FSCHFM
     A*
     A            PROFIF1        4          COLHDG('PROFILE ID')
     A            EFFDTF1         L         COLHDG('EFFECTIVE' 'DATE')
     A            CALCMF1        1          COLHDG('CALC' 'METHOD')
     A*                                        0 = WEEKLY PEG - MONDAY
     A*                                        1 = WEEKLY PEG - TUESDAY
     A*                                        M = MONTHLY PEG
     A            CALCTF1        1          COLHDG('CALC' 'TYPE')
     A*                                        M = MILEAGE (CENTS)
     A*                                        $ = PCT OF REV (PCT)
     A            FPTYPF1        1          COLHDG('FUEL PEG TYPE')
     A*                                        N = NATIONAL AVG
     A*                                        A = CALIFORNIA AVG
     A*                                        W = WEST COAST AVG
     A*                                        E = EAST COAST AVG
     A*                                        M = CENTRAL ATLANTIC
     A            MILERF1        1          COLHDG('MILEAGE' 'TOOL')
     A*                                        P = PC MILER
     A*                                        R = RAND MCNALLY
     A            DESCRF1       25          COLHDG('DESCRIPTION')
     A**********************************************************************
     A*           FSCP      -                FUEL SURCHARGE FUEL PEG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000100 005000 00004
     A*         R FSCPFM
     A*
     A            FPTYPFP        1          COLHDG('FUEL PEG TYPE')
     A*                                        N = NATIONAL AVG
     A*                                        A = CALIFORNIA  AVG
     A*                                        W = WEST COAST AVG
     A            EFFDTFP         L         COLHDG('EFFECTIVE' 'DATE')
     A            AEFDTFP         L         COLHDG('ALT' 'EFFECTIVE' 'DATE')
     A            PRICEFP        5  3       COLHDG('FUEL' 'PRICE')
GP   A            WEFDTFP         L         COLHDG('WED' 'EFFECTIVE' 'DATE')
GP   A*                                         WEDNESDAY DATE
GP   A            TEFDTFP         L         COLHDG('THU' 'EFFECTIVE' 'DATE')
GP   A*                                         THURSDAY  DATE
GP   A            FEFDTFP         L         COLHDG('FRI' 'EFFECTIVE' 'DATE')
GP   A*                                         FRIDAY    DATE
GP04 A            GEFDTFP         L         COLHDG('SAT' 'EFFECTIVE' 'DATE')
GP04 A*                                         FRIDAY    DATE
GP04 A            SEFDTFP         L         COLHDG('SUN' 'EFFECTIVE' 'DATE')
GP04 A*                                         FRIDAY    DATE
     A**********************************************************************
     A*           MILE      -                KEEP ALREADY CALCULATED DISTANCE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R MILEFM
     A*
     A            ACRECMI        1          COLHDG('ACTIVE REC CODE')
     A            FRZIPMI        5  0       COLHDG('FROM ZIP')
     A            TOZIPMI        5  0       COLHDG('TO ZIP')
     A            PCMILMI        5  0       COLHDG('PCM P MILES')
      *                                        PRACTICAL/53-FOOTERS ONLY
     A            RMMILMI        5  0       COLHDG('RMN   MILES')
     A            SCMILMI        5  0       COLHDG('PCM S MILES')
     A            TCMILMI        5  0       COLHDG('PCM T MILES')
      *                                        PRACTICAL/ALL
     A            NCMILMI        5  0       COLHDG('PCM N MILES')
     A            PCVERMI        5          COLHDG('VERSION')
     A**********************************************************************
     A*           MILE      -                KEEP ALREADY CALCULATED DISTANCE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SMILFM
     A*
     A            ACRECSI        1          COLHDG('ACTIVE REC CODE')
     A            FRZIPSI        5  0       COLHDG('FROM ZIP')
     A            TOZIPSI        5  0       COLHDG('TO ZIP')
     A            TOOLTSI        1          COLHDG('TOOL TYPE')
     A            STATESI        2          COLHDG('STATE')
     A            MILESSI        8  3       COLHDG('MILES')
     A            PCVERSI        5          COLHDG('VERSION')
     A**********************************************************************
     A*           DSWL      -       DSW GROUP NART P/U STOPS FOR LNT
     A*                              POPULATED FROM EDI 204 WORK FILES
     A*                              SENT TO US FROM DSW GROUP
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R DSWLFM
     A*
     A            ACRECDS        1          COLHDG('ACTIVE' 'CODE')
     A*
     A***  --- INFORMATION FROM EDI 204 DOCUMENT
     A            SCACDDS        4          COLHDG('SCAC' 'CODE')
     A*                                         NART
     A            TMLD#DS       30          COLHDG('TM LOAD#')
     A            STOP#DS        3  0       COLHDG('STOP#')
     A            STATSDS        2          COLHDG('STATUS' 'FRM 204')
     A*                                       00 = ORIGINAL
     A*                                       01 = CANCELLED
     A*                                       08 = REISSUED
     A            CCPP$DS        2          COLHDG('COLLECT/' 'PREPAID')
     A*                                       CC = COLLECT
     A*                                       PP = PREPAID
     A            REMARDS       80          COLHDG('REMARKS')
     A* MORE STOP REMARKS IN OLFILE/D204B40
     A            REASNDS        2          COLHDG('STOP' 'REASON')
     A*                                        PL = PARIAL LOAD
     A*                                        CL = COMPLETE LOAD
     A*                                        PU = PARTIAL UNLOAD
     A*                                        CU = COMPLETE UNLOAD
     A*
     A* VENDOR INFO (ONLY FOR REASNHS = 'PL' OR 'CL'
     A* CONSIGNEE INFO (ONLY FOR REASNHS = 'PU' OR 'CU')
     A            TMLOCDS       17          COLHDG('TM LOC.ID')
     A*                                       TM LOCATION ID FOR VENDOR
     A*                                       SENT FRM EDI VIA HUB GRP
     A            TMNAMDS       35          COLHDG('VEND/' 'CONS NAME')
     A            TMADDDS       35          COLHDG('ADDRESS 1')
     A            TMCITDS       30          COLHDG('CITY')
     A            TMSTADS        2          COLHDG('STATE')
     A            TMZIPDS        5  0       COLHDG('ZIP')
     A*
     A            AVLDTDS        8  0       COLHDG('AVAIL' 'FROM')
     A*                                       YYYYMMDD
     A            AVLTMDS        4  0       COLHDG('AVAIL' 'FROM TM')
     A*
     A            AVLD2DS        8  0       COLHDG('AVAIL' 'TO'  )
     A*                                       YYYYMMDD
     A            AVLT2DS        4  0       COLHDG('AVAIL' 'TO TIME')
     A*
     A            TMPERDS       25          COLHDG('TM' 'CONTACT')
     A            TMTELDS       12          COLHDG('TM' 'TEL#')
     A*
     A* SHIPMENT INFO
     A            CTNQTDS        5  0       COLHDG('CTN' 'QTY')
     A            GOHQTDS        5  0       COLHDG('GOH' 'QTY')
     A            WEIGHDS        5  0       COLHDG('WEIGHT')
     A            CUBFTDS        5  0       COLHDG('CUBIC' 'FEET')
     A*
     A*
     A***  --- OUR INFORMATION THAT WE POPULATE
GP   A**          TERM#DS        2          COLHDG('TERMINAL')
GP   A            TERM#DS        4          COLHDG('TERMINAL')
GP   A***         VEND#DS        5  0       COLHDG('NRS' 'VENDOR')
GP   A            VEND#DS        6          COLHDG('NRS' 'VENDOR')
     A            CONS#DS        5  0       COLHDG('CONS #')
     A            CONSNDS       25          COLHDG('CONS' 'NAME')
     A            PUNUMDS        7  0       COLHDG('P/U' 'NUMBER')
     A* EDI 214 TO HUB INFO.
     A            PREFXDS        4          COLHDG('TRAILER' 'PREFIX')
     A*                                       TRAILER/CONTAINER PREFIX
     A            TRAILDS       10          COLHDG('TRAILER/' 'CONTAINER#')
     A            PUARDDS        8  0       COLHDG('P/U ARRIVED' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE ARRIVED AT P/U
     A            PUARTDS        4  0       COLHDG('P/U ARRIVED' 'TIME')
     A            PUDPDDS        8  0       COLHDG('P/U DEPART ' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE DEPARTED P/U
     A            PUDPTDS        4  0       COLHDG('P/U DEPART ' 'TIME')
     A            DLARDDS        8  0       COLHDG('DLV.ARRIVED' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE ARRIVED DELIVERY LOC.
     A            DLARTDS        4  0       COLHDG('DLV.ARRIVED' 'TIME')
     A            DLDPDDS        8  0       COLHDG('DLV.DEPART ' 'DATE')
     A*                                       YYYYMMDD
     A*                                        DATE DEPARTED DELIVERY LOC
     A            DLDPTDS        4  0       COLHDG('DLV.DEPART ' 'TIME')
     A*
     A            EDIDTDS        8  0       COLHDG('EDI 214' 'DATE')
     A*                                       YYYYMMDD
     A            EDIMLDS       10          COLHDG('EDI' 'MAILBOX')
     A            PUAPPDS        8  0       COLHDG('P/U APPT' 'DATE')
     A*                                       YYYYMMDD
     A            PUATMDS        4  0       COLHDG('P/U APPT' 'TIME')
     A*                                        DATE DEPARTED DELIVERY LOC
     A            SYSINDS        8  0       COLHDG('EDI MOVED' 'DATE'  )
     A*                                       YYYYMMDD
     A*                                         EDI INCOMING 204 DATE
     A*                                         WHEN MOVED TO DSWL
     A            SYSTMDS        8  0       COLHDG('EDI MOVED' 'TIME')
     A**********************************************************************
     A*           DSWP      -       DSW GROUP NART P/U PO#
     A*                              POPULATED FROM EDI 204 WORK FILES
     A*                              SENT TO US FROM DSW GROUP
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R DSWPFM
     A*
     A            ACRCDDP        1          COLHDG('ACTIVE' 'CODE')
     A            TMLD#DP       30          COLHDG('TM LOAD#')
     A            STOP#DP        3  0       COLHDG('STOP#')
     A* INFO. WE POPULATE
     A            TERM#DP        2          COLHDG('TERMINAL')
     A            PUNUMDP        7  0       COLHDG('P/U' 'NUMBER')
     A            SEQNODP        3  0       COLHDG('SEQUENCE')
     A*
     A* PURCHASE ORDER DETAIL FROM EDI 204 FROM HUB GROUP
     A            PONUMDP       15          COLHDG('P/O #')
     A            LNTSPDP       30          COLHDG('DSW' 'BOL#')
     A            CTNQTDP        5  0       COLHDG('CTN' 'QTY')
     A            GOHQTDP        5  0       COLHDG('GOH' 'QTY')
     A            WEIGHDP        5  0       COLHDG('WEIGHT')
     A            CUBFTDP        5  0       COLHDG('CUBE')
     A            EDIMLDP       10          COLHDG('EDI' 'MAILBOX')
     A            DSWSODP       30          COLHDG('SALES' 'ORDER#')
     A            SYSINDP        8  0       COLHDG('EDI MOVED' 'DATE'  )
     A*                                       YYYYMMDD
     A*                                         EDI INCOMING 204 DATE
     A*                                         WHEN MOVED TO DSWP
     A            SYSTMDP        8  0       COLHDG('EDI MOVED' 'TIME')
     A            EDIDTDP        8  0       COLHDG('EDI 214' 'DATE')
     A*                                       YYYYMMDD
GP   A**********************************************************************
     A*           DSWU      -       DSW GROUP FILE TO STORE DSW LOAD# AND
     A*                              PREV PU# TO REUSE FOR AN UPDATE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 010000 01000
     A*         R DSWUFM
     A*
     A            ACRECDU        1          COLHDG('ACTIVE' 'CODE')
     A            TMLD#DU       30          COLHDG('TM LOAD#')
     A            PUNUMDU        7  0       COLHDG('P/U' 'NUMBER')
     A            EDIMLDU       10          COLHDG('EDI UPD' 'MAILBOX')
     A            SYSINDU        8  0       COLHDG('EDI MOVED' 'DATE'  )
     A*                                       YYYYMMDD
     A*                                        FOR EDI UPDATE
     A*                                         EDI INCOMING 204 DATE
     A*                                         WHEN MOVED TO DSWP
     A            SYSTMDU        8  0       COLHDG('EDI MOVED' 'TIME')
     A*                                        FOR EDI UPDATE
     A            REUSEDU        1          COLHDG('PU#' 'REUSED')
     A**********************************************************************
     A*           DSWB      -       DSW GROUP NART BOL INOF
     A*                              POPULATED FROM EDI 204 WORK FILES
     A*                              SENT TO US FROM DSW GROUP
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 01000
     A*         R DSWBFM
     A*
     A            ACRCDDB        1          COLHDG('ACTIVE' 'CODE')
     A            TMLD#DB       30          COLHDG('TM LOAD#')
     A            STOP#DB        3  0       COLHDG('STOP#')
     A            REF#DB        30          COLHDG('REF#')
     A            REF#QB         3          COLHDG('REF#' 'QUALIF')
     A            EDIMLDB       10          COLHDG('EDI' 'MAILBOX')
     A            SYSINDB        8  0       COLHDG('EDI MOVED' 'DATE'  )
     A*                                       YYYYMMDD
     A*                                         EDI INCOMING 204 DATE
     A*                                         WHEN MOVED TO DSWP
     A            SYSTMDB        8  0       COLHDG('EDI MOVED' 'TIME')
     A**********************************************************************
     A*           DSVC      -       DSW GROUP VENDOR X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 005000 00100
     A*         R DSVCFM
     A*
     A            ACRECDC        1          COLHDG('ACTIVE' 'REC CODE')
     A            TMLOCDC       17          COLHDG('TM LOC.ID')
     A*
     A            VEND#DC        6          COLHDG('NRS' 'NUMBER')
     A            TERM#DC        4          COLHDG('NRS' 'TERMINAL')
     A            TMNAMDC       35          COLHDG('VEND/' 'CONS NAME')
     A            TMADDDC       35          COLHDG('ADDRESS 1')
     A            TMZIPDC        5  0       COLHDG('ZIP')
     A            TMCOMDC        3          COLHDG('COMPANY')
     A*                                       'DSW' -- DSW
     A*                                       'BEL' -- BEALLS
     A**********************************************************************
     A*           SHJB      -                JOBS ASSIGNED TO SUB-HAULERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHJBFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO CNNA_SHJB
     A*
     A*--- AS ASSIGNED ---------------------------------------------------------
     A            SUBHSH         6          COLHDG('SUB-HAULER' 'CODE')
     A            REF#SH         7  0       COLHDG('REFERENCE' 'NUMBER')
     A            REFQSH         2          COLHDG('REFERENCE' 'QUALIFIER')
     A*                                             "PU" FOR PICKUPS
     A*                                             ORDER TYPE FOR ORDERS
     A            ROUTSH         7          COLHDG('ROUTE')
     A            ASSUSH        10          COLHDG('ASSIGNED' 'USER')
     A            ASSDSH          L         COLHDG('ASSIGNED' 'DATE')
     A            ASSTSH         4  0       COLHDG('ASSIGNED' 'TIME')
     A*--- AT CHECK-IN ---------------------------------------------------------
     A            ORD#SH         7  0       COLHDG('ORDER' 'NUMBER')
     A            ORDTSH         2          COLHDG('ORDER' 'TYPE')
     A            CHKUSH        10          COLHDG('CHECK-IN' 'USER')
     A            CHKDSH          L         COLHDG('CHECK-IN' 'DATE')
     A            CHKTSH         4  0       COLHDG('CHECK-IN' 'TIME')
     A*--- IF REMOVED ----------------------------------------------------------
     A            RMVUSH        10          COLHDG('REMOVED' 'USER')
     A            RMVDSH          L         COLHDG('REMOVED' 'DATE')
     A            RMVTSH         4  0       COLHDG('REMOVED' 'TIME')
     A*--- ADDED ON 7/02/13 ----------------------------------------------------
     A            INSTSH         2          COLHDG('INTERMEDIATE' 'STATUS')
     A*                                       TBD
     A            INDTSH          L         COLHDG('INT STATUS' 'DATE')
     A            INTMSH         4  0       COLHDG('INT STATUS' 'TIME')
     A**********************************************************************
     A*           SHOP      -                SUB HAULER OPERATION CODE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHOPFM
     A*
     A            SUBHLRSO       4          COLHDG('SUB-HAULER' 'COMPANY')
NC06 A            SHDIV#SO       4          COLHDG('SUB-HAULER' 'DIVISION')
     A            OPCDSHSO       4          COLHDG('OPERATION' 'CODE')
     A            FSCFEESO       4          COLHDG('FSC' 'CODE')
     A            ADMFEESO       6  3       COLHDG('ADM. FEE' 'OR FSC')
     A**********************************************************************
     A*           SHCO      -                SUB HAULER COMPANY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHCOFM
     A*
     A            SHCOMPSC       4          COLHDG('S/H' 'CODE')
     A            SHNAMESC      20          COLHDG('S/H' 'NAME')
     A            SHADR1SC      20          COLHDG('S/H' 'ADDR1')
     A            SHADR2SC      20          COLHDG('S/H' 'ADDR2')
     A            SHCITYSC      20          COLHDG('S/H' 'CITY')
     A            SHSATESC       2          COLHDG('S/H' 'ST')
     A            SHZIPCSC       5  0       COLHDG('S/H' 'ZIP')
     A            SHPHONSC      10          COLHDG('S/H' 'PHONE')
     A*
NC07 A*           SRCODESC       4          COLHDG('LTL' 'RATE')
NC07 A*                                     LTL RATE CODE
NC07 A*           SGOHR1SC       3  3       COLHDG('GOH A' 'RATE')
NC07 A*           SGOHR2SC       3  3       COLHDG('GOH B' 'RATE')
NC07 A*           SGOHR3SC       3  3       COLHDG('GOH C' 'RATE')
NC07 A*           SGOHR4SC       3  3       COLHDG('GOH D' 'RATE')
NC07 A*           SGOHR5SC       3  3       COLHDG('GOH E' 'RATE')
NC07 A*           SRTMINSC       7  2       COLHDG('LTL' 'RATE' 'MIN')
NC07 A*           SRTMAXSC       7  2       COLHDG('LTL' 'RATE' 'MAX')
NC07 A* (NOTE: FIELDS FOR OWNER OPERATORS ONLY)
NC07 A*           SFULLRSC       6  5       COLHDG('RATE/MI' 'FULL')
NC07 A*           SEMPTYSC       6  5       COLHDG('RATE/MI' 'EMPTY')
NC07 A*           SOUTBRSC       6  5       COLHDG('OUTBOUND' 'RT/MI')
NC07 A*           SFLATRSC       7  2       COLHDG('FLAT RATE')
NC07 A*           SRATUMSC       1          COLHDG('RATE' 'UOM')
NC07 A*                                     M=MILE
NC07 A*                                     W=WEIGHT
NC05 A**********************************************************************
NC05 A*           SHDV      -                SUB HAULER DIVISION
NC05 A**********************************************************************
NC05 A*                                     SIZE   INCR.  TIMES
NC05 A*&                                   5000000 030000 00010
NC05 A*         R SHDVFM
NC05 A*
NC05 A            SHCOMPDV       4          COLHDG('S/H' 'COMP')
NC05 A            SHDIV#DV       4          COLHDG('S/H' 'DIV#')
NC05 A            SRCODEDV       4          COLHDG('LTL' 'RATE')
NC05 A*                                     LTL RATE CODE
NC05 A            SGOHR1DV       3  3       COLHDG('GOH A' 'RATE')
NC05 A            SGOHR2DV       3  3       COLHDG('GOH B' 'RATE')
NC05 A            SGOHR3DV       3  3       COLHDG('GOH C' 'RATE')
NC05 A            SGOHR4DV       3  3       COLHDG('GOH D' 'RATE')
NC05 A            SGOHR5DV       3  3       COLHDG('GOH E' 'RATE')
NC05 A            SRTMINDV       7  2       COLHDG('LTL' 'CTN' 'MIN')
NC05 A            SRTMAXDV       7  2       COLHDG('LTL' 'CTN' 'MAX')
NC05 A* (NOTE: FIELDS FOR S/H TRUCK LOAD ONLY)
NC05 A            SFULLRDV       6  5       COLHDG('RATE/MI' 'FULL')
NC05 A            SEMPTYDV       6  5       COLHDG('RATE/MI' 'EMPTY')
NC05 A            SOUTBRDV       6  5       COLHDG('OUTBOUND' 'RT/MI')
NC05 A            SFLATRDV       7  2       COLHDG('FLAT RATE')
NC05 A            SRATUMDV       1          COLHDG('RATE' 'UOM')
NC05 A*                                     M=MILE
NC05 A*                                     W=WEIGHT
ML** A* BELOW 2 FIELDS ARE NOT IN USE ANYMORE --- (7/11/08) --------------
ML   A* LTL FUEL SURCHARGE - PERCENTAGE OF TRANSPORTATION-RELATED CHARGES
ML   A            LTLFSCDV       6  3       COLHDG('LTL' 'FSC' 'PCT')
ML   A* TL FUEL SURCHARGE - AMOUNT PER MILE
ML   A            TLFSC$DV       6  5       COLHDG('TL FSC' 'RATE PER MILE')
ML** A* ------------------------------------------------------------------
ML   A            TLFLAGDV       1          COLHDG('TL' 'FSC' 'FLAG')
ML   A*                                     A=BASED ON ALL MILES;
ML   A*                                     L-BASED ON LOADED MILES OMLY;
ML   A*                                     E-BASED ON EMPTY MILES ONLY;
ML   A*                                     C-CUSTOMER RATE BASED ON LOADED
ML   A*                                       MILES ONLY - IGNORE TLFSC$DV;
ML   A* LTL SERVICE SURCHARGE - PERCENTAGE OF TRANSPORTATION-RELATED CHARGES
ML   A            LTLSSCDV       6  3       COLHDG('LTL' 'SSC' 'PCT')
ML   A* TL SERVICE SURCHARGE - PERCENTAGE OF TRANSPORTATION-RELATED CHARGES
ML   A            TLSVSCDV       6  3       COLHDG('TL' 'SSC' 'PCT')
ML   A* LAWSON ID'S (SEPARATE FOR TL AND LTL - MAY HAVE THE SAME VALUES)
ML   A            LTLLAWDV       9  0       COLHDG('LAWSON' 'LTL #')
ML   A            TLLAWSDV       9  0       COLHDG('LAWSON' 'TL #')
ML   A* LAST PAID DATES
ML   A            LTLLASDV        L         COLHDG('LTL LAST' 'PAID DATE')
ML   A                                      DFT('0001-01-01')
ML   A            TLLASTDV        L         COLHDG('TL LAST' 'PAID DATE')
ML   A                                      DFT('0001-01-01')
ML   A* CUT-OFF DATES
ML   A            LTLCOFDV        L         COLHDG('LTL CUT' 'OFF DATE')
ML   A                                      DFT('0001-01-01')
ML   A            TLCOFFDV        L         COLHDG('TL CUT' 'OFF DATE')
ML   A                                      DFT('0001-01-01')
ML** A* ADDED ON 7/11/08 --------------------------------------------------
ML** A            GOHMINDV       7  2       COLHDG('LTL' 'GOH' 'MIN')
ML** A            GOHMAXDV       7  2       COLHDG('LTL' 'GOH' 'MAX')
ML** A            LT$FSCDV       4          COLHDG('LTL' 'FUEL' 'PROFILE')
ML** A            TL$FSCDV       4          COLHDG('TL' 'FUEL' 'PROFILE')
ML** A* ADDED ON 9/17/10 --------------------------------------------------
ML** A            TLMIN$DV       7  2       COLHDG('TL MIN PAY' 'PER ORDER')
ML** A            TLMIN#DV       1          COLHDG('TL MIN PAY' 'BASIS')
ML** A* -------------------------------------------------------------------
     A**********************************************************************
     A*           SHIY      -                SUB HAULER LTL VOUCHER WORK FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHIYFM
     A*
     A            INV#IY         7  0       COLHDG('INVOICE#')
     A**********************************************************************
     A*           SHIX      -                SUB HAULER LTL VOUCHER WORK FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHIXFM
     A*
     A            INV#IX         7  0       COLHDG('INVOICE#')
     A            TYPEIX         1          COLHDG('LINE TYPE')
     A*                                     A=ADJ; S=SURCHARGE
     A            CODEIX         3          COLHDG('CODE')
     A            DESCIX        20          COLHDG('DESC')
     A            AMNTIX         9  2       COLHDG('AMOUNT')
     A**********************************************************************
     A*           SHI1      -                SUB HAULER INV/VOUCHER (LEVEL 1)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHI1FM
     A*
     A            COMPI1         4          COLHDG('S/H COMPANY')
     A            NRS_I1         3          COLHDG('NRS COMPANY')
     A            TERMI1         4          COLHDG('SERVICE' 'TERMINAL')
     A            INV#I1         7  0       COLHDG('INVOICE#')
     A            TYPEI1         3          COLHDG('LTL' 'OR TL')
     A            DATEI1          L         COLHDG('WEEK' 'END')
     A                                      DFT('0001-01-01')
     A            MANFI1         5  0       COLHDG('INV' 'MANIFESTS')
     A            BILLI1         5  0       COLHDG('INV' 'PROS')
     A            GOH_I1         7  0       COLHDG('INV' 'GOH')
     A            CTN_I1         7  0       COLHDG('INV' 'CTN')
     A            WGT_I1         7  0       COLHDG('INV' 'WGT')
     A            CHR$I1         9  2       COLHDG('INV' 'CHARGES')
     A            ADJ$I1         9  2       COLHDG('INV' 'ADJUSTMENTS')
     A            SCH$I1         9  2       COLHDG('INV' 'SURCHARGES')
     A            TOT$I1         9  2       COLHDG('INV' 'TOTAL')
     A**********************************************************************
TRIP A*           SHI2      -                SUB HAULER INV/VOUCHER (LEVEL 2)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHI2FM
     A*
     A            INV#I2         7  0       COLHDG('INVOICE#')
     A* MANIFEST LINE
     A            MANFI2         7  0       COLHDG('MANIFEST#')
     A            DATEI2          L         COLHDG('MANIFEST' 'DATE')
     A                                      DFT('0001-01-01')
     A            ORDRI2         7  0       COLHDG('ORDER#')
TRIP A            TRIPI2         7  0       COLHDG('TRIP#')
     A            TERMI2         4          COLHDG('SERVICE' 'TERMINAL')
     A            DRVRI2         6          COLHDG('DRIVER')
     A            UNITI2         6          COLHDG('TRACTOR')
     A            TRALI2         7          COLHDG('TRAILER')
     A            BILLI2         5  0       COLHDG('MANF' 'PROS')
     A            GOH_I2         6  0       COLHDG('MANF' 'GOH')
     A            CTN_I2         6  0       COLHDG('MANF' 'CTN')
     A            WGT_I2         6  0       COLHDG('MANF' 'WGT')
     A            BLNGI2         9  2       COLHDG('MANF' 'BILLING$')
     A* ADJUSTMENT LINE
     C            DESCI2        20          COLHDG('ADJUSTMENT' 'DESCRIPTION')
     A*
     A            CHR$I2         9  2       COLHDG('CHARGES')
     A            TYPEI2         1          COLHDG('LINE' 'TYPE')
     A*                                     C=CHARGES
     A*                                     S=SURCHARGES
     A*                                     A=ADJUSTMENTS
     A            ADDLI2         1          COLHDG('ADDITIONAL' 'FLAG')
     A*                                      =PRIMARY
     A*                                     Y=ADDITONAL
     A            LOADI2         5  0       COLHDG('TL LOADED' 'MILES')
     A            EMPTI2         5  0       COLHDG('TL EMPTY' 'MILES')
     A            STRTI2         6          COLHDG('TL START' 'POINT')
     A            ENDPI2         6          COLHDG('TL END' 'POINT')
     A**********************************************************************
TRIP A*           SHI3      -                SUB HAULER INV/VOUCHER (LEVEL 3)
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHI3FM
     A*
     A            INV#I3         7  0       COLHDG('INVOICE#')
     A            MANFI3         7  0       COLHDG('MANIFEST#')
     A            ORDRI3         7  0       COLHDG('ORDER#')
TRIP A            TRIPI3         7  0       COLHDG('TRIP#')
     A            TERMI3         4          COLHDG('SERVICE' 'TERMINAL')
     A            DRVRI3         6          COLHDG('DRIVER')
     A* PRO
     A            PRO_I3         7  0       COLHDG('PRO#')
     A            SHIPI3         6          COLHDG('SHIPPER' 'LOCATION')
     A            CONSI3         6          COLHDG('CONSIGNEE' 'LOCATION')
     A            GOH_I3         6  0       COLHDG('PRO' 'GOH')
     A            CTN_I3         6  0       COLHDG('PRO' 'CTN')
     A            WGT_I3         6  0       COLHDG('PRO' 'WGT')
     A            BLNGI3         7  2       COLHDG('PRO' 'BILLING$')
     A* PER MILE LINE
     C            FRSTI3         6          COLHDG('FAREST' 'P/U LOCATION')
     C            MILEI3         5  0       COLHDG('MILES')
     A*
     A            CHR$I3         7  2       COLHDG('CHARGES')
     A* STOPOFF & DELAY LINE
     C            DESCI3        20          COLHDG('DESCRIPTION')
     A**********************************************************************
TRIP A*           SHMF      -                SUB HAULER MANIFEST
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHMFFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO SHMFWORK
     A*
     A            SHCOMPSM       4          COLHDG('CODE')
     A            SHINVCSM       7  0       COLHDG('INVOICE#')
     A            SHORDRSM       7  0       COLHDG('ORDER')
     A            SHMANFSM       7  0       COLHDG('MOVE#')
     A            SHMANDSM        L         COLHDG('MANIFEST' 'DATE')
     A                                      DFT('0001-01-01')
     A            SHUNITSM       8          COLHDG('UNIT')
     A            SHMBILSM       2  0       COLHDG('MAN' 'BILLS')
     A            SHMGOHSM       5  0       COLHDG('MAN' 'GOH')
     A            SHMCTNSM       5  0       COLHDG('MAN' 'CTN')
     A            SHMWGTSM       5  0       COLHDG('MAN' 'WGT')
     A            SHTAMTSM       7  2       COLHDG('MAN' 'AMOUNT')
     A            SHDIVISM       4          COLHDG('MAN' 'DIVISION')
TRIP A            SHTRIPSM       7  0       COLHDG('MAN' 'TRIP')
     A**********************************************************************
     A*           NAIC      -                NAIT INS CONTROL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R NAICFM
     A            ACCOUNTC       5  0       COLHDG('ACCT' 'NBR')
     A            INVOIC#C       7  0       COLHDG('INV' 'NBR')
     A            BATCH##C       3  0       COLHDG('BATCH' 'NBR')
     A            INVOIC$C       7  2       COLHDG('TOTAL' 'AMT')
     A            ENTDATEC        L         COLHDG('ENTRY' 'DATE')
     A            APPYEARC       4  0       COLHDG('APPLIED YEAR')
     A            APPMONTC       2  0       COLHDG('APPLIED MONTH')
     A**********************************************************************
     A*           NAIT      -                NAIT INS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R NAITFM
     A            ACCOUNTN       5  0       COLHDG('ACCT' 'NBR')
     A            INVOICEN       7  0       COLHDG('INV' 'NBR')
     A            BATCH##N       3  0       COLHDG('BATCH' 'NBR')
     A            BTCHDATN        L         COLHDG('BATCH' 'DATE')
     A            SEQNUMBN       3  0       COLHDG('SEQUENCE #')
     A            APPYEARN       4  0       COLHDG('APPLIED YEAR')
     A            APPMONTN       2  0       COLHDG('APPLIED MONTH')
     A            DRIVCODN       6          COLHDG('DRIV' 'CODE')
     A            ESCROW$N       7  2       COLHDG('ESCROW' 'AMT')
     A            TOTAL$$N       7  2       COLHDG('TOTAL' 'AMT')
     A            NAITAMTN       7  2       COLHDG('NAIT' 'AMT')
     A            OPENBALN       7  2       COLHDG('OPEN' 'BALANCE')
     A            COMMENTN      10          COLHDG('COMMENT')
     A            TRANS#1N       7  0       COLHDG('TRANS#1')
     A            CHKDAT1N        L         COLHDG('TRANS#1' 'DATE')
     A            CHCKAM1N       7  2       COLHDG('TRANS#1' 'AMOUNT')
     A            TRANS#2N       7  0       COLHDG('TRANS#2')
     A            CHKDAT2N        L         COLHDG('TRANS#2' 'DATE')
     A            CHCKAM2N       7  2       COLHDG('TRANS#2' 'AMOUNT')
     A            RECTYPEN       1          COLHDG('RECORD TYPE')
     A*                                     R = REGULAR (CREATED BY OL390S)
     A*                                     M = REGULAR (MODIFIED BY TL060B)
     A*                                     S = SUPPLEMENTAL (CREATED BY TL060B)
     A**********************************************************************
     A*           SHMI      -                SUB HAULER LTL RATE PER MILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHMIFM
     A*
     A            COMPMX         4          COLHDG('S/H' 'COMPANY')
     A            LOCTMX         6          COLHDG('START' 'LOCATION')
*NEW*A            RATEMX         6  5       COLHDG('RATE' 'PER' 'MILE')
     A*OLD*       RT01MX         7  2       COLHDG('  0 TO  10')
     A*OLD*       RT02MX         7  2       COLHDG(' 11 TO  25')
     A*OLD*       RT03MX         7  2       COLHDG(' 26 TO  35')
     A*OLD*       RT04MX         7  2       COLHDG(' 36 TO  40')
     A*OLD*       RT05MX         7  2       COLHDG(' 41 TO  50')
     A*OLD*       RT06MX         7  2       COLHDG(' 51 TO  60')
     A*OLD*       RT07MX         7  2       COLHDG(' 61 TO  70')
     A*OLD*       RT08MX         7  2       COLHDG(' 71 TO  80')
     A*OLD*       RT09MX         7  2       COLHDG(' 81 TO  90')
     A*OLD*       RT10MX         7  2       COLHDG(' 91 TO 100')
     A*OLD*       RT11MX         7  2       COLHDG('101 TO 110')
     A*OLD*       RT12MX         7  2       COLHDG('111 TO 120')
     A*OLD*       RT13MX         7  2       COLHDG('121 TO 130')
     A*OLD*       RT14MX         7  2       COLHDG('131 TO 140')
     A*OLD*       RT15MX         7  2       COLHDG('141 TO 150')
     A*OLD*       RT16MX         7  2       COLHDG('151 TO 160')
     A*OLD*       RT17MX         7  2       COLHDG('161 TO 170')
     A*OLD*       RT18MX         7  2       COLHDG('171 TO 180')
     A*OLD*       RT19MX         7  2       COLHDG('181 TO 190')
     A*OLD*       RT20MX         7  2       COLHDG('191 TO 200')
     A*OLD*       RT21MX         7  2       COLHDG('201 TO 210')
     A*OLD*       RT22MX         7  2       COLHDG('211 TO 220')
     A*OLD*       RT23MX         7  2       COLHDG('221 TO 230')
     A*OLD*       RT24MX         7  2       COLHDG('231 TO 240')
     A*OLD*       RT25MX         7  2       COLHDG('241 TO 250')
     A*OLD*       RT26MX         7  2       COLHDG('251 TO 260')
     A*OLD*       RT27MX         7  2       COLHDG('261 TO 270')
     A*OLD*       RT28MX         7  2       COLHDG('271 TO 280')
     A*OLD*       RT29MX         7  2       COLHDG('281 TO 290')
     A*OLD*       RT30MX         7  2       COLHDG('291 TO 300')
     A*OLD*       RT31MX         7  2       COLHDG('301 TO 310')
     A*OLD*       RT32MX         7  2       COLHDG('311 TO 320')
     A*OLD*       RT33MX         7  2       COLHDG('321 TO 330')
     A*OLD*       RT34MX         7  2       COLHDG('331 TO 340')
     A*OLD*       RT35MX         7  2       COLHDG('341 TO 350')
     A*OLD*       RT36MX         7  2       COLHDG('351 TO 360')
     A*OLD*       RT37MX         7  2       COLHDG('361 TO 370')
     A*OLD*       RT38MX         7  2       COLHDG('371 TO 380')
     A*OLD*       RT39MX         7  2       COLHDG('381 TO 390')
     A*OLD*       RT40MX         7  2       COLHDG('391 TO 400')
     A*OLD*       RT41MX         7  2       COLHDG('401 TO 410')
     A*OLD*       RT42MX         7  2       COLHDG('411 TO 420')
     A*OLD*       RT43MX         7  2       COLHDG('421 TO 430')
     A*OLD*       RT44MX         7  2       COLHDG('431 TO 440')
     A*OLD*       RT45MX         7  2       COLHDG('441 TO 450')
     A*OLD*       RT46MX         7  2       COLHDG('451 TO 460')
     A*OLD*       RT47MX         7  2       COLHDG('461 TO 470')
     A*OLD*       RT48MX         7  2       COLHDG('471 TO 480')
     A*OLD*       RT49MX         7  2       COLHDG('481 TO 490')
     A*OLD*       RT50MX         7  2       COLHDG('491 AND UP')
NC09 A**********************************************************************
     A*           STAP      -                SETTLEMT TRIAL APPROVAL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R STAPFM
     A*
     A            INITIALST      2          COLHDG('USER' 'INITIALS')
     A            DIVISINST      4          COLHDG('DIVISION')
     A*
     A**********************************************************************
     A*           SHAP      -                S/H SETTLEMT TRIAL APPROVAL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R SHAPFM
     A*
     A            INITIALSA      2          COLHDG('USER' 'INITIALS')
     A            TRAPRDTSA       L         COLHDG('S/H' 'DATE')
     A                                      DFT('0001-01-01')
     A*                                     S/H TRIAL APPROVAL DATE
     A*
     A**********************************************************************
     A*           STAT      -                SETTLEMT TRIAL AUTHORIZED TERMINALS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 030000 00010
     A*         R STATFM
     A*
     A            INITIALAT      2          COLHDG('USER' 'INITIALS')
     A            DIVISINAT      4          COLHDG('DIVISION')
NC09 A*
     A**********************************************************************
     A*           M3PT      -                MARMAXX 3RD PARTY BILLING ACCOUNTS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000005 00100
     A*         R M3PTFM
     A*
     A            FRNTHAULM3     5  0       COLHDG('FRONT HAUL' 'BILL-TO')
     A            THIRDPROM3     5  0       COLHDG('THIRD PRO' 'BILL-TO')
     A            TARIFF#3M3     6          COLHDG('THIRD PRO' 'TARIFF')
     A            TARIFFIDM3     1          COLHDG('THIRD PRO' 'TARIFF ID')
     A**********************************************************************
     A*           BACT      -                SPECIAL BILLING - LIST OF ACTIONS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0000500 000005 00100
     A*         R BACTFM
     A*
     A            CODEBA         3          COLHDG('PROCESS' 'ID')
     A            TERMBA         4          COLHDG('TERMINAL' 'CODE')
     A            ACTNBA        25          COLHDG('ACTION' 'NAME')
     A*--------
     A            FHTRBA         6          COLHDG('FRONT HAUL' 'TARIFF')
     A*                                       IF BLANK - USE ASSIGNED TARIFF
     A            FHBTBA         5  0       COLHDG('FRONT HAUL' 'BILL-TO')
     A*--------
     A            SBH$BA         8  3       COLHDG('SINGLE BH' 'FLAT AMOUNT')
     A            SBHFBA         4          COLHDG('SINGLE BH' 'FSC')
     A            SBHBBA         5  0       COLHDG('SINGLE BH' 'BILL-TO')
     A*--------
     A            ABHMBA         5  3       COLHDG('ATTACHED BH' 'PER ORM')
     A            ABHSBA         6  3       COLHDG('ATTACHED BH' 'PER STOPOFF')
     A            ABHABA         6  3       COLHDG('ATTACHED BH' 'DRVR ASSIST')
     A            ABH1BA         4          COLHDG('ATTACHED BH' 'FSC')
     A            ABB1BA         5  0       COLHDG('ATTACHED BH' 'BILL-TO')
     A*--------
     A            ABH$BA         8  3       COLHDG('ATTACHED BH' 'NRT PU $')
     A            ABH2BA         4          COLHDG('ATTACHED BH' 'FSC IF TCALL')
     A            ABB2BA         5  0       COLHDG('ATTACHED BH' 'BILL-TO')
     A*--------
     A            MILEBA         1          COLHDG('MILER' 'TOOL')
     A*--------
     A            USERBA        10          COLHDG('UPDATE' 'USER')
     A            DATEBA         8  0       COLHDG('UPDATE' 'DATE')
     A            TIMEBA         6  0       COLHDG('UPDATE' 'TIME')
     A*--------
     A            COFFBA         3  0       COLHDG('F/H & B/H' 'CUTOFF')
     A*--------
     A            FH$$BA         8  3       COLHDG('RUN 30 FH' 'FLAT AMOUNT')
     A            FHFSBA         4          COLHDG('RUN 30 FH' 'FSC')
     A*--------
     A            $$$1BA         8  3       COLHDG('EXTRA' 'AMOUNT 1')
      *                                     IF "PHY" - FLAT AMOUNT FOR CONS LOAD
      *                                                FROM NORTH BERGEN
     A            $$$2BA         8  3       COLHDG('EXTRA' 'AMOUNT 2')
     A            $$$3BA         8  3       COLHDG('EXTRA' 'AMOUNT 3')
     A            ###1BA        10          COLHDG('EXTRA' 'ALPHA 1')
     A            ###2BA        10          COLHDG('EXTRA' 'ALPHA 2')
     A            ###3BA        10          COLHDG('EXTRA' 'ALPHA 3')
     A            ###4BA        10          COLHDG('EXTRA' 'ALPHA 4')
     A            ###5BA        10          COLHDG('EXTRA' 'ALPHA 5')
     A            ###6BA        10          COLHDG('EXTRA' 'ALPHA 6')
     A            ###7BA        10          COLHDG('EXTRA' 'ALPHA 7')
     A            ###8BA        10          COLHDG('EXTRA' 'ALPHA 8')
     A            ###9BA        10          COLHDG('EXTRA' 'ALPHA 9')
     A            ##10BA        10          COLHDG('EXTRA' 'ALPHA 10')
     A            ##11BA        10          COLHDG('EXTRA' 'ALPHA 11')
     A            ##12BA        10          COLHDG('EXTRA' 'ALPHA 12')
     A            ##13BA        10          COLHDG('EXTRA' 'ALPHA 13')
     A            ##14BA        10          COLHDG('EXTRA' 'ALPHA 14')
     A            ##15BA        10          COLHDG('EXTRA' 'ALPHA 15')
     A            HVL$BA         9  2       COLHDG('HIGH VAL' 'MAX AMNT')
     A            HVL#BA         5  0       COLHDG('HIGH VAL' 'ACCOUNT#')
     A            HVL1BA         9  2       COLHDG('HIGH VAL' 'FORMULA 1')
     A            HVL2BA         9  2       COLHDG('HIGH VAL' 'FORMULA 2')
     A            HVL3BA         9  2       COLHDG('HIGH VAL' 'FORMULA 3')
     A**********************************************************************
TRIP A*           WGHT      -               WEIGHT DISTRIBUTION FOR RECONCILATIO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 500000 50000
     A*         R WGHTFM
     A*
     A            TERMWT         4          COLHDG('TERMINAL' 'CODE')
TRIP A            TRIPWT         7  0       COLHDG('TRIP#')
     A            ORDRWT         7  0       COLHDG('ORDER#')
     A            PORDWT         1          COLHDG('PICKUP/ DLV' 'FLAG')
     A            LOCTWT         6          COLHDG('LOCATION' 'CODE')
     A            WGHTWT         5  0       COLHDG('WEIGHT')
     A            USERWT        10          COLHDG('USER')
     A            DATEWT         8  0       COLHDG('DATE')
     A            TIMEWT         6  0       COLHDG('TIME')
     A**********************************************************************
     A*           OOGR      -               GROUP OF OWNER/OPERATORS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   5000000 500000 50000
     A*         R OOGRFM
     A*
     A            LAWSOO         9  0       COLHDG('MUTUAL' 'LAWSON ID')
     A            COMPOO         3          COLHDG('NRS' 'COMPANY CODE')
     A            NAMEOO        35          COLHDG('LAWSON' 'COMPANY NAME')
     A            ADDROO        35          COLHDG('STREET' 'ADDRESS')
     A            CITYOO        35          COLHDG('CITY' 'STATE' 'ZIP')
     A            PHONOO        15          COLHDG('PHONE' 'NUMBER')
     A            FLG1OO         1          COLHDG('PRINT' 'ON-DEMAND' 'FLAG')
     A*                                     S - PRINT SUMMARY ONLY
     A*                                     A - PRINT SUMMARY AND DETAIL
     A            FLG2OO         1          COLHDG('PRINT' 'AT FINAL' 'FLAG')
     A*                                     Y/N
     A            FLG3OO         1          COLHDG('TERMINATED')
     A            FLG4OO         1          COLHDG('FUTURE' 'USE')
     A            FLG5OO         1          COLHDG('FUTURE' 'USE')
     A            DRIVOO        35          COLHDG('DRIVER' 'NAME')
     A            TERMOO         4          COLHDG('HOME' 'TERMINAL')
     A            PLUSOO         1          COLHDG('MORE' 'THAN' 'ONE')
     A            TRACOO         3  0       COLHDG('NO OF' 'TRACTORS')
     A**********************************************************************
     A*           PFND            1964 PENSION FUND ACCUMULATION BY DRIVER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 01000
     A*         R PFNDFM
     A*
     A            EMPNOPD        6          COLHDG('EMPLOYEE' 'CODE')
     A            PAYDTPD        7  0       COLHDG('PAYMENT' 'DATE')
     A*                                     CYYMMDD
     A            FORYRPD        4  0       COLHDG('FOR' 'YEAR')
     A            AMNT$PD        7  2       COLHDG('FUNDED' 'AMOUNT')
     A            MILESPD        7  0       COLHDG('MILES')
     A            BYML$PD        7  2       COLHDG('CALC AMNT' 'BY MILES')
     A            HOURSPD        5  2       COLHDG('HOURS')
     A            BYHR$PD        7  2       COLHDG('CALC AMNT' 'BY HOURS')
     A**********************************************************************
     A*           PFNT                 PENSION FUND CALCULATION VARIABLES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 005000 01000
     A*         R PFNTFM
     A*
     A            EFFTOPT        7  0       COLHDG('EFF TO' 'DATE')
     A*                                     CYYMMDD (9999999 ALLOWED)
     A            PERHRPT       10  5       COLHDG('$ PER' 'HOUR')
     A            PERMLPT       10  5       COLHDG('$ PER' 'MILE')
     A            YRMAXPT        7  2       COLHDG('$ MAX' 'PER YEAR')
     A            WKMAXPT        7  2       COLHDG('$ MAX' 'PER WEEK')
     A**********************************************************************
     A*           PFN1             509 PENSION FUND ACCUMULATION BY DRIVER
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 01000
     A*         R PFN1FM
     A*
     A            COMP#P1        4  0       COLHDG('COMPANY' 'LAWSON' 'CODE')
     A            EMPNOP1        9  0       COLHDG('EMPLOYEE' 'LAWSON' 'CODE')
     A            FORYRP1        4  0       COLHDG('FOR' 'YEAR')
     A            FORQTP1        1  0       COLHDG('FOR' 'QUARTER')
     A            ENDWKP1         L         COLHDG('WEEK END' 'SATURDAY')
     A                                      DFT('0001-01-01')
     A            HOURSP1        5  2       COLHDG('HOURS')
     A**********************************************************************
     A*           PFN2             509 PENSION FUND ACCUMULATION BY DRIVER MONTH
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 005000 01000
     A*         R PFN2FM
     A*
     A            COMP#P2        4  0       COLHDG('COMPANY' 'LAWSON' 'CODE')
     A            EMPNOP2        9  0       COLHDG('EMPLOYEE' 'LAWSON' 'CODE')
     A            FORYRP2        4  0       COLHDG('FOR' 'YEAR')
     A            FORQTP2        1  0       COLHDG('FOR' 'QUARTER')
     A            FORMNP2        2  0       COLHDG('FOR' 'MONTH')
     A            ENDWKP2         L         COLHDG('WEEK END' 'SATURDAY')
     A                                      DFT('0001-01-01')
     A            HOURSP2        5  2       COLHDG('HOURS')
     A**********************************************************************
     A*           REVT                 MARMAXX PRO'S - REVENUE TYPE TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000005 01000
     A*         R REVTFM
     A*
     A            RECIDRT        4          COLHDG('RECORD ID')
     A            ACCT#RT        5  0       COLHDG('DEDICATED' 'ACCOUNT')
     A            DCLOCRT        6          COLHDG('DC LOCATION' 'CODE')
     A**********************************************************************
     A*           PAPT                 PRE-ASSIGNED PRO'S - TABLE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000005 01000
     A*         R PAPTFM
     A*
     A            CUSTPAT        5  0       COLHDG('CUSTOMER' 'ACCOUNT')
     A            MAX#PAT        5  0       COLHDG('MAX BLOCK' 'SIZE')
     A            TYPEPAT        1          COLHDG('PRO' 'TYPE')
     A            STYPPAT        3          COLHDG('PRO' 'SUB-TYPE')
     A            PORCPAT        1          COLHDG('P/PAID' 'COLLECT')
     A            SHPNMAT       25          COLHDG('SHIPPER' 'NAME ON PRO')
     A            GOODSAT       25          COLHDG('DESCRIPTION' 'ON PRO')
     A**********************************************************************
     A*           PAPH                 PRE-ASSIGNED PRO'S - HISTORY FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000005 01000
     A*         R PAPHFM
     A*
     A            CUSTPAH        5  0       COLHDG('CUSTOMER' 'ACCOUNT')
     A            MAX#PAH        5  0       COLHDG('BLOCK' 'SIZE')
     A            FRSTPAH        7  0       COLHDG('FIRST' 'PRO#')
     A            LASTPAH        7  0       COLHDG('LAST' 'PRO#')
     A            USERPAH       10          COLHDG('USER')
     A            DATEPAH         L         COLHDG('DATE')
     A                                      DFT('0001-01-01')
     A            TIMEPAH        4  0       COLHDG('TIME')
     A**********************************************************************
     A*           ONTC                 STORES ON-TIME - CUSTOMER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0010000 000005 01000
     A*         R ONTCFM
     A*
     A            CUSTTC         2          COLHDG('CUSTOMER' 'ID')
     A            NAMETC        20          COLHDG('CUSTOMER' 'NAME')
     A            PLUSTC         3  0       COLHDG('MINUTES' 'PLUS')
     A            MINSTC         3  0       COLHDG('MINUTES' 'MINUS')
     A**********************************************************************
     A*           ONTS                 STORES ON-TIME - STORE FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 000005 10000
     A*         R ONTSFM
     A*
     A            STORETS        6          COLHDG('STORE' 'LOCATION')
     A            DROP_TS        1          COLHDG('DROP' 'LOCATION')
     A            DUETMTS        4  0       COLHDG('DUE' 'TIME')
     A            FRMTMTS        4  0       COLHDG('TIME FRAME' 'FROM')
     A            TOTIMTS        4  0       COLHDG('TIME FRAME' 'TO')
     A**********************************************************************
     A*           EDIX                 204/211 EDI/NRS LOCATION X-REF
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 000005 10000
     A*         R EDIXFM
     A*
     A            CUST#EX        5  0       COLHDG('CUSTOMER' 'ACCOUNT')
     A            CSTCDEX       80          COLHDG('CUSTOMER' 'LOCATION' 'CODE')
     A            NRTCDEX        6          COLHDG('NRT' 'LOCATION' 'CODE')
     A            TERM#EX        4          COLHDG('TERMINAL' 'ID')
     A**********************************************************************
     A*           NAIH                 NAIT INVOICE HEADER FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R NAIHFM
     A*
     A            COMPNH         3          COLHDG('NRS' 'COMPANY')
     A            INV#NH        17          COLHDG('INVOICE#')
     A            YEARNH         4  0       COLHDG('APPLIED' 'YEAR')
     A            MNTHNH         2  0       COLHDG('APPLIED' 'MONTH')
     A            TOT$NH         7  2       COLHDG('TOTAL' 'AMOUNT')
     A**********************************************************************
     A*           NAID                 NAIT INVOICE DETAIL FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 010000 10000
     A*         R NAIDFM
     A*
     A            COMPND         3          COLHDG('NRS' 'COMPANY')
     A            INV#ND        17          COLHDG('INVOICE#')
     A            YEARND         4  0       COLHDG('APPLIED' 'YEAR')
     A            MNTHND         2  0       COLHDG('APPLIED' 'MONTH')
     A            DRVRND         6          COLHDG('DRIVER' 'CODE')
     A            AMT1ND         7  2       COLHDG('1ST' 'INSTALLMENT' '$$$$')
     A            DAT1ND          L         COLHDG('1ST' 'INSTALLMENT' 'DATE')
     A                                      DFT('0001-01-01')
     A            AMT2ND         7  2       COLHDG('2ND' 'INSTALLMENT' '$$$$')
     A            DAT2ND          L         COLHDG('2ND' 'INSTALLMENT' 'DATE')
     A                                      DFT('0001-01-01')
     A            AD$$ND         7  2       COLHDG('ORIGINAL' 'AMOUNT')
     A            ADUSND        10          COLHDG('ADD' 'USER')
     A            ADDTND          L         COLHDG('ADD' 'DATE')
     A                                      DFT('0001-01-01')
     A            ADTMND         4  0       COLHDG('ADD' 'TIME')
     A            UPUSND        10          COLHDG('UPDATE' 'USER')
     A            UPDTND          L         COLHDG('UPDATE' 'DATE')
     A                                      DFT('0001-01-01')
     A            UPTMND         4  0       COLHDG('UPDATE' 'TIME')
     A**********************************************************************
     A*           PUPS                 MATCH 2 PUPS RUNNING SIMULTANEOUSLY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R PUPSFM
     A*
     A            STAT2P         1          COLHDG('STATUS')
     A*                                    ' ' = OPEN
     A*                                    'D' = DISPATCHED
     A*                                    'C' = COMPLETED
     A            TERM2P         4          COLHDG('BOOKING' 'TERMINAL')
     A            SHTL2P         7  0       COLHDG('WORKING' 'SHUTTLE')
     A            STP12P         6          COLHDG('STOP 1' 'LOCATION' 'START')
     A            STP22P         6          COLHDG('STOP 2' 'LOCATION' 'STORE1')
     A            STP32P         6          COLHDG('STOP 3' 'LOCATION' 'STORE2')
     A            STP42P         6          COLHDG('STOP 4' 'LOCATION' 'FINISH')
     A            MODE2P         1          COLHDG('RUN' 'MODE')
     A*                                    '1' = FROM BKG TERMINAL TO N. BERGEN
     A*                                          THEN BOTH PUPS ARE T-CALLED
     A*                                                              |--- STORE1
     A*                                          START ==== N.BERGEN |
     A*                                                              |--- STORE2
     A*                                    '2' = FROM BKG TERMINAL TO STORE 1
     A*                                          THEN 1ST PUP COMPLETED AND
     A*                                          2ND - T-CALLED THEN CONTINUED
     A*                                          START ==== STORE1 ------ STORE2
     A*                                    '3' = FROM BKG TERMINAL TO STORE 2
     A*                                          THEN BOTH PUP'S ARE COMPLETED
     A*                                          START ==== STORE2 ====== STORE1
     A*                                    '4' = FROM BKG TERMINAL TO THE END
     A*                                          THEN BOTH PUP'S ARE COMPLETED
     A*                                          START == STORE1 == STORE2 = END
     A            FRST2P         7  0       COLHDG('FIRST' 'PUP')
     A            SCND2P         7  0       COLHDG('SECOND' 'PUP')
     A            USER2P        10          COLHDG('ADD' 'USER')
     A            DATE2P          L         COLHDG('ADD' 'DATE')
     A                                      DFT('0001-01-01')
     A            TIME2P         4  0       COLHDG('ADD' 'TIME')
     A**********************************************************************
     A*           USPG                 USER/PROGRAM AUTHORIZATION
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R USPGFM
     A*
     A            USERUP        10          COLHDG('USER' 'PROFILE')
     A            PGMRUP        10          COLHDG('PROGRAM' 'NAME')
     A*
     A**********************************************************************
TRIP A*           TLNU                 TRAILER LOAD NOT USED
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R TLNUFM
     A*
     A            BILYNNU        1          COLHDG('BILLED' 'Y/N')
     A            DIVI#NU        4          COLHDG('DIVISION')
TRIP A            TRIP#NU        7  0       COLHDG('TRIP#')
     A            ORDERNU        7  0       COLHDG('ORDER')
     A            STOP#NU        2  0       COLHDG('STOP')
     A            DISP#NU        1S 0       COLHDG('DISP#')
     A            DISDTNU         L         COLHDG('DISPATCH' 'DATE')
     A                                      DFT('0001-01-01')
     A            DISTMNU        4  0       COLHDG('DISPATCH' 'TIME')
     A            LOCTNU         6          COLHDG('LOCATION')
     A            PU#NU          7  0       COLHDG('PU NUM')
     A            DRIV1NU        6          COLHDG('DRIVER')
     A            RSNCDNU        1          COLHDG('REASON' 'CODE')
     A            REMRKNU       60          COLHDG('REMARK')
     A            ENTDTNU         L         COLHDG('ENTRY DATE')
     A                                      DFT('0001-01-01')
     A            BILDTNU         L         COLHDG('BILLED DATE')
     A                                      DFT('0001-01-01')
     A* ADDED ON 7/27/12
     A            BILUSNU       10          COLHDG('PROCESSED USER')
     A            PRO##NU        7  0       COLHDG('PRO#')
     A            PUVDLNU        1          COLHDG('PICKUP OR DELIVERY')
     A*                                     P/D
NC40 A**********************************************************************
NC40 A*           LRDLFM               LATE REASON DELAY LIMIT
NC40 A**********************************************************************
NC40 A*                                     SIZE   INCR.  TIMES
NC40 A*&                                   0100000 010000 10000
NC40 A*         R LRDLFM
NC40 A            GROUPDL        2          COLHDG('GROUP')
NC40 A            TMSPANDL       1          COLHDG('TIME' 'SPAN')
NC40 A*                                     'M' = MINUTE
NC40 A*                                     'H' = HOUR
NC40 A*                                     'D' = DAY
NC40 A            LATLIMDL       3  0       COLHDG('LATE' 'LIMIT')
NC40 A*
GP03 A            DOCIDDL       15          COLHDG('EDI' 'DOCID')
NC40 A*
NC40 A**********************************************************************
NC40 A*           LRVS                 LATE REASON CODE XREF
NC40 A**********************************************************************
NC40 A*                                     SIZE   INCR.  TIMES
NC40 A*&                                   0100000 010000 10000
NC40 A*         R LRVSFM
NC40 A            GROUPVS        2          COLHDG('GROUP')
NC40 A**GP02        DOCIDVS        5          COLHDG('DOCID')
GP02 A            DOCIDVS       15          COLHDG('DOCID')
NC40 A*
NC40 A*
NC40 A**********************************************************************
NC40 A*           STLR                 STOP LATE REASON CODE
NC40 A**********************************************************************
NC40 A*                                     SIZE   INCR.  TIMES
NC40 A*&                                   0100000 010000 10000
NC40 A*         R STLRFM
NC40 A            ORDERSR        7  0       COLHDG('ORDER #')
NC40 A            STKEYSR        9P 0       COLHDG('STOP ID')
NC40 A            EDICDSR        3          COLHDG('EDI' 'CODE')
NC40 A*
NC40 A*
TRIP1A**********************************************************************
TRIP1A*           DBPD
TRIP1A**********************************************************************
TRIP1A*     DBPD
TRIP1A**        R DBPDFM
TRIP1A            BILYNDB        1          TEXT('Billed Y/n')
TRIP1A            DIVI#DB        4          TEXT('Division')
TRIP1A            TRIP#DB        7  0       TEXT('Trip#')
TRIP1A            ORDERDB        7  0       TEXT('Order')
TRIP1A            DISP#DB        1S 0       TEXT('Disp#')
TRIP1A            DISDTDB         L         TEXT('Dispatch Date')
TRIP1A            DISTMDB        4  0       TEXT('Dispatch Time')
TRIP1A            LOCTDB         6          TEXT('Location')
TRIP1A            PU#DB          7  0       TEXT('Pu Num')
TRIP1A            DRIV1DB        6          TEXT('Driver')
TRIP1A            RSNCDDB        1          TEXT('Reason Cdoe')
TRIP1A            REMRKDB       60          TEXT('Remark')
TRIP1A            ENTDTDB         L         TEXT('Entry Date')
     A**********************************************************************
     A*           T53E    -    3E      EDI RTS 753 FLAT FILE
     A*                                FOR TARGET  EAST COAST DATA
     A*                                (REPLACING 753 EDI)
     * IF ANY CHANGES DONE ON THIS FILE AND THIS FILE RECREATED
     *         THEN SAVE THE DATA IN T53W AND DO CRTDUPOBJ OF T53E TO CREATE
     *         T53W  (THEN RESTORE THE DATA INTO T53W)
     *         T53W IS THE TARGET WEST COAST DATA
     *  **NOTE __ THERE IS T53ESAVE AND T53WSAVE FILES IN OLFILE5 FOR BACKUP
     *             THAT WILL NEED TO BE RECREATED FROM T53E AND T53W IF
     *              T53E IS CHANGED
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T53EFM
     A*
     A            DISP#3E       12          COLHDG('DISPATCH #')
     A            PONUM3E        7  0       COLHDG('PO')
     A            REL##3E       10          COLHDG('RELEASE' 'ID')
     A            VEND#3E        7  0       COLHDG('TARGET' 'VENDOR#')
     A            LOCGR3E        6          COLHDG('FAMILY' 'ID')
     A**                                       LOCGRRT
     A            VNAME3E       35          COLHDG('VENDOR' 'NAME')
     A            ADDR13E       35          COLHDG('ADDR1')
     A            ADDR23E       35          COLHDG('ADDR2')
     A            CITYC3E       35          COLHDG('CITY')
     A            STATE3E        2          COLHDG('STATE')
     A            ZIPCD3E       10          COLHDG('ZIP')
     A            CNAME3E       35          COLHDG('CONTACT' 'NAME')
     A            CTEL#3E       25          COLHDG('CONTACT' 'TEL')
     A            CFAX#3E       25          COLHDG('CONTACT' 'FAX')
     A            DESDC3E        4  0       COLHDG('DEST' 'DC')
     A            DESCT3E       35          COLHDG('DEST' 'CITY')
     A            EARSH3E       16          COLHDG('EARLIEST' 'SHIP')
     A            LATSH3E       16          COLHDG('LATEST' 'SHIP')
     A            EARDL3E       16          COLHDG('EARLIEST' 'DELV')
     A            CANCL3E       16          COLHDG('CANCEL' 'DT/TM')
     A            WEIGH3E       10  0       COLHDG('WEIGHT')
     A            CUBES3E       10  0       COLHDG('CUBE')
     A            QCTNS3E       10  0       COLHDG('QTY')
     A            PALLT3E       10  0       COLHDG('PALLETS')
     A            STACK3E        1          COLHDG('STACKABLE')
     A            COMMC3E       12          COLHDG('COMMODITY' 'CODE')
     A            EQTYP3E        8          COLHDG('EQ.TYPE')
     A            DEPTC3E        4  0       COLHDG('DEPARTMENT')
     A            BLNUM3E       30          COLHDG('B/L NUMBER')
     A            NOTES3E       80          COLHDG('NOTES')
     A            COPO#3E       12          COLHDG('COMBO PO#')
     A            CONSC3E        4          COLHDG('CONS' 'SCAC')
     A            PUPSC3E        4          COLHDG('PU'   'SCAC')
     A            POFUL3E       17          COLHDG('DEPT/PO/DC')
     A            FRTER3E        1          COLHDG('FRGT' 'TERM')
     A            INCDT3E       16          COLHDG('INCOMING' 'DATE/TM')
     A*                                       DATE AND TIME STAMP ON TARGET
     A*                                        INCOMING FILE THAT RUTUL
     A*                                         USES TO POPULATE THIS
     A**********************************************************************
     A*           SHBK                 EASY SHUTTLE BOOKING TERMINAL
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R SHBKFM
     A*
     A            SRVCSH         4          COLHDG('SERVICE' 'TERMINAL')
     A            DRIVSH         1          COLHDG('DRIVER' 'TYPE')
     A*                                     H/O/S
     A            FROMSH         6          COLHDG('FROM' '(SHIPPER)')
     A            TO__SH         6          COLHDG('TO' '(CONSIGNEE)')
     A            BOOKSH         4          COLHDG('BOOKING' 'TERMINAL')
     A            STATSH         1          COLHDG('RECORD' 'STATUS')
     A*                                     I/BLANK
     A            USERSH        10          COLHDG('USER')
     A            DATESH          L         COLHDG('DATE') DFT('0001-01-01')
     A            TIMESH         6  0       COLHDG('TIME')
     A*
     A**********************************************************************
     A*           ERELFM               EARLY REASON EARLY LIMIT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R ERELFM
     A            GROUPEL        2          COLHDG('GROUP')
     A            TMSPANEL       1          COLHDG('TIME' 'SPAN')
     A*                                     'M' = MINUTE
     A*                                     'H' = HOUR
     A*                                     'D' = DAY
     A            EARTIMEL       3  0       COLHDG('EARLY' 'LIMIT')
     A*
     A            DOCIDEL       15          COLHDG('EDI' 'DOCID')
     A*
     A**********************************************************************
     A*           T990    -    9H      EDI RTS 990 HEADER
     A*                                TO SEND TO TARGET FOR THE 204 WE
     A*                                RECEIVED IN EDI FROM THEM AND WE ACCEPT
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 001000 00010
     A*         R T990FM
     A*
     A            INTID9H       10          COLHDG('EDI SENDER' 'ID')
     A            DISP#9H       15          COLHDG('DISPATCH #')
     A            SCAC9H         4          COLHDG('SENDER' 'SCAC')
     A            DATE9H         8  0       COLHDG('DATE' 'ACCEPTED')
     A*                                        CCYYMMDD
     A            REPS9H         1          COLHDG('ACCEPT/' 'REJECT')
     A*                                           A - ACCEPT
     A*                                           D - DECLINE
     A            OURRF9H        7  0       COLHDG('OUR' 'REF#')
     A*                                        ORDER#/PU#??
     A            PSCAC9H        4          COLHDG('PU' 'CARRIER')
     A*                                       CONSOLIDATOR SENDS THIS
     A            STAT9H         1          COLHDG('MOVED')
     A**********************************************************************
     A*           CSBE                 CONSIGNEE/SHIPPER/BILL-TO EXCPT RATES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R CSBEFM
     A*
     A            CONSER         5  0       COLHDG('CONSIGNEE' 'NUMBER')
     A            SHIPER         6          COLHDG('SHIPPER' 'CODE')
     A            CUSTER         5  0       COLHDG('CUSTOMER' 'CODE')
     A            RATEER         3  0       COLHDG('EXCEPTION' 'RATE')
     A*
     A**********************************************************************
     A*           TRIN                 TRINIUM FILE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0001000 000025 00002
     A*         R TRINFM
     A*
     A            LOCATI         6          COLHDG('LOCATION CODE')
     A            NAMETI        25          COLHDG('TERMINAL NAME')
     A            ADDRTI        25          COLHDG('ADDRESS')
     A            CITYTI        15          COLHDG('CITY')
     A            WEBSTI        25          COLHDG('WEBSITE')
     A            LOGITI        40          COLHDG('LOGIN')
     A            PASSTI        25          COLHDG('PASSWORD')
     A            SITETI        20          COLHDG('TRINIUM SITE')
     A            COUNTI         7  0       COLHDG('COUNT')
     A            USR1TI        20          COLHDG('USER #1')
     A            USR2TI        20          COLHDG('USER #2')
     A            TMFITI         1          COLHDG('TMF IGNORE')
     A* FIELDS ADDED 2/14/13 - FOR TERMS REQUIRING APPT & REG WEEK SCD
     A            APPTTI         1          COLHDG('APPT' 'REQ')
     A*                                     Y = APPT REQUIRED
     A            CDAYTI         6          COLHDG('CLOSED' 'DAYS')
     A*                                     6 BYTE FIELD MTWTFS
     A*                                     X = CLOSED DAYS
     A**********************************************************************
     A*           TRIX                 TRINIUM FILE  - WEEKLY DETAILS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   1000000 100000 10000
     A*         R TRIXFM
     A*
     A            LOCATIX        6          COLHDG('LOCATION CODE')
     A            CLOSEIX         L         COLHDG('CLOSED' 'DATE')
     A                                      DFT('0001-01-01')
     A**********************************************************************
     A*           RREX                 REVENUE RE-ALLOCATION EXCEPTION TABLE
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R RREXFM
     A*
     A            BOOKRE         4          COLHDG('BOOKING' 'TERMINAL')
     A            SRV1RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV2RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV3RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV4RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV5RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV6RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV7RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV8RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV9RE         4          COLHDG('SERVICE' 'TERMINAL')
     A            SRV0RE         4          COLHDG('SERVICE' 'TERMINAL')
     A*
     A**********************************************************************
     A*           CARL                 CA 10/34 HOURS RULES IGNORED - LOG
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0100000 010000 10000
     A*         R CARLFM
     A*
     A            DRIVCR         6          COLHDG('DRIVER' 'ID')
     A            ERORCR        40          COLHDG('ERROR' 'MESSAGE')
     A            USERCR        10          COLHDG('USER' 'PROFILE')
     A            DATECR          L         COLHDG('DATE') DATFMT(*ISO)
     A                                      DFT('0001-01-01')
     A            TIMECR         4  0       COLHDG('TIME')
     A*
     A**********************************************************************
     A*           ILXF      -               PRELIMINARY I/L LIABILITY ENTRY
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0500000 025000 00010
     A*         R ILXFFM
     * ANY CHANGES S/B IMMEDIATELY SYNCHRONIZED INTO ILXFSAVE
     A*
     A*SEE REHD   ACRECF         1          COLHDG('ACTIVE' 'CODE')
     A*                                       F = NON-REVENUE PRO
     A            PRO##F         7  0       COLHDG('NRS' 'PRO #')
     A            ILCODF         4          COLHDG('I/L' 'CARRIER')
     A            ILPROF        17          COLHDG('I/L' 'INVOICE#')
     A*                                        ALWAYS BLANK IN OL5
     A            ILAMTF         7  2       COLHDG('INVOICE' 'TOTAL AMOUNT')
     A            ILPAYF         7  2       COLHDG('INVOICE' 'PAID AMOUNT')
     A*                                        ALWAYS 0 IN OL5
     A            ILOPNF         7  2       COLHDG('INVOICE' 'OPEN AMOUNT')
     A            ENTDTF          L         COLHDG('ENTRY' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            ENTTMF         4  0       COLHDG('ENTRY' 'TIME')
     A            ENTUSF        10          COLHDG('ENTRY' 'USER')
     A            CHGDTF          L         COLHDG('UPDATE' 'DATE')
     A                                      DATFMT(*ISO) DFT('0001-01-01')
     A            CHGTMF         4  0       COLHDG('UPDATE' 'TIME')
     A            CHGUSF        10          COLHDG('UPDATE' 'USER')
     A*
     A**********************************************************************
     A*           WKOO      -                WORK FILE FOR OPEN ORDERS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000100 00005
     A*         R WKOOFM
     A*
     A            ACRECWO        1          COLHDG('ACTIVE' 'CODE')
     A            ORDERWO        7  0       COLHDG('ORDER#')
     A            DIV##WO        4          COLHDG('DIVISION')
     A            SCAC1WO        4          COLHDG('PRELOAD' 'SCAC')
     A            TRAL1WO        7          COLHDG('PRELOAD' 'TRAILER')
     A*
     A**********************************************************************
     A*           POEC      -                PORT OF ENTRY CONSIGNEES
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0002500 000100 00005
     A*         R POECFM
     A*
     A            ACRECPC        1          COLHDG('ACTIVE' 'CODE')
     A            CONS#PC        9  0       COLHDG('CONSIGNEE#')
     A            CONSNPC       25          COLHDG('CONSIGNEE' 'NAME')
     A            GRPCDPC        4          COLHDG('GROUP' 'CODE')
     A            DIVI#PC        5          COLHDG('DIVISION')
     A            PO#12PC        2          COLHDG('PO# 1-2')
     A*
     A**********************************************************************
GP09 A*           IKTX      -                IKEA TRANSLOADS INFO
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00100
     A*         R IKTXFM
     A*
     A            ACRECIK        1          COLHDG('ACTIVE' 'CODE')
     A            EDIMBIK       10          COLHDG('EDI 204' 'MAILBOX')
     A            EDITYIK        2          COLHDG('EDI 204' 'TYPE')
     A*                                       DD --- DOOR TO DOOR
     A*                                       PD - PIER TO DOOR
     A*                                       PP - PIER TO PIER
     A*                                       DP - DOOR TO PIER
     A            CONT#IK       11          COLHDG('CONTAINER #')
     A            ORDR#IK        7  0       COLHDG('ORDER#')
     A            PICDTIK        8  0       COLHDG('PICKED UP' 'DATE')
     A*                                        YYYYMMDD
     A            CMPDTIK        8  0       COLHDG('COMPLETED' 'DATE')
     A*                                        YYYY-MM-DD
     A            SHIDOIK       30          COLHDG('SHIPMENT ID')
     A*                                         FRM EDI IKEA204
     A            SHIDSIK        1          COLHDG('SHIPID' 'STATUS')
     A*                                         'C' = COMPLETED
     A*                                         'X' = CANCELLED
     A            ORIGNIK       30          COLHDG('PU LOC')
     A*                                         IKEA'S LOC CODE
     A            DESTNIK       30          COLHDG('DEST LOC')
     A*                                         IKEA'S LOC CODE
     A            WGTEDIK        7  0       COLHDG('WEIGHT' 'EDID')
     A            WGTRCIK        7  0       COLHDG('WEIGHT' 'RCVD')
     A            OVEGTIK        1          COLHDG('OVERWEIGHT' 'FLAG')
     A*                                       'Y' = YES
     A*                                       ' ' = NO
     A            SEALIK         8          COLHDG('SEAL #')
     A            CARRIK         4          COLHDG('OB CARR')
     A            TRALIK         7          COLHDG('OB TRL#')
     A            COMMTIK       60          COLHDG('OUR COMMENTS')
     A            IKCMTIK       40          COLHDG('IKEA COMMENTS')
     A            EXTRA1IK      20          COLHDG('EXTRA FLD 1')
     A            EXTRA2IK      20          COLHDG('EXTRA FLD 2')
     A            UPDUSRIK      10A         TEXT('RECORD UPDATED BY')
     A                                      COLHDG('UPDATED BY')
     A            UPDDTEIK       8  0       TEXT('RECORD UPDATED DATE')
     A                                      COLHDG('UPDATED DATE')
     A            UPDTMEIK       6  0       TEXT('RECORD UPDATED TIME')
     A                                      COLHDG('UPDATED TIME')
     A**********************************************************************
GP10 A*           TJWN      -        TJ MAX LTL FOR WINNERS EDI LOG
     A*                                 WHICH WE DO NOT CREATE PICK UPS
     A**********************************************************************
     A*                                     SIZE   INCR.  TIMES
     A*&                                   0050000 010000 00100
     A*         R TJWNFM
     A*
     A            ACRECWN        1          COLHDG('ACTIVE' 'CODE')
     A            LOAD#WN       30          COLHDG('EDI ' 'LOAD#')
     A            EDIMBWN       10          COLHDG('EDI 204' 'MAILBOX')
     A            AVLPUDWN        L         COLHDG('AVAIL ' 'PUDATE')
     A            REASNCWN       3  0       COLHDG('REASON ' 'CD-NO PU#')
     A*                                        REASON CODE WHY WE DID NOT
     A*                                        CREATE A PICKUP IN OUR SYS
     A            UPDDTEWN        L         TEXT('RECORD CREATED DATE')
     A                                      COLHDG('CREATION DATE')
     A            UPDTMEWN       6  0       TEXT('RECORD CREATED TIME')
     A                                      COLHDG('CREATION TIME')
